[[{"quran": "In the name of God, the Almighty, the Merciful.", "verse": 0, "surah": 39}, {"quran": "The sending down of the Book is from God, the Noble, the Wise.", "verse": 1, "surah": 39}, {"quran": "We have sent down to you the Book with the truth, so serve God while devoting the system to Him.", "verse": 2, "surah": 39}, {"quran": "Absolutely, to God is the true system. And those who set up allies besides Him: \"We only serve them so that they may bring us closer to God.\" God will judge between them in what they dispute. For God does not guide him who is a liar, a rejecter.", "verse": 3, "surah": 39}, {"quran": "If God wished to take a son, He could have exalted from among His creation what He pleases. Be He glorified; He is God, the One, the Supreme.", "verse": 4, "surah": 39}, {"quran": "He created the heavens and the earth with the truth. He rolls the night over the day, and He rolls the day over the night. And He commissioned the sun and the moon, each running for an appointed term. Absolutely, He is the Noble, the Forgiving.", "verse": 5, "surah": 39}, {"quran": "He created you from one person, then He made from it its mate. And He sent down to you eight pairs of the livestock. He creates you in the wombs of your mothers, a creation after a creation in three darkness's. Such is God your Lord. To Him belongs the sovereignty. There is no god besides Him. How is it then you deviate?", "verse": 6, "surah": 39}, {"quran": "If you reject, then know that God is in no need of you, and He is displeased with rejection for His servants. And if you are thankful, He is pleased with it for you. And none shall carry the burdens of another. Then to your Lord is your return, and He will inform you of everything you had done. He is fully aware of what is in the chests.", "verse": 7, "surah": 39}, {"quran": "And when the human being is afflicted with adversity, he implores his Lord, turning in repentance to Him. But then, when He grants him a blessing from Him, he forgets his previous imploring, and sets up equals with God, in order to mislead others from His path. Say: \"Enjoy your rejection for a while; for you are of the dwellers of the Fire.\"", "verse": 8, "surah": 39}, {"quran": "Is one better who is devout during the night, prostrating and standing, fearing the Hereafter, and seeking the mercy of his Lord? Say: \"Are those who know equal to those who do not know?\" Only those who possess intelligence will remember.", "verse": 9, "surah": 39}, {"quran": "Say: \"O My servants who believed, be aware of your Lord.\" For those who worked righteousness in this world will be a good reward, and the earth of God is spacious. Those who steadfastly persevere will receive their recompense fully, without reckoning.", "verse": 10, "surah": 39}, {"quran": "Say: \"I have been commanded to serve God, devoting the system to Him.\"", "verse": 11, "surah": 39}, {"quran": "\"And I was commanded to be the first of those who submit.\"", "verse": 12, "surah": 39}, {"quran": "Say: \"I fear, if I disobeyed my Lord, the retribution of a great Day.\"", "verse": 13, "surah": 39}, {"quran": "Say: \"God is the One I serve, devoting my system to Him.\"", "verse": 14, "surah": 39}, {"quran": "\"Therefore, serve whatever you wish besides Him.\" Say: \"The losers are those who lose their souls, and their families, on the Day of Resurrection. Indeed, such is the real loss.\"", "verse": 15, "surah": 39}, {"quran": "They will have coverings of fire from above them and below them. It is as such that God makes His servants fearful: \"O My servants, you shall reverence Me.\"", "verse": 16, "surah": 39}, {"quran": "And for those who avoid serving evil, and turn to God in repentance, for them are glad tidings. So give the good news to My servants.", "verse": 17, "surah": 39}, {"quran": "The ones who listen to what is being said, and then follow the best of it. These are the ones whom God has guided, and these are the ones who possess intelligence.", "verse": 18, "surah": 39}, {"quran": "As for those who have deserved the retribution; can you save those who are in the Fire?", "verse": 19, "surah": 39}, {"quran": "But those who reverence their Lord, they will have dwellings constructed upon dwellings, with rivers flowing beneath them. The promise of God, and God does not break the promise.", "verse": 20, "surah": 39}, {"quran": "Do you not see that God sends down water from the sky, then lets it run as springs in the earth, then He produces with it plants of various colors, then they grow until they turn yellow, then He makes them dry and broken? In this is a reminder for those who possess intelligence.", "verse": 21, "surah": 39}, {"quran": "If God comforts the chest of a person to submission, then he will be on a light from his Lord. So woe to those whose hearts are hardened against remembering God. They have gone far astray.", "verse": 22, "surah": 39}, {"quran": "God has sent down the best narrative, a Book that is similar, dual. The skins of those who are concerned towards their Lord shiver from it, then their skins and their hearts soften up to the remembrance of God. Such is the guidance of God; He guides with it whoever He wills. And for whoever God misguides, then none can guide him.", "verse": 23, "surah": 39}, {"quran": "As he who saves his face from the terrible retribution on the Day of Resurrection. And it will be said to the transgressors: \"Taste for what you have earned.\"", "verse": 24, "surah": 39}, {"quran": "Those before them have denied, and thus the retribution came to them from where they did not perceive.", "verse": 25, "surah": 39}, {"quran": "So God made them taste the humiliation in this worldly life, but the retribution in the Hereafter is far greater, if only they knew.", "verse": 26, "surah": 39}, {"quran": "And We have put forth for the people in this Qur'an from every example, that they may take heed.", "verse": 27, "surah": 39}, {"quran": "A revelation in Arabic, without any crookedness, that they may be righteous.", "verse": 28, "surah": 39}, {"quran": "God puts forth the example of a man who has partners that dispute with each other, and a man who has given to dealing with only one man. Are they the same? Praise be to God; most of them do not know.", "verse": 29, "surah": 39}, {"quran": "You will die, and they will die.", "verse": 30, "surah": 39}, {"quran": "Then, on the Day of Resurrection, you will quarrel at your Lord.", "verse": 31, "surah": 39}, {"quran": "Who is more wicked than he who lies about God, and denies the truth when it comes to him? Is there not in Hell an abode for the rejecters?", "verse": 32, "surah": 39}, {"quran": "And those who came with the truth, and believed in it, these are the righteous.", "verse": 33, "surah": 39}, {"quran": "They shall have what they wish at their Lord. Such is the reward for the good doers.", "verse": 34, "surah": 39}, {"quran": "So that God may cancel for them the worst that they did, and He may recompense them their reward for the best of what they used to do.", "verse": 35, "surah": 39}, {"quran": "Is God not enough for His servant? And they frighten you with others besides Him. And whoever God sends astray, then for him there will be no guide.", "verse": 36, "surah": 39}, {"quran": "And whoever God guides, then there will be none that can mislead him. Is God not Noble, with Vengeance?", "verse": 37, "surah": 39}, {"quran": "And if you ask them: \"Who has created the heavens and the earth?\" They will say: \"God.\" Say: \"Do you see what you call on besides God, If God wanted any harm for me, can they alleviate His harm? Or if He wanted a mercy for me, can they hold back his mercy?\" Say: \"God is sufficient for me; in Him those who trust shall place their trust.\"", "verse": 38, "surah": 39}, {"quran": "Say: \"O my people, work according to your way, and I will work. You will come to know.\"", "verse": 39, "surah": 39}, {"quran": "\"To whom the humiliating retribution will come, and on whom a permanent retribution will be cast.\"", "verse": 40, "surah": 39}, {"quran": "We have sent down to you the Book for the people with the truth. Then, whoever is guided is guided for himself, and whoever goes astray goes astray to his own loss. And you are not a keeper over them.", "verse": 41, "surah": 39}, {"quran": "God seizes the souls at the time of their death; and for those that have not died, during their sleep. He then keeps those that have been overtaken by death, and He sends the others back until a predetermined time. In that are signs for a people who will think.", "verse": 42, "surah": 39}, {"quran": "Or have they taken intercessors besides God? Say: \"What if they possessed nothing, nor comprehended?\"", "verse": 43, "surah": 39}, {"quran": "Say: \"To God belongs all intercession.\" To Him belongs the sovereignty of the heavens and the earth, then to Him you will be returned.", "verse": 44, "surah": 39}, {"quran": "And when God alone is mentioned, the hearts of those who do not believe in the Hereafter are filled with aversion; and when others are mentioned besides Him, they rejoice!", "verse": 45, "surah": 39}, {"quran": "Say: \"Our god, Initiator of the heavens and the earth, Knower of the unseen and the seen, You will judge between Your servants regarding what they disputed in.\"", "verse": 46, "surah": 39}, {"quran": "And if those who transgressed owned everything on the earth, and its equivalent again with it, they would ransom it to avoid the terrible retribution on the Day of Resurrection. They will be shown by God what they did not expect.", "verse": 47, "surah": 39}, {"quran": "And the sinful works they had earned will be shown to them, and they will be surrounded by that which they used to mock.", "verse": 48, "surah": 39}, {"quran": "So when the human being is touched by adversity, he implores Us, then when We bestow a blessing upon him, he says: \"I attained this because of knowledge I had!\" Indeed, it is a test, but most of them do not know.", "verse": 49, "surah": 39}, {"quran": "Those before them have said the same thing, yet what they earned did not help them in the least.", "verse": 50, "surah": 39}, {"quran": "So, they suffered the evil of what they had earned. And those who transgressed from among these here will suffer the evil of what they earned; they cannot escape.", "verse": 51, "surah": 39}, {"quran": "Do they not realize that God spreads the provision for whoever He chooses, and withholds? In that are signs for a people who believe.", "verse": 52, "surah": 39}, {"quran": "Say: \"O My servants who transgressed against themselves, do not despair of the mercy of God. For God forgives all sins. He is the Forgiver, the Merciful.\"", "verse": 53, "surah": 39}, {"quran": "And repent to your Lord, and submit to Him, before the retribution comes to you. Then you cannot be helped.", "verse": 54, "surah": 39}, {"quran": "And follow the best of what has been sent down to you from your Lord, before the retribution comes to you suddenly when you least expect it.", "verse": 55, "surah": 39}, {"quran": "Lest a soul will say: \"How sorry I am for disregarding the path of God; and I was certainly one of those who mocked.\"", "verse": 56, "surah": 39}, {"quran": "Or say: \"Had God guided me, I would have been among the righteous.\"", "verse": 57, "surah": 39}, {"quran": "Or say, when it sees the retribution: \"If only I could have another chance, I would be among the good doers.\"", "verse": 58, "surah": 39}, {"quran": "Yes indeed, My revelations came to you, but you denied them and turned arrogant, and became one of the rejecters.", "verse": 59, "surah": 39}, {"quran": "And on the Day of Resurrection you will see those who lied about God, their faces will be darkened. Is there not an abode in Hell for the arrogant ones?", "verse": 60, "surah": 39}, {"quran": "And God will save those who were righteous as their reward. No harm will touch them, nor will they grieve.", "verse": 61, "surah": 39}, {"quran": "God is the Creator of all things, and He is Guardian over all things.", "verse": 62, "surah": 39}, {"quran": "To Him belongs the keys of the heavens and the earth. And those who rejected the revelations God, they are the losers.", "verse": 63, "surah": 39}, {"quran": "Say: \"Do you order me to serve other than God, O you ignorant ones?\"", "verse": 64, "surah": 39}, {"quran": "And He has inspired to you and to those before you, that if you set up partners, He will nullify all your works, and you will be of the losers.", "verse": 65, "surah": 39}, {"quran": "Therefore, you shall serve God, and be among the thankful.", "verse": 66, "surah": 39}, {"quran": "And they have not given God His true worth; and the whole earth is within His fist on the Day of Resurrection, and the heavens will be folded in His right hand. Be He glorified and exalted above what they set up.", "verse": 67, "surah": 39}, {"quran": "And the horn will be blown, whereupon everyone in the heavens and the earth will be struck unconscious, except those spared by God. Then it will be blown another time, whereupon they will all rise up, looking.", "verse": 68, "surah": 39}, {"quran": "And the earth will shine with the light of its Lord, and the record will be placed, and the prophets and the witnesses will be brought forth; and it will then be judged between them with the truth, and they will not be wronged.", "verse": 69, "surah": 39}, {"quran": "And every soul will be paid for whatever it did, for He is fully aware of everything they have done.", "verse": 70, "surah": 39}, {"quran": "And those who rejected will be driven to Hell in groups. When they reach it, and its gates are opened, its guards will say to them: \"Did you not receive messengers from among you who recited to you the revelations of your Lord, and warned you about meeting this Day?\" They said: \"Yes indeed; but the sentence of retribution has come to pass upon the rejecters.\"", "verse": 71, "surah": 39}, {"quran": "It was said: \"Enter the gates of Hell, abiding therein. What a miserable destiny for the arrogant.\"", "verse": 72, "surah": 39}, {"quran": "And those who reverenced their Lord will be driven to Paradise in groups. When they reach it, and its gates are opened, its guards will say to them: \"Peace be upon you. You have done well, so enter to abide herein.\"", "verse": 73, "surah": 39}, {"quran": "And they said: \"Praise be to God who has fulfilled His promise to us, and He made us inherit the land, enjoying Paradise as we please. What a beautiful recompense for the workers!\"", "verse": 74, "surah": 39}, {"quran": "And you will see the angels surrounding the Throne, glorifying the praise of their Lord. And it will be judged between them with the truth, and it will be said: \"Praise be to God, Lord of the worlds\"", "verse": 75, "surah": 39}]]