[[{"quran": "In the name of God, the Almighty, the Merciful.", "verse": 0, "surah": 41}, {"quran": "HM.", "verse": 1, "surah": 41}, {"quran": "A revelation from the Almighty, the Merciful.", "verse": 2, "surah": 41}, {"quran": "A Book whose verses are made detailed-an Arabic revelation for a people who know.", "verse": 3, "surah": 41}, {"quran": "A bearer of good news, and a warner. But most of them turn away; they do not hear.", "verse": 4, "surah": 41}, {"quran": "And they said: \"Our hearts are sealed from what you invite us to, and in our ears is a deafness, and there is a barrier between us and you. So do what you will, and so will we.\"", "verse": 5, "surah": 41}, {"quran": "Say: \"I am no more than a mortal like you. It is inspired to me that your god is One god, therefore you shall be upright towards Him and seek His forgiveness. And woe to the polytheists.\"", "verse": 6, "surah": 41}, {"quran": "\"The ones who do not contribute towards purification, and with regards to the Hereafter, they are disbelievers.\"", "verse": 7, "surah": 41}, {"quran": "Surely, those who believe and do good works, they will receive recompense that will not end.", "verse": 8, "surah": 41}, {"quran": "Say: \"You are rejecting the One who has created the earth in two days, and you set up equals with Him. That is the Lord of the worlds.\"", "verse": 9, "surah": 41}, {"quran": "And He placed in it stabilizers from above it, and He blessed it and established its provisions in proportion in four days, to satisfy those who ask.", "verse": 10, "surah": 41}, {"quran": "Then He settled to the heaven, while it was still smoke, and He said to it, and to the earth: \"Come willingly or unwillingly.\" They said: \"We come willingly.\"", "verse": 11, "surah": 41}, {"quran": "Thus, He then made them into seven heavens in two days, and He inspired to every heaven its affair. And We adorned the lowest heaven with lamps, and for protection. Such is the design of the Noble, the Knowledgeable.", "verse": 12, "surah": 41}, {"quran": "But if they turn away, then say: \"I have warned you of a destruction like the destruction of 'Aad and Thamud.\"", "verse": 13, "surah": 41}, {"quran": "When the messengers came to them, publicly and privately: \"You shall not serve except God.\" They said: \"Had our Lord willed, He would have sent angels. We are rejecting what you have been sent with.\"", "verse": 14, "surah": 41}, {"quran": "As for 'Aad, they turned arrogant on the earth, without any right, and they said: \"Who is mightier than us in strength?\" Did they not see that God, who has created them, was mightier than they in strength? And they were denying Our revelations.", "verse": 15, "surah": 41}, {"quran": "Consequently, We sent upon them a violent wind, for a few miserable days, that We may let them taste the humiliating retribution in this worldly life, and the retribution of the Hereafter is more humiliating; they can never win.", "verse": 16, "surah": 41}, {"quran": "And as for Thamud, We gave them the guidance, but they preferred blindness over guidance. Consequently, the blast of humiliating retribution annihilated them, because of what they earned.", "verse": 17, "surah": 41}, {"quran": "And We saved those who believed and were righteous.", "verse": 18, "surah": 41}, {"quran": "And the Day when the enemies of God will be gathered to the Fire, forcibly.", "verse": 19, "surah": 41}, {"quran": "When they come to it, their own hearing, eyes, and skins will bear witness to everything they had done.", "verse": 20, "surah": 41}, {"quran": "And they will say to their skins: \"Why did you bear witness against us?\" They will say: \"God made us speak; He is the One who causes everything to speak. He is the One who has created you the first time, and to Him you return.\"", "verse": 21, "surah": 41}, {"quran": "And there was no way you could hide from the testimony of your own hearing, or your eyes, or your skins. In fact, you thought that God was unaware of much of what you do.", "verse": 22, "surah": 41}, {"quran": "And this is the kind of thinking about your Lord that has caused you to fail, and thus you became of the losers.", "verse": 23, "surah": 41}, {"quran": "If they wait, then the Fire will be their destiny, and if they beg to be excused, they will not be excused.", "verse": 24, "surah": 41}, {"quran": "And We assigned to them associates who adorned their present and past actions. Thus, the retribution has been deserved by them the same as previous nations of Jinn and mankind; all of them were losers.", "verse": 25, "surah": 41}, {"quran": "And those who rejected said: \"Do not listen to this Qur'an and make noise over it that you may succeed.\"", "verse": 26, "surah": 41}, {"quran": "We will let those who have rejected taste a severe retribution. And We will recompense them for the evil that they used to do.", "verse": 27, "surah": 41}, {"quran": "Such is the recompense for the enemies of God. The Fire shall be their eternal abode, as a recompense for their discarding Our revelations.", "verse": 28, "surah": 41}, {"quran": "And those who have rejected will say: \"Our Lord, show us those who have misled us from among the Jinn and mankind so we can trample them under our feet, so that they would be the lowest.\"", "verse": 29, "surah": 41}, {"quran": "Those who have said: \"Our Lord is God,\" then they did right, the angels will come down upon them: \"You shall not fear, nor shall you grieve. Rejoice in the good news of Paradise that you have been promised.\"", "verse": 30, "surah": 41}, {"quran": "\"We are your allies in this worldly life and in the Hereafter. In it you will have anything your soul desires, and in it you will have anything you ask for.\"", "verse": 31, "surah": 41}, {"quran": "\"A dwelling, from a Forgiver, Merciful.\"", "verse": 32, "surah": 41}, {"quran": "And who is better in saying than he who invites to God, and does good works, and says: \"I am one of those who have submitted.\"", "verse": 33, "surah": 41}, {"quran": "Not equal are the good and the bad response. You shall resort to the one which is better. Thus, the one who used to be your enemy, may become your best friend.", "verse": 34, "surah": 41}, {"quran": "And none can attain this except those who are patient. And none can attain this except those who are extremely fortunate.", "verse": 35, "surah": 41}, {"quran": "And if bitterness from the devil afflicts you, then seek refuge with God. He is the Hearer, the Knowledgeable.", "verse": 36, "surah": 41}, {"quran": "And from among His signs are the night and the day, and the sun and the moon. Do not prostrate to the sun, nor the moon; you shall prostrate to God who has created them, if it is truly Him you serve.", "verse": 37, "surah": 41}, {"quran": "So, if they become arrogant, then those who are with your Lord glorify Him night and day, and they never despair.", "verse": 38, "surah": 41}, {"quran": "And from among His signs is that you see the land still, then, as soon as We send down the water upon it, it shakes and grows. Surely, the One who revived it can revive the dead. He is capable of all things.", "verse": 39, "surah": 41}, {"quran": "Those who distort Our revelations are not hidden from Us. Is one who is thrown into Hell better, or one who comes secure on the Day of Resurrection? Do whatever you wish; He is Seer of what you do.", "verse": 40, "surah": 41}, {"quran": "Those who have rejected the Reminder when it came to them; and it is an Honorable Book.", "verse": 41, "surah": 41}, {"quran": "No falsehood could enter it, presently or afterwards; a revelation from One Most Wise, Praiseworthy.", "verse": 42, "surah": 41}, {"quran": "What is being said to you is the same that was said to the messengers before you. Your Lord has forgiveness, and He has a painful retribution.", "verse": 43, "surah": 41}, {"quran": "And had We made it a non-Arabic revelation, they would have said: \"If only its verses were made clear!\" Non-Arabic and Arabic, say: \"For those who believe, it is a guide and healing. As for those who disbelieve, there is deafness in their ears, and they are blind to it. These will be called from a place far away.\"", "verse": 44, "surah": 41}, {"quran": "And We have given Moses the Book, but it was disputed in. And had it not been for the predetermined decision of your Lord, they would have been judged immediately. Indeed, they harbor many doubts about it.", "verse": 45, "surah": 41}, {"quran": "Whoever does good works does so for his own soul, and whoever works evil shall have the same. Your Lord does not wrong the servants.", "verse": 46, "surah": 41}, {"quran": "To Him belongs the knowledge regarding the Hour. And no fruit emerges from its sheath, nor does any female conceive or give birth, except by His knowledge. And on the Day He asks them: \"Where are My partners?\" They will say: \"With your permission, none of us will bear witness to such!\"", "verse": 47, "surah": 41}, {"quran": "And they were abandoned by that which they used to call on before, and they realized that there will be no escape.", "verse": 48, "surah": 41}, {"quran": "The human being does not tire in praying for good things. But if adversity touches him, he is disheartened, desperate!", "verse": 49, "surah": 41}, {"quran": "And when We let him taste a mercy from Us after hardship had touched him, he will say: \"This was by my actions, and I do not think that the Hour will come to pass. And even if I am returned to my Lord, I will find at Him good things for me.\" Surely, We will inform the rejecters of all they had done, and We will let them taste the severe retribution.", "verse": 50, "surah": 41}, {"quran": "And when We bless man, he withdraws and turns away, and when he suffers any adversity, then he implores at length!", "verse": 51, "surah": 41}, {"quran": "Say: \"Do you see if this was from God and then you rejected it? Who is further astray than those who are in opposition?\"", "verse": 52, "surah": 41}, {"quran": "We will show them Our signs in the horizons, and within themselves, until it becomes clear to them that this is the truth. Is it not enough that your Lord is witness over all things?", "verse": 53, "surah": 41}, {"quran": "Indeed, they are in doubt about meeting their Lord; but He is encompassing all things.", "verse": 54, "surah": 41}]]