[[{"quran": "In the name of God, the Almighty, the Merciful.", "verse": 0, "surah": 50}, {"quran": "Q, and the Qur'an of glory.", "verse": 1, "surah": 50}, {"quran": "Are they surprised that a warner has come to them from amongst them, so the rejecters said: \"This is something strange!\"", "verse": 2, "surah": 50}, {"quran": "\"Can it be that when we are dead and we become dust, that we come back later?\"", "verse": 3, "surah": 50}, {"quran": "We know which of them has become consumed with the earth; and We have with Us a record which keeps track.", "verse": 4, "surah": 50}, {"quran": "But they denied the truth when it came to them, so they are in a confused state.", "verse": 5, "surah": 50}, {"quran": "Did they not look to the heaven above them, how We built it, and adorned it, and how it has no openings?", "verse": 6, "surah": 50}, {"quran": "And the land We extended it, and placed in it stabilizers, and We gave growth in it to every kind of healthy pair.", "verse": 7, "surah": 50}, {"quran": "Something to see and a reminder for every pious servant.", "verse": 8, "surah": 50}, {"quran": "And We sent down from the sky blessed water, and We gave growth with it to gardens and grain that is harvested.", "verse": 9, "surah": 50}, {"quran": "And the palm trees, emerging with clustering fruit.", "verse": 10, "surah": 50}, {"quran": "A provision for the servants, and We gave life with it to the land which was dead. Such is the resurrection.", "verse": 11, "surah": 50}, {"quran": "Before their denial was that of the people of Noah, and the dwellers of Al-Raas, and Thamud.", "verse": 12, "surah": 50}, {"quran": "And 'Aad, and Pharaoh, and the brethren of Lot.", "verse": 13, "surah": 50}, {"quran": "And the people of the Sycamore, and the people of Tubba`. All of them disbelieved the messengers, so the promise came to pass.", "verse": 14, "surah": 50}, {"quran": "Did We have any difficulty in making the first creation? No, they are in confusion about the next creation.", "verse": 15, "surah": 50}, {"quran": "And We have created the human being and We know what his soul whispers to him, and We are closer to him than his jugular vein.", "verse": 16, "surah": 50}, {"quran": "When the two receivers meet on the right and on the left.", "verse": 17, "surah": 50}, {"quran": "He does not utter a word except a watcher is constantly with him.", "verse": 18, "surah": 50}, {"quran": "And the moment of death came with truth: \"This is what you have been trying to avoid!\"", "verse": 19, "surah": 50}, {"quran": "And the horn is blown on the promised Day.", "verse": 20, "surah": 50}, {"quran": "And every soul is brought, being driven, and with a witness.", "verse": 21, "surah": 50}, {"quran": "\"You were heedless of this, so now We have removed your veil, and your sight today is iron!\"", "verse": 22, "surah": 50}, {"quran": "And his associate said: \"Here is one who is a transgressor.\"", "verse": 23, "surah": 50}, {"quran": "\"Cast in Hell every stubborn rejecter.\"", "verse": 24, "surah": 50}, {"quran": "\"Denier of good, transgressor, doubter.\"", "verse": 25, "surah": 50}, {"quran": "\"The one who has set up with God another god; so cast him into the severe retribution.\"", "verse": 26, "surah": 50}, {"quran": "His associate said: \"Our Lord, I did not corrupt him, but he was already far astray.\"", "verse": 27, "surah": 50}, {"quran": "He said: \"Do not argue with each other before Me, I have already presented you with My promise.\"", "verse": 28, "surah": 50}, {"quran": "\"The sentence will not be changed with Me, and I do not wrong the servants.\"", "verse": 29, "surah": 50}, {"quran": "The Day We say to Hell: \"Are you full?\" And it says: \"Is there not more?\"", "verse": 30, "surah": 50}, {"quran": "And Paradise is brought near to the righteous, not far off.", "verse": 31, "surah": 50}, {"quran": "This is what you have been promised, for every obedient, steadfast.", "verse": 32, "surah": 50}, {"quran": "Who is concerned towards the Almighty while unseen, and came with a repenting heart", "verse": 33, "surah": 50}, {"quran": "Enter it in peace. This is the Day of eternal life.", "verse": 34, "surah": 50}, {"quran": "In it they will have what they wish, and We have even more.", "verse": 35, "surah": 50}, {"quran": "And how many a generation before them have We destroyed? They were stronger in power, and they had dominated the land. Did they find any refuge?", "verse": 36, "surah": 50}, {"quran": "In that is a reminder for whoever has a heart, or cares to listen while he is heedful.", "verse": 37, "surah": 50}, {"quran": "And We have created the heavens and the earth and what is between them in six days, and no fatigue touched Us.", "verse": 38, "surah": 50}, {"quran": "So be patient to what they are saying, and glorify the grace of your Lord before the rising of the sun and before the setting.", "verse": 39, "surah": 50}, {"quran": "And from the night glorify Him, and after prostrating.", "verse": 40, "surah": 50}, {"quran": "And listen to the Day when the caller will call from a near place.", "verse": 41, "surah": 50}, {"quran": "The Day they hear the scream with the truth. That is the Day of coming out.", "verse": 42, "surah": 50}, {"quran": "We are the Ones who give life and bring death, and to Us is the destiny.", "verse": 43, "surah": 50}, {"quran": "The Day when the earth will rapidly crumble away from them; that will be a gathering which is easy for Us.", "verse": 44, "surah": 50}, {"quran": "We are fully aware of what they say; and you are not a tyrant over them. So remind with the Qur'an those who fear My promise.", "verse": 45, "surah": 50}]]