[[{"quran": "In the name of God, the Almighty, the Merciful.", "verse": 0, "surah": 67}, {"quran": "Most exalted is the One in whose hands is all sovereignty, and He is capable of all things.", "verse": 1, "surah": 67}, {"quran": "The One who has created death and life, that He may test you, which of you will do better works? He is the Noble, the Forgiving.", "verse": 2, "surah": 67}, {"quran": "He created seven heavens in layers. You do not see any imperfection in the creation by the Almighty. Keep looking; do you see any flaw?", "verse": 3, "surah": 67}, {"quran": "Then look again twice; your eyes will come back humiliated and tired.", "verse": 4, "surah": 67}, {"quran": "And We have adorned the lower heaven with lamps, and We made it with projectiles against the devils; and We prepared for them the retribution of the blazing Fire.", "verse": 5, "surah": 67}, {"quran": "And for those who rejected their Lord will be the retribution of Hell. What a miserable destiny.", "verse": 6, "surah": 67}, {"quran": "When they are cast therein, they hear its furor as it boils.", "verse": 7, "surah": 67}, {"quran": "It almost explodes from rage. Whenever a group is thrown therein, its keepers would ask them: \"Did you not receive a warner?\"", "verse": 8, "surah": 67}, {"quran": "They said: \"Yes indeed; a warner did come to us, but we disbelieved and said: God did not reveal anything, you are being led astray.\"", "verse": 9, "surah": 67}, {"quran": "And they said: \"If we had listened or understood, we would not be among the dwellers of the blazing Fire!\"", "verse": 10, "surah": 67}, {"quran": "Thus, they confessed their sins. So away with the dwellers of the blazing Fire.", "verse": 11, "surah": 67}, {"quran": "As for those who are concerned towards their Lord while unseen, they have attained forgiveness and a great reward.", "verse": 12, "surah": 67}, {"quran": "And whether you keep your utterances secret, or declare them, He is fully aware of what is in the chests.", "verse": 13, "surah": 67}, {"quran": "Should He not know what He created? And He is the Sublime, the Expert.", "verse": 14, "surah": 67}, {"quran": "He is the One who made the earth subservient for you. So roam its paths, and eat from His provisions; and to Him is the final summoning.", "verse": 15, "surah": 67}, {"quran": "Are you secure that the One in the heaven will not cause the earth to swallow you when it shakes?", "verse": 16, "surah": 67}, {"quran": "Or are you secure that the One in the heaven will not send upon you a violent storm? Then you will know the value of the warning.", "verse": 17, "surah": 67}, {"quran": "And those before them have disbelieved; so how terrible was My requital!", "verse": 18, "surah": 67}, {"quran": "Have they not looked to the birds lined-up together above them, and they contract? It is the Almighty who holds them. He is Seer of all things.", "verse": 19, "surah": 67}, {"quran": "Where is this army of yours to grant you victory without the Almighty? Indeed, the disbelievers are deceived.", "verse": 20, "surah": 67}, {"quran": "Where is this who can give you provisions if He holds back His provisions? Indeed, they have plunged deep into transgression and aversion.", "verse": 21, "surah": 67}, {"quran": "Is one who walks while his face is slumped better guided, or one who walks straight on the right path?", "verse": 22, "surah": 67}, {"quran": "Say: \"He is the One who initiated you, and made for you the hearing, the eyes, and the hearts. Little do you give thanks.\"", "verse": 23, "surah": 67}, {"quran": "Say: \"He is the One who placed you on the earth, and to Him you will be gathered.\"", "verse": 24, "surah": 67}, {"quran": "And they say: \"When will this promise come to pass, if you are being truthful?\"", "verse": 25, "surah": 67}, {"quran": "Say: \"The knowledge is with God, and I am but a clear warner.\"", "verse": 26, "surah": 67}, {"quran": "So when they see it near, the faces of those who rejected will turn miserable, and it will be proclaimed: \"This is what you had called for!\"", "verse": 27, "surah": 67}, {"quran": "Say: \"Do you see? If God annihilates me and those with me, or He bestows mercy upon us, who is there to protect the rejecters from a painful retribution?\"", "verse": 28, "surah": 67}, {"quran": "Say: \"He is the Almighty; we believe in Him, and we put our trust in Him. You will come to find out who is clearly astray.\"", "verse": 29, "surah": 67}, {"quran": "Say: \"What if your water becomes deep underground, who then can provide you with pure water?\"", "verse": 30, "surah": 67}]]