[[{"quran": "In the name of God, the Almighty, the Merciful.", "verse": 0, "surah": 32}, {"quran": "ALM.", "verse": 1, "surah": 32}, {"quran": "The sending down of this Book, without a doubt, from the Lord of the worlds.", "verse": 2, "surah": 32}, {"quran": "Or do they say: \"He fabricated it!\" No, it is the truth from your Lord, so that you may warn a people who never received a warner before you, in order that they may be guided.", "verse": 3, "surah": 32}, {"quran": "God is the One who has created the heavens and the earth, and what is between them in six days, then He settled upon the Throne. You do not have besides Him any Lord, nor intercessor. Will you not then remember?", "verse": 4, "surah": 32}, {"quran": "He arranges matters from the heaven to the earth, then it ascends to Him in a day which is equivalent to one thousand of the years which you count.", "verse": 5, "surah": 32}, {"quran": "Such is the Knower of the unseen and the seen; the Noble, the Merciful.", "verse": 6, "surah": 32}, {"quran": "The One who perfected everything He created and He began the creation of the human being from clay.", "verse": 7, "surah": 32}, {"quran": "Then He made his offspring from a structure derived from a lowly liquid.", "verse": 8, "surah": 32}, {"quran": "Then He evolved him, and blew into him from His Spirit. And He made for you the hearing, the eyesight, and the hearts; rarely are you thankful.", "verse": 9, "surah": 32}, {"quran": "And they said: \"When we are buried in the ground, will we be created anew?\" Indeed, they reject the meeting of their Lord.", "verse": 10, "surah": 32}, {"quran": "Say: \"Your lives will be terminated by the angel of death that has been assigned to you, then to your Lord you will be returned.\"", "verse": 11, "surah": 32}, {"quran": "And if only you could see the criminals when they bow down their heads before their Lord: \"Our Lord, we have now seen and we have heard, so send us back and we will do good. We are believers!\"", "verse": 12, "surah": 32}, {"quran": "And if We had wished, We could have given every soul its guidance, but the word from Me has taken effect, that I will fill Hell with the Jinn and people all together.", "verse": 13, "surah": 32}, {"quran": "So taste the consequences of your forgetting this Day; for We have now forgotten you. And taste the eternal retribution in return for what you used to do.", "verse": 14, "surah": 32}, {"quran": "The only people who believe in Our revelations are those whom when they are reminded by them, they fall prostrating, and they glorify the praise of their Lord, and they are not arrogant.", "verse": 15, "surah": 32}, {"quran": "Their sides readily forsake their beds, to call on their Lord out of fear and hope, and from Our provisions to them they give.", "verse": 16, "surah": 32}, {"quran": "No person knows what is being hidden for them of joy, as a reward for what they used to do.", "verse": 17, "surah": 32}, {"quran": "Is one who is a believer the same as one who is wicked? They are not the same.", "verse": 18, "surah": 32}, {"quran": "As for those who believe and do good works, for them are eternal gardens as an abode for what they used to work.", "verse": 19, "surah": 32}, {"quran": "And as for those who were wicked, their abode is the Fire. Every time they try to leave it, they will be put back in it, and it will be said to them: \"Taste the retribution of the Fire which you used to deny.\"", "verse": 20, "surah": 32}, {"quran": "And We will let them taste the worldly retribution before the greater retribution, perhaps they will return.", "verse": 21, "surah": 32}, {"quran": "And who is more wicked than he who is reminded of the revelations of his Lord, then he turns away from them? We will exact a punishment from the criminals.", "verse": 22, "surah": 32}, {"quran": "And We have given Moses the Book; so do not be in any doubt about meeting Him; and We made it a guide for the Children of Israel.", "verse": 23, "surah": 32}, {"quran": "And We made from them leaders who guided in accordance with Our commandment, for they were patient and had certainty regarding Our revelations.", "verse": 24, "surah": 32}, {"quran": "Your Lord will separate between them on the Day of Resurrection regarding that which they disputed in.", "verse": 25, "surah": 32}, {"quran": "Is it not a guide for them how many generations We have annihilated before them in whose dwellings they walk? In that are signs. Do they not listen?", "verse": 26, "surah": 32}, {"quran": "Have they not seen that We drive the water to the barren lands, and produce with it crops to feed their livestock, and themselves? Do they not see?", "verse": 27, "surah": 32}, {"quran": "And they say: \"When is this victory, if you are being truthful?\"", "verse": 28, "surah": 32}, {"quran": "Say: \"On the day of the victory, it will not benefit those who rejected if they believe, nor will they be given respite.\"", "verse": 29, "surah": 32}, {"quran": "Therefore, turn away from them and wait, for they too are waiting.", "verse": 30, "surah": 32}]]