[[{"quran": "In the name of God, the Almighty, the Merciful.", "verse": 0, "surah": 19}, {"quran": "KH'YA'S'", "verse": 1, "surah": 19}, {"quran": "A reminder of the mercy of your Lord to His servant Zachariah.", "verse": 2, "surah": 19}, {"quran": "When he called out to his Lord secretly.", "verse": 3, "surah": 19}, {"quran": "He said: \"My Lord, my bones have gone frail, and my hair has turned white, and I have never been mischievous in imploring You my Lord.\"", "verse": 4, "surah": 19}, {"quran": "\"And I fear the kinfolk after I am gone, and my wife is infertile, so grant me from Yourself an ally.\"", "verse": 5, "surah": 19}, {"quran": "\"To inherit from me, and inherit from the descendants of Jacob. And make him my Lord, well pleasing.\"", "verse": 6, "surah": 19}, {"quran": "\"O Zachariah, We give you glad tidings of a son whose name is John. We have not given that name before to anyone.\"", "verse": 7, "surah": 19}, {"quran": "He said: \"My Lord, how can I have a son when my wife is infertile, and I have reached a very old age?\"", "verse": 8, "surah": 19}, {"quran": "He said: \"It is such that your Lord has said. It is an easy thing for Me. And I had created you before, when you were not a thing.\"", "verse": 9, "surah": 19}, {"quran": "He said: \"My Lord, make for me a sign.\" He said: \"Your sign is that you will not speak to the people for three nights consecutively.\"", "verse": 10, "surah": 19}, {"quran": "So he went out among his people from the temple enclosure, and he indicated to them that they should glorify Him at dawn and dusk.", "verse": 11, "surah": 19}, {"quran": "\"O John, take the Book with confidence.\" And We gave him authority while in his youth.", "verse": 12, "surah": 19}, {"quran": "And tenderness from Us, and purity, and he was ever righteous.", "verse": 13, "surah": 19}, {"quran": "And dutiful to his parents, and never was he a disobedient tyrant.", "verse": 14, "surah": 19}, {"quran": "And peace be upon him the day he was born, and the day he dies, and the Day he is resurrected alive.", "verse": 15, "surah": 19}, {"quran": "And relate in the Book, Mary, when she withdrew herself from her family to a place which was to the east.", "verse": 16, "surah": 19}, {"quran": "So she took a barrier to separate her from them, so We sent Our Spirit to her, and he took on the shape of a mortal in all similarity.", "verse": 17, "surah": 19}, {"quran": "She said: \"I seek refuge with the Almighty from you if you are righteous.\"", "verse": 18, "surah": 19}, {"quran": "He said: \"I am the messenger of your Lord, to grant you the gift of a pure son.\"", "verse": 19, "surah": 19}, {"quran": "She said: \"How can I have a son when no mortal has been with me, nor have I desired such?\"", "verse": 20, "surah": 19}, {"quran": "He said: \"It is such that your Lord has said, it is easy for Me. And We shall make him a sign for the people and a mercy from Us. It is a matter already ordained.\"", "verse": 21, "surah": 19}, {"quran": "So she was pregnant with him, and she went to deliver in a far place.", "verse": 22, "surah": 19}, {"quran": "Then the birth pains came to her, by the trunk of a palm tree. She said: \"I wish I had died before this, and became totally forgotten!\"", "verse": 23, "surah": 19}, {"quran": "But then he called to her from beneath her: \"Do not be sad, your Lord has made below you a stream.\"", "verse": 24, "surah": 19}, {"quran": "\"And using the trunk of the palm tree, shake towards you; it will cause ripe dates to fall upon you.\"", "verse": 25, "surah": 19}, {"quran": "\"So eat and drink and be content. If you see any mortal, then say: 'I have vowed an abstinence for the Almighty, so I will not talk today to any of mankind.'\"", "verse": 26, "surah": 19}, {"quran": "Then she came to her people carrying him. They said: \"O Mary, you have come with a thing totally unexpected!\"", "verse": 27, "surah": 19}, {"quran": "\"O sister of Aaron, your father was not a wicked man, and your mother has never been unchaste!\"", "verse": 28, "surah": 19}, {"quran": "So she pointed to him. They said: \"How can we talk to someone who is a child in a cradle?\"", "verse": 29, "surah": 19}, {"quran": "He said: \"I am a servant of God, He has given me the Book and made me a prophet.\"", "verse": 30, "surah": 19}, {"quran": "\"And He has made me blessed wherever I am, and He has charged me with the contact prayer and purification as long as I am alive.\"", "verse": 31, "surah": 19}, {"quran": "\"And to be dutiful to my mother, and He has not made me a mischievous tyrant.\"", "verse": 32, "surah": 19}, {"quran": "\"And peace be upon me the day I was born, and the day I die, and the Day I am resurrected alive.\"", "verse": 33, "surah": 19}, {"quran": "Such was Jesus, son of Mary, and this is the truth of the matter in which they doubt.", "verse": 34, "surah": 19}, {"quran": "God was never to take a son, be He glorified. If He decrees a matter, then He simply says to it: 'Be,' and it is.", "verse": 35, "surah": 19}, {"quran": "And God is my Lord and your Lord, so serve Him. This is a straight path.", "verse": 36, "surah": 19}, {"quran": "Thus the Confederates disputed between them. Therefore, woe to those who have rejected from the scene of a terrible Day.", "verse": 37, "surah": 19}, {"quran": "Listen to what they say and watch on the Day they come to Us. But the wicked today are in a clear misguidance.", "verse": 38, "surah": 19}, {"quran": "And warn them of the Day of Remorse. When the matter is decided while they are oblivious, and they do not believe.", "verse": 39, "surah": 19}, {"quran": "It is We who will inherit the earth and all that is on it. And to Us they will return.", "verse": 40, "surah": 19}, {"quran": "And recall in the Book, Abraham; he was a man of truth, a prophet.", "verse": 41, "surah": 19}, {"quran": "When he said to his father: \"O father, why do you serve what does not hear or see, nor help you in anything?\"", "verse": 42, "surah": 19}, {"quran": "\"My father, knowledge has come to me which did not come to you. So follow me that I will guide you to a level path.\"", "verse": 43, "surah": 19}, {"quran": "\"My father, do not serve the devil. For the devil was ever disobedient to the Almighty.\"", "verse": 44, "surah": 19}, {"quran": "\"My father, I fear that a retribution will inflict you from the Almighty and that you will become an ally to the devil.\"", "verse": 45, "surah": 19}, {"quran": "He said: \"Have you abandoned my gods O Abraham? If you do not stop this, I will stone you; and let me be.\"", "verse": 46, "surah": 19}, {"quran": "He said: \"Peace be upon you, I will ask forgiveness for you from my Lord. He has been most kind to me.\"", "verse": 47, "surah": 19}, {"quran": "\"And I will abandon you and what you call on besides God. And I will implore my Lord, hoping that I will not be mischievous in imploring my Lord.\"", "verse": 48, "surah": 19}, {"quran": "So when he abandoned them and what they served besides God, We granted him Isaac and Jacob, and each of them We made a prophet.", "verse": 49, "surah": 19}, {"quran": "And We granted them from Our mercy, and We made for them a tongue of truthfulness to be heard.", "verse": 50, "surah": 19}, {"quran": "And recall in the Book, Moses; he was loyal, and he was a messenger prophet.", "verse": 51, "surah": 19}, {"quran": "And We called him from the right side of the mount, and We brought him close to talk with.", "verse": 52, "surah": 19}, {"quran": "And We granted him from Our mercy his brother Aaron as a prophet.", "verse": 53, "surah": 19}, {"quran": "And recall in the Book, Ishmael; he was truthful to his promise, and he was a messenger prophet.", "verse": 54, "surah": 19}, {"quran": "And he used to instruct his family to the contact prayer and purification, and his Lord was pleased with him.", "verse": 55, "surah": 19}, {"quran": "And recall in the Book, Enoch; he was a man of truth, a prophet.", "verse": 56, "surah": 19}, {"quran": "And We raised him to a high place.", "verse": 57, "surah": 19}, {"quran": "Those are the ones whom God has blessed from among the prophets from the progeny of Adam, and those We carried with Noah, and from the progeny of Abraham and Israel, and from whom We have guided and chosen. When the revelations of the Almighty are recited to them, they fall down prostrating, and in tears.", "verse": 58, "surah": 19}, {"quran": "Then, generations came after them who lost the contact prayer, and followed desires. They will find their consequences.", "verse": 59, "surah": 19}, {"quran": "Except for whoever repents and believes and does good works; they will be admitted to Paradise, and they will not be wronged in the least.", "verse": 60, "surah": 19}, {"quran": "Gardens of delight; that the Almighty had promised His servants in the unseen. His promise must come to pass.", "verse": 61, "surah": 19}, {"quran": "They will not hear in it any nonsense, only peace. And they will have their provision in it morning and evening.", "verse": 62, "surah": 19}, {"quran": "Such is Paradise that We inherit to any of Our servants who are righteous.", "verse": 63, "surah": 19}, {"quran": "\"And we are not sent except by the authority of your Lord. To Him are our present and our future, and all that is in-between. And your Lord was never to forget.\"", "verse": 64, "surah": 19}, {"quran": "\"The Lord of the heavens and the earth and what is between them. So serve Him and be patient in His service. Do you know anything that is like Him?\"", "verse": 65, "surah": 19}, {"quran": "And the human being says: \"Can it be that when I am dead, I will be brought out alive?\"", "verse": 66, "surah": 19}, {"quran": "Does the human being not remember that We created him before, when he was not a thing?", "verse": 67, "surah": 19}, {"quran": "By your Lord, We will gather them and the devils, then We will place them around Hell on their knees.", "verse": 68, "surah": 19}, {"quran": "Then We will drag out from every clan the ones which were most in opposition to the Almighty.", "verse": 69, "surah": 19}, {"quran": "Then, it is We who are best aware of those who deserve to be burnt therein.", "verse": 70, "surah": 19}, {"quran": "And every single one of you will encounter it. This for your Lord is a certainty that will come to pass.", "verse": 71, "surah": 19}, {"quran": "Then We will save those who were righteous, and We will leave the wicked in it on their knees.", "verse": 72, "surah": 19}, {"quran": "And when Our clear revelations were recited to them, those who rejected said to those who believed: \"Which of our two groups is in a better station and more prosperous?\"", "verse": 73, "surah": 19}, {"quran": "And how many a generation have We destroyed before them? They had more wealth and more influence.", "verse": 74, "surah": 19}, {"quran": "Say: \"Whoever is in misguidance, then the Almighty will lead them on.\" Until they see what they have been promised, either the retribution or the Hour. Then they will know who is in a worse place and weaker in power.", "verse": 75, "surah": 19}, {"quran": "And God increases the guidance of those who are guided. And the goodness that endures is better with your Lord as a reward and a far better return.", "verse": 76, "surah": 19}, {"quran": "Did you see the one who rejected Our revelations and said: \"I will be given wealth and children.\"", "verse": 77, "surah": 19}, {"quran": "Did he look into the future? Or has he taken a pledge with the Almighty?", "verse": 78, "surah": 19}, {"quran": "No, We will record what he says, and We will increase for him the retribution significantly.", "verse": 79, "surah": 19}, {"quran": "Then We inherit from him all that he said, and he shall come to Us all alone.", "verse": 80, "surah": 19}, {"quran": "And they have taken gods besides God to be for them their glory.", "verse": 81, "surah": 19}, {"quran": "On the contrary, they will reject their service of them and they will be standing against them.", "verse": 82, "surah": 19}, {"quran": "Did you not note that We send the devils upon the rejecters to push them with incitement?", "verse": 83, "surah": 19}, {"quran": "So do not be in haste towards them; We are preparing for them a preparation.", "verse": 84, "surah": 19}, {"quran": "The Day We gather the righteous to the Almighty as a delegation.", "verse": 85, "surah": 19}, {"quran": "And We drive the criminals to Hell as a herd.", "verse": 86, "surah": 19}, {"quran": "None will possess intercession, except for he who has taken a pledge with the Almighty.", "verse": 87, "surah": 19}, {"quran": "And they said the Almighty has taken a son!", "verse": 88, "surah": 19}, {"quran": "You have come with a gross blasphemy.", "verse": 89, "surah": 19}, {"quran": "The heavens are about to shatter from it, and the earth crack open, and the mountains fall and crumble.", "verse": 90, "surah": 19}, {"quran": "That they claimed that the Almighty had a son!", "verse": 91, "surah": 19}, {"quran": "And what need does the Almighty have to take a son?", "verse": 92, "surah": 19}, {"quran": "When all there is in the heavens and the earth will come to the Almighty as servants.", "verse": 93, "surah": 19}, {"quran": "He has encompassed them, and counted them one by one.", "verse": 94, "surah": 19}, {"quran": "And all of them will come to Him on the Day of Resurrection, all alone.", "verse": 95, "surah": 19}, {"quran": "Those who believe and do good works, the Almighty will make for them affection.", "verse": 96, "surah": 19}, {"quran": "Thus We have made this easy in your tongue so that you may give good news with it to the righteous and that you may warn with it the quarrelsome people.", "verse": 97, "surah": 19}, {"quran": "And how many a generation have We destroyed before them? Do you perceive any of them or hear from them a sound?", "verse": 98, "surah": 19}]]