[[{"quran": "In the name of God, the Almighty, the Merciful.", "verse": 0, "surah": 20}, {"quran": "T'H'", "verse": 1, "surah": 20}, {"quran": "We did not send down to you the Qur'an so you may suffer.", "verse": 2, "surah": 20}, {"quran": "It is but a reminder for he who is concerned.", "verse": 3, "surah": 20}, {"quran": "Sent down from the One who has created the earth and the heavens above.", "verse": 4, "surah": 20}, {"quran": "The Almighty, upon the Throne He settled.", "verse": 5, "surah": 20}, {"quran": "To Him is what is in the heavens and what is on the earth, and what is between them, and what is beneath the ground.", "verse": 6, "surah": 20}, {"quran": "And if you will declare openly what you say, then surely He knows the secret and what is hidden.", "verse": 7, "surah": 20}, {"quran": "God, there is no god except He, to Him are the beautiful names.", "verse": 8, "surah": 20}, {"quran": "And did the narrative of Moses come to you?", "verse": 9, "surah": 20}, {"quran": "When he saw a fire, he said to his family: \"Stay here, I have seen a fire, perhaps I can bring a piece from it, or find at the fire some guidance.\"", "verse": 10, "surah": 20}, {"quran": "So when he came to it he was called: \"O Moses.\"", "verse": 11, "surah": 20}, {"quran": "\"I am your Lord, so take off your slippers; you are in the holy valley Tuwa.\"", "verse": 12, "surah": 20}, {"quran": "\"And I have chosen you, so listen to what is being inspired.\"", "verse": 13, "surah": 20}, {"quran": "\"I am God, there is no god except Me, so serve Me and hold the contact prayer for My remembrance.\"", "verse": 14, "surah": 20}, {"quran": "\"The Hour is coming, I am almost keeping it hidden, so that every soul will be recompensed with what it struggled.\"", "verse": 15, "surah": 20}, {"quran": "\"So do not be deterred from it by he who does not believe in it and followed his desire and perished.\"", "verse": 16, "surah": 20}, {"quran": "\"And what is in your right hand O Moses?\"", "verse": 17, "surah": 20}, {"quran": "He said: \"It is my staff, I lean on it, and I guide my sheep with it, and I have other uses in it.\"", "verse": 18, "surah": 20}, {"quran": "He said: \"Cast it down O Moses.\"", "verse": 19, "surah": 20}, {"quran": "So he cast it down, and it became a moving serpent!", "verse": 20, "surah": 20}, {"quran": "He said: \"Take it and do not be fearful, We will turn it back to its previous form.\"", "verse": 21, "surah": 20}, {"quran": "\"And place your hand under your arm, it will come out white without blemish, as another sign.\"", "verse": 22, "surah": 20}, {"quran": "\"This is to show you Our great signs.\"", "verse": 23, "surah": 20}, {"quran": "\"Go to Pharaoh, for he has transgressed.\"", "verse": 24, "surah": 20}, {"quran": "He said: \"My Lord, comfort for me my chest.\"", "verse": 25, "surah": 20}, {"quran": "\"And make my mission easy.\"", "verse": 26, "surah": 20}, {"quran": "\"And remove the knot in my tongue.\"", "verse": 27, "surah": 20}, {"quran": "\"So they can understand what I say.\"", "verse": 28, "surah": 20}, {"quran": "\"And allow for me an advisor from my family.\"", "verse": 29, "surah": 20}, {"quran": "\"Aaron, my brother.\"", "verse": 30, "surah": 20}, {"quran": "\"So that I may strengthen my resolve through him.\"", "verse": 31, "surah": 20}, {"quran": "\"And share with him my mission.\"", "verse": 32, "surah": 20}, {"quran": "\"So that we may glorify You plenty.\"", "verse": 33, "surah": 20}, {"quran": "\"And remember You plenty.\"", "verse": 34, "surah": 20}, {"quran": "\"You Have been seer over us.\"", "verse": 35, "surah": 20}, {"quran": "He said: \"You have been given what you asked O Moses.\"", "verse": 36, "surah": 20}, {"quran": "\"And We have graced you another time.\"", "verse": 37, "surah": 20}, {"quran": "\"When We inspired to your mother what was inspired.\"", "verse": 38, "surah": 20}, {"quran": "\"That she should cast him in the basket, and cast the basket in the sea, so the sea will place him on the shore, where an enemy of Mine and his will take him. And I placed upon you a love from Me. And that you shall be raised under My eye.\"", "verse": 39, "surah": 20}, {"quran": "\"That your sister should follow, and say: 'Shall I guide you to a person who will nurse him.' Thus We returned you to your mother, so that she may be pleased and not be sad. And you killed a person, but We saved you from harm and We tested you greatly. So it was that you stayed with the people of Midyan for many years, then you came here by fate O Moses.\"", "verse": 40, "surah": 20}, {"quran": "\"And I Have raised you for Myself.\"", "verse": 41, "surah": 20}, {"quran": "\"Go, you and your brother with Our signs, and do not linger from My remembrance.\"", "verse": 42, "surah": 20}, {"quran": "\"Go, both of you, to Pharaoh, for he has transgressed.\"", "verse": 43, "surah": 20}, {"quran": "\"So say to him soft words, perhaps he will remember or be concerned.\"", "verse": 44, "surah": 20}, {"quran": "They said: \"Our Lord, we fear that he would let loose upon us, or transgress.\"", "verse": 45, "surah": 20}, {"quran": "He said: \"Do not fear, I am with you, I hear and I see.\"", "verse": 46, "surah": 20}, {"quran": "So come to him and say: \"We are messengers from your Lord, so send with us the Children of Israel, and do not punish them. We have come to you with a sign from your Lord, and peace be upon those who follow the guidance.\"", "verse": 47, "surah": 20}, {"quran": "\"It has been inspired to us that the retribution will be upon he who denies and turns away.\"", "verse": 48, "surah": 20}, {"quran": "He said: \"So who is the lord of you both O Moses?\"", "verse": 49, "surah": 20}, {"quran": "He said: \"Our Lord is the One who gave everything its creation, then guided.\"", "verse": 50, "surah": 20}, {"quran": "He said: \"What then has happened to the previous generations?\"", "verse": 51, "surah": 20}, {"quran": "He said: \"The knowledge of it is with my Lord, in a record. My Lord does not err or forget.\"", "verse": 52, "surah": 20}, {"quran": "The One who made for you the earth habitable and He made ways for you in it, and He brought down water from the sky, so We brought out with it pairs of vegetation of all types.", "verse": 53, "surah": 20}, {"quran": "Eat and raise your livestock, in that are signs for those of thought.", "verse": 54, "surah": 20}, {"quran": "From it We created you and in it We return you, and from it We bring you out another time.", "verse": 55, "surah": 20}, {"quran": "And We showed him Our signs, all of them, but he denied and refused.", "verse": 56, "surah": 20}, {"quran": "He said: \"Have you come to us to take us out of our land with your magic O Moses?\"", "verse": 57, "surah": 20}, {"quran": "\"We will bring you a magic like it, so let us make an appointment between us and you which neither of us will break, a place where we both agree.\"", "verse": 58, "surah": 20}, {"quran": "He said: \"Your appointment is the day of festival, and when the people start crowding during the late morning.\"", "verse": 59, "surah": 20}, {"quran": "So Pharaoh went away, and he gathered his plan then he came.", "verse": 60, "surah": 20}, {"quran": "Moses said to them: \"Woe to you, do not invent lies about God, else the retribution will take you, and miserable is the one who invents.\"", "verse": 61, "surah": 20}, {"quran": "So they disputed in their matter between themselves, and they kept private their counsel.", "verse": 62, "surah": 20}, {"quran": "They said: \"These are but two magicians who want to take you out of your land with their magic, and they want to do away with your ideal way.\"", "verse": 63, "surah": 20}, {"quran": "\"So agree your plan, then come as one front. Whoever wins today will succeed.\"", "verse": 64, "surah": 20}, {"quran": "They said: \"O Moses, either you cast down or we will be the first to cast down.\"", "verse": 65, "surah": 20}, {"quran": "He said: \"You cast down.\" So their ropes and staffs appeared from their magic as if they were moving.", "verse": 66, "surah": 20}, {"quran": "And Moses held some fear in himself.", "verse": 67, "surah": 20}, {"quran": "We said: \"Do not fear, you will best them.\"", "verse": 68, "surah": 20}, {"quran": "\"And cast down what is in your right hand it will consume what they have made. They have only made the plans of a magician, and the magician will not succeed no matter what he does.\"", "verse": 69, "surah": 20}, {"quran": "So the magicians went down in prostration. They said: \"We believe in the Lord of Aaron and Moses.\"", "verse": 70, "surah": 20}, {"quran": "He said: \"Have you believed to him before taking my permission? He is surely your great one who has taught you magic. So, I will cut off your hands and feet from alternate sides, and I will crucify you on the trunks of the palm trees, and you will come to know which of us is greater in retribution and more lasting!\"", "verse": 71, "surah": 20}, {"quran": "They said: \"We will not prefer you over the proofs that have come to us, and over the One who initiated us. So issue whatever judgment you have, for you only issue judgment in this worldly life.\"", "verse": 72, "surah": 20}, {"quran": "\"We have believed in our Lord that He may forgive us our wrongdoings, and what you had forced us into doing of magic; and God is better and more lasting.\"", "verse": 73, "surah": 20}, {"quran": "He who comes to his Lord as a criminal, he will have Hell, where he will neither die in it nor live.", "verse": 74, "surah": 20}, {"quran": "And he who comes to Him as a believer doing good works, for those will be the highest ranks.", "verse": 75, "surah": 20}, {"quran": "Gardens of delight, with rivers flowing beneath them, abiding therein. Such is the reward of he who is developed.", "verse": 76, "surah": 20}, {"quran": "And We inspired to Moses: \"Take My servants out, and strike for them a path through the sea that is dry. You shall not fear being overtaken, nor be concerned.\"", "verse": 77, "surah": 20}, {"quran": "So Pharaoh followed them with his soldiers, but the sea cameover them and covered them.", "verse": 78, "surah": 20}, {"quran": "Thus, Pharaoh misled his people and he did not guide.", "verse": 79, "surah": 20}, {"quran": "O Children of Israel, We have saved you from your enemy, and We summoned you at the right side of the mount, and We sent down to you manna and quail.", "verse": 80, "surah": 20}, {"quran": "Eat from the good things that We have provided for you and do not transgress in this else My wrath will be upon you. Whoever has incurred My wrath is lost.", "verse": 81, "surah": 20}, {"quran": "And I am forgiving for whoever repents and does good works, then is guided.", "verse": 82, "surah": 20}, {"quran": "\"And what has caused you to rush ahead of your people O Moses?\"", "verse": 83, "surah": 20}, {"quran": "He said: \"They are coming in my tracks, and I came quickly to you my Lord so you would be pleased.\"", "verse": 84, "surah": 20}, {"quran": "He said: \"We have tested your people after you left, and the Sumerian misguided them.\"", "verse": 85, "surah": 20}, {"quran": "So Moses returned to his people angry and disappointed. He said: \"My people, did not your Lord promise you a good promise? Has the waiting for the pledge been too long, or did you want that the wrath of your Lord be upon you? Thus you broke the promise with me.\"", "verse": 86, "surah": 20}, {"quran": "They said: \"We did not break the promise by our own will, but we were loaded down with the jewelry of the people so we cast them down, and it was such that the Sumerian suggested.\"", "verse": 87, "surah": 20}, {"quran": "He then produced for them a sculpture of a calf that emitted a cry. So they said: \"This is your god and the god of Moses, but he had forgotten!\"", "verse": 88, "surah": 20}, {"quran": "Did they not see that it did not respond to them? Nor did it possess for them any harm or benefit?", "verse": 89, "surah": 20}, {"quran": "And Aaron said to them before: \"My people, you are being tested with it. Your Lord is the Almighty, so follow me and obey my command!\"", "verse": 90, "surah": 20}, {"quran": "They said: \"We will remain devoted to it until Moses comes back to us.\"", "verse": 91, "surah": 20}, {"quran": "He said: \"O Aaron, what prevented you when you saw them being astray?\"", "verse": 92, "surah": 20}, {"quran": "\"Do you not follow me? Have you disobeyed my command?\"", "verse": 93, "surah": 20}, {"quran": "He said: \"O son of my mother, do not grab me by my beard nor by my head. I was concerned that you would say that I separated between the Children of Israel, and that I did not follow your orders.\"", "verse": 94, "surah": 20}, {"quran": "He said: \"So what do you have to say O Sumerian?\"", "verse": 95, "surah": 20}, {"quran": "He said: \"I noticed what they did not notice, so I took a handful from where the messenger was standing, and I cast it in. This is what my soul inspired me to do.\"", "verse": 96, "surah": 20}, {"quran": "He said: \"Then be gone, for you will have it in this life to say: \"I am not to be touched\" And you will have an appointed time which you will not forsake. And look to your god that you remained devoted to, we will burn him, then we will destroy him in the sea completely.\"", "verse": 97, "surah": 20}, {"quran": "Surely your god is God; for which there is no god except He. His knowledge encompasses all things.", "verse": 98, "surah": 20}, {"quran": "And it is such that We tell to you the news of what  has passed. And We have given you from Us a remembrance.", "verse": 99, "surah": 20}, {"quran": "Whoever turns away from it, then he will carry a load on the Day of Resurrection.", "verse": 100, "surah": 20}, {"quran": "They will remain therein; and miserable for them on the Day of Resurrection is what they carry.", "verse": 101, "surah": 20}, {"quran": "The Day the horn is blown, and We gather the criminals on that Day white eyed.", "verse": 102, "surah": 20}, {"quran": "They whisper among themselves: \"You have only been away for a period of ten.\"", "verse": 103, "surah": 20}, {"quran": "We are fully aware of what they say, for the best among them will say: \"No, you have only been away for a day.\"", "verse": 104, "surah": 20}, {"quran": "And they ask you about the mountains, so say: \"My Lord will annihilate them completely.\"", "verse": 105, "surah": 20}, {"quran": "\"Then He will leave it as a smooth plain.\"", "verse": 106, "surah": 20}, {"quran": "\"You will not see in it any crookedness or curves.\"", "verse": 107, "surah": 20}, {"quran": "On that Day, they will follow the caller, there is no crookedness to him. And all voices will be humbled for the Almighty, you will not be able to hear except whispers.", "verse": 108, "surah": 20}, {"quran": "On that Day, no intercession will be of help, except for he whom the Almighty allows and accepts what he has to say.", "verse": 109, "surah": 20}, {"quran": "He knows their present and their future, and they do not have any of His knowledge.", "verse": 110, "surah": 20}, {"quran": "And the faces shall be humbled for the Living, the Eternal. And whoever carried wickedness with him has failed.", "verse": 111, "surah": 20}, {"quran": "And whoever does any good works, while he is a believer, then he should not fear injustice nor being given less than his due.", "verse": 112, "surah": 20}, {"quran": "And it was such that We sent it down an Arabic revelation, and We dispatched in it the warnings, perhaps they will become aware or it will cause them to remember.", "verse": 113, "surah": 20}, {"quran": "hen High above all is God, the King, the True. And do not be hasty with the Qur'an before its inspiration is completed to you, and say: \"My Lord, increase my knowledge.\"", "verse": 114, "surah": 20}, {"quran": "And We had entrusted to Adam from before, but he  forgot, and We did not find in him the will power.", "verse": 115, "surah": 20}, {"quran": "And We said to the angels: \"Yield to Adam.\" They all yielded except for Satan, he refused.", "verse": 116, "surah": 20}, {"quran": "So We said: \"O Adam, this is an enemy to you and your mate. So do not let him take you out from the paradise, else you will have hardship.\"", "verse": 117, "surah": 20}, {"quran": "\"You will have in it that you will not go hungry nor need clothes.\"", "verse": 118, "surah": 20}, {"quran": "\"And you will have in it that you will not go thirsty nor suffer from heat.\"", "verse": 119, "surah": 20}, {"quran": "But the devil whispered to him, he said: \"O Adam, shall I lead you to the tree of immortality and a kingdom which will not waste away?\"", "verse": 120, "surah": 20}, {"quran": "So they both ate from it, and their bodies became apparent to them, and they began to place leaves on themselves from the paradise. Adam had disobeyed his Lord, and had gone astray.", "verse": 121, "surah": 20}, {"quran": "Then his Lord recalled him, and He forgave him, and gave guidance to him.", "verse": 122, "surah": 20}, {"quran": "He said: \"Descend from this, all of you, for you are enemies to one another. So, when My guidance comes to you, then, whoever follows My guidance, he will not go astray nor suffer.\"", "verse": 123, "surah": 20}, {"quran": "\"And whoever turns away from My remembrance, then he will have a miserable life, and We will raise him blind on the Day of Resurrection.\"", "verse": 124, "surah": 20}, {"quran": "He said: \"My Lord, you have raised me blind while I used to be able to see?\"", "verse": 125, "surah": 20}, {"quran": "He said: \"It was the same when Our revelations came to you, you forgot them, and similarly today you will be forgotten.\"", "verse": 126, "surah": 20}, {"quran": "And it is such that We recompense he who transgresses, and did not believe in the revelations of his Lord. And the retribution of the Hereafter is more severe and more lasting.", "verse": 127, "surah": 20}, {"quran": "Is it not a guide to them how many generations We had destroyed before them, which they are walking now in their homes? In that are signs for the people of understanding.", "verse": 128, "surah": 20}, {"quran": "And had it not been for a word already given by your Lord, they would have been held to account immediately.", "verse": 129, "surah": 20}, {"quran": "So be patient to what they are saying and glorify the grace of your Lord before the rising of the sun, and before its setting. And at the approach of the night-you shall glorify-and at parts of the day, perhaps you may be content.", "verse": 130, "surah": 20}, {"quran": "And do not crave with your eyes what We have bestowed upon some couples from them; the flower of the worldly life; so as to test them in it; and the provision of your Lord is better and more lasting.", "verse": 131, "surah": 20}, {"quran": "And instruct your family to the contact prayer, and be patient for it. We do not ask you for provision, for We provide for you. And the ending will be for righteousness.", "verse": 132, "surah": 20}, {"quran": "And they said: \"If only he would bring us a sign from his Lord!\" Did not proof come to them from what is in the previous scripts?", "verse": 133, "surah": 20}, {"quran": "And if We had destroyed them with a retribution before this, they would have said: \"Our Lord, if only You had sent us a messenger so we could follow Your revelations before we are humiliated and shamed!\"", "verse": 134, "surah": 20}, {"quran": "Say: \"All are waiting, so wait, and you will come to know who are the people upon the even path and who are guided.\"", "verse": 135, "surah": 20}]]