[[{"quran": "In the name of God, the Almighty, the Merciful.", "verse": 0, "surah": 25}, {"quran": "Blessed is the One who sent down the Criterion to His servant, so it can be a warner to the world.", "verse": 1, "surah": 25}, {"quran": "The One to whom belongs the sovereignty of the heavens and the earth, and He did not take a son, and He does not have any partner in kingship. And He created everything and measured it precisely.", "verse": 2, "surah": 25}, {"quran": "And they took besides Him gods that do not create anything and are themselves created! And they do not possess for themselves any harm or benefit, nor do they possess death or life, nor resurrection.", "verse": 3, "surah": 25}, {"quran": "And those who rejected said: \"This is but a falsehood that he invented and other people have helped him with it.\" Certainly, they have come with what is unjust and fabricated.", "verse": 4, "surah": 25}, {"quran": "And they said: \"Fictional tales of old! He wrote them down while they were being dictated to him morning and evening.\"", "verse": 5, "surah": 25}, {"quran": "Say: \"It was sent down by the One who knows the secrets in the heavens and the earth. He is always Forgiving, Merciful.\"", "verse": 6, "surah": 25}, {"quran": "And they said: \"What is with this messenger that he eats the food and walks in the market places? If only an angel were sent down to him so that he would jointly be a warner.\"", "verse": 7, "surah": 25}, {"quran": "\"Or that a treasure is given to him, or that he has a paradise that he eats from.\" And the wicked said: \"You are but following a man bewitched!\"", "verse": 8, "surah": 25}, {"quran": "See how they put forth the examples for you; they have strayed, and they cannot find a path.", "verse": 9, "surah": 25}, {"quran": "Blessed is the One who if He wishes can make for you better than that. Gardens with rivers flowing beneath them, and He will make for you palaces.", "verse": 10, "surah": 25}, {"quran": "But they have denied the Hour, and We have prepared for those who deny the Hour a flaming Fire.", "verse": 11, "surah": 25}, {"quran": "When it sees them from a far place, they hear it raging and roaring.", "verse": 12, "surah": 25}, {"quran": "And when they are cast into it from a tight crevice, in chains, they call out their remorse.", "verse": 13, "surah": 25}, {"quran": "Do not call out one remorse today, but call out many a remorse.", "verse": 14, "surah": 25}, {"quran": "Say: \"Is that better or the garden of eternity that the righteous have been promised?\" It is their reward and destiny.", "verse": 15, "surah": 25}, {"quran": "In it they will have what they wish eternally. It is upon your Lord an obligated promise.", "verse": 16, "surah": 25}, {"quran": "And on the Day when We gather them together with what they served besides God; then He will say: \"Did you misguide My servants here, or did they stray from the path?\"", "verse": 17, "surah": 25}, {"quran": "They said: \"Glory be to You, it was not for us to take besides You any allies; indeed You gave them and their fathers luxury until they forgot the remembrance, and they were a lost people.\"", "verse": 18, "surah": 25}, {"quran": "They have refuted what you claimed, so you will not find any excuse nor any victor. And whoever has done wrong among you, We will let him taste a great retribution.", "verse": 19, "surah": 25}, {"quran": "And We have not sent before you any messengers except that they ate the food and walked in the market places. And We have made some of you as a test for others to see if you will have patience. And your Lord was ever seeing.", "verse": 20, "surah": 25}, {"quran": "And those who do not expect to meet Us said: \"If only the angels were sent down upon us, or that we see our Lord.\" They have become arrogant in their souls, and they have produced a great blasphemy!", "verse": 21, "surah": 25}, {"quran": "On the Day they see the angels, that is not good news for the criminals. And they will be saying: \"An inviolable enclosure!\"", "verse": 22, "surah": 25}, {"quran": "And We turned to the works that they did, and We made it dust in the wind.", "verse": 23, "surah": 25}, {"quran": "The dwellers of Paradise on that Day are in the best abode and the best destiny.", "verse": 24, "surah": 25}, {"quran": "And the Day when the heaven will be filled with clouds, and the angels will be sent down in succession.", "verse": 25, "surah": 25}, {"quran": "The true kingship on that Day will be to the Almighty. And it is a Day which will be very hard on the rejecters.", "verse": 26, "surah": 25}, {"quran": "And that Day the wrongdoer will bite on his hand and say: \"I wish I had taken the path with the messenger!\"", "verse": 27, "surah": 25}, {"quran": "\"Woe to me, I wish I did not take so and so as a friend!\"", "verse": 28, "surah": 25}, {"quran": "\"He has misguided me from the remembrance after it came to me, and the devil was always a betrayer of mankind!\"", "verse": 29, "surah": 25}, {"quran": "And the messenger said: \"My Lord, my people have deserted this Qur'an.\"", "verse": 30, "surah": 25}, {"quran": "And it is so that We make for every prophet enemies from among the criminals. And your Lord suffices as a Guide and a Victor.", "verse": 31, "surah": 25}, {"quran": "And those who rejected said: \"If only the Qur'an was sent down to him in one go!\" It was done as such so We could strengthen your heart with it, and We arranged it accordingly.", "verse": 32, "surah": 25}, {"quran": "And for every example they come to you with, We bring you the truth and the best explanation.", "verse": 33, "surah": 25}, {"quran": "Those who will be gathered to Hell on their faces, these are the most evil and the most strayed from the path.", "verse": 34, "surah": 25}, {"quran": "And We gave Moses the Book and We made his brother Aaron a minister with him.", "verse": 35, "surah": 25}, {"quran": "So We said: \"Go both of you to the people who have denied Our signs.\" So We then destroyed them utterly.", "verse": 36, "surah": 25}, {"quran": "And the people of Noah, when they denied the messengers We drowned them, and We made them a lesson for the people. And We have prepared for the wicked a painful retribution.", "verse": 37, "surah": 25}, {"quran": "And 'Aad and Thamud and the dwellers of Arras, and many generations in between.", "verse": 38, "surah": 25}, {"quran": "And for each one We put forth the examples, and each one We destroyed utterly.", "verse": 39, "surah": 25}, {"quran": "And they have come upon the town that was showered with a miserable shower. Did they not see it? No, they do not expect any resurrection.", "verse": 40, "surah": 25}, {"quran": "And if they see you they take you for a mockery: \"Is this the one that God sent as a messenger?\"", "verse": 41, "surah": 25}, {"quran": "\"He nearly diverted us from our gods had we not been patient for them.\" They will learn when they see the retribution who is on a path most astray.", "verse": 42, "surah": 25}, {"quran": "Have you seen the one who has taken his desire as his god? Will you be a caretaker over him?", "verse": 43, "surah": 25}, {"quran": "Or do you think that most of them hear or comprehend? They are just like livestock. No, they are worse off.", "verse": 44, "surah": 25}, {"quran": "Did you not see to your Lord how He casts the shadow? And if He wished, He could have made it still, then We would have made the sun as a guide to it.", "verse": 45, "surah": 25}, {"quran": "Then We retract it to us a simple retraction.", "verse": 46, "surah": 25}, {"quran": "And He is the One who made for you the night as a cover, and sleep for resting, and He made the day to move about in.", "verse": 47, "surah": 25}, {"quran": "And He is the One who sent the winds to spread between the hands of His mercy. And We sent down from the sky water which is pure.", "verse": 48, "surah": 25}, {"quran": "So that We revive a dead land with it and give drink to many of Our creation of livestock and people.", "verse": 49, "surah": 25}, {"quran": "And We have distributed it among them so that they may remember, but most of the people refuse to be anything but rejecters.", "verse": 50, "surah": 25}, {"quran": "And if We wish, We could send to every town a warner.", "verse": 51, "surah": 25}, {"quran": "So do not obey the rejecters, and strive against them with it in a great striving.", "verse": 52, "surah": 25}, {"quran": "And He is the One who merges the two seas; this is fresh and palatable and this is salty and bitter. And He made between them a partition and an inviolable enclosure.", "verse": 53, "surah": 25}, {"quran": "And He is the One who has created from the water a mortal, so He made him multiply and mate. And your Lord is Capable.", "verse": 54, "surah": 25}, {"quran": "And they serve besides God what does not benefit them nor harm them. And the rejecter is always set against his Lord.", "verse": 55, "surah": 25}, {"quran": "And We have not sent you except as a bearer of good news and a warner.", "verse": 56, "surah": 25}, {"quran": "Say: \"I do not ask you for any wage; but for whoever chooses to make a path to his Lord.\"", "verse": 57, "surah": 25}, {"quran": "And put your trust in the Living Who does not die, and glorify His praise. It is enough for Him that He is expert in the sins of His servants.", "verse": 58, "surah": 25}, {"quran": "The One who has created the heavens and the earth and what is between them in six days, then He settled upon the Throne. The Almighty; so ask Him for He is Expert.", "verse": 59, "surah": 25}, {"quran": "And if they are told: \"Prostrate to the Almighty.\" They say: \"And what is the Almighty? Shall we prostrate to what you order us?\" And it increases their aversion.", "verse": 60, "surah": 25}, {"quran": "Blessed is the One Who made towers in the heaven and He made in it a lamp and an illuminating moon.", "verse": 61, "surah": 25}, {"quran": "And He is the One Who made the night and the day in succession, for those who wish to remember or wish to be thankful.", "verse": 62, "surah": 25}, {"quran": "And the servants of the Almighty who walk on the earth in humility and if the ignorant speak to them, they say: \"Peace.\"", "verse": 63, "surah": 25}, {"quran": "And those who stay awake for their Lord, in prostration and standing.", "verse": 64, "surah": 25}, {"quran": "And those who say: \"Our Lord, avert from us the retribution of Hell. Its retribution is terrible.\"", "verse": 65, "surah": 25}, {"quran": "\"It is a miserable abode and station.\"", "verse": 66, "surah": 25}, {"quran": "And those who when they give they are not excessive nor stingy, but they are in a measure between that.", "verse": 67, "surah": 25}, {"quran": "And those who do not call on any other god with God; nor do they take the life which God has made forbidden, except in justice; nor do they commit adultery. And whoever does will receive the punishment.", "verse": 68, "surah": 25}, {"quran": "The retribution will be doubled for him on the Day of Resurrection and he will abide in it in disgrace.", "verse": 69, "surah": 25}, {"quran": "Except for the one who repents and believes and does good works, for those God will replace their sins with good, and God is Forgiving, Merciful.", "verse": 70, "surah": 25}, {"quran": "And whoever repents, and does good, then he shall repent towards God a true repentance.", "verse": 71, "surah": 25}, {"quran": "And those who do not bear false witness, and if they pass by vain talk they pass by with dignity.", "verse": 72, "surah": 25}, {"quran": "And those who when they are reminded of the revelations of their Lord, they do not fall on them deaf and blind.", "verse": 73, "surah": 25}, {"quran": "And those who say: \"Our Lord, grant us from our mates and our progeny what will be the comfort of our eyes, and make us leaders for the righteous.\"", "verse": 74, "surah": 25}, {"quran": "These will be rewarded with a dwelling for what they have been patient for, and they will find in it a greeting and peace.", "verse": 75, "surah": 25}, {"quran": "In it they will abide, what an excellent abode and station.", "verse": 76, "surah": 25}, {"quran": "Say: \"My Lord would not care about you except for your imploring. But you have denied, so it will be your destiny.\"", "verse": 77, "surah": 25}]]