[[{"quran": "In the name of God, the Almighty, the Merciful.", "verse": 0, "surah": 3}, {"quran": "ALM.", "verse": 1, "surah": 3}, {"quran": "God, there is no god except He, the Living, the Eternal.", "verse": 2, "surah": 3}, {"quran": "He sent down to you the Book with the truth, affirming what is between his hands; and He sent down the Torah and the Gospel.", "verse": 3, "surah": 3}, {"quran": "From before as a guidance for the people, and He sent down the Criterion. Those who rejected the revelations of God, they will have a severe retribution, and God is Noble, exacting in Revenge.", "verse": 4, "surah": 3}, {"quran": "For God nothing is hidden on the earth or in the heavens.", "verse": 5, "surah": 3}, {"quran": "He is the One who pictures you in the wombs as He pleases. There is no god except He, the Noble, the Wise.", "verse": 6, "surah": 3}, {"quran": "He is the One who sent down to you the Book, from which there are lawgiving revelations; they are the essence of the Book; and others which are of a similitude. As for those who have a disease in their hearts, they will follow that which is of a similitude, seeking to confuse, and seeking to derive an interpretation. But none know its interpretation except God, and those who are well founded in knowledge; they say: \"We believe in it, all is from our Lord.\" And none will remember except those who possess intelligence.", "verse": 7, "surah": 3}, {"quran": "\"Our Lord, do not make our hearts deviate after You have guided us, and grant us from You a mercy. Indeed, You are the Grantor.\"", "verse": 8, "surah": 3}, {"quran": "\"Our Lord, You will gather the people for a Day in which there is no doubt; God does not break His appointment.\"", "verse": 9, "surah": 3}, {"quran": "As for those who rejected, neither their money nor their children will avail them anything from God. They are the fuel of the Fire.", "verse": 10, "surah": 3}, {"quran": "Like the behavior of the people of Pharaoh and those before them. They rejected Our signs so God took them for their sins. God is awesome in retribution.", "verse": 11, "surah": 3}, {"quran": "Say to those who have rejected: \"You will be defeated and gathered towards Hell, what a miserable abode!\"", "verse": 12, "surah": 3}, {"quran": "There was a sign for you in the two groups that met. One was fighting in the cause of God, and the other was rejecting. They thus saw them as twice their number with their eyes. And God supports with His victory whom He wills. In this is a lesson for those with vision.", "verse": 13, "surah": 3}, {"quran": "It has been adorned for people to love the desire of women, and  sons, and ornaments made from gold and silver, and trained horses, and livestock, and fields. These are the enjoyment of the world, and with God is the best abode.", "verse": 14, "surah": 3}, {"quran": "Say: \"Shall I inform you of what is greater than all this? For those who believe in their Lord will be estates with rivers flowing beneath them; abiding therein, and with pure mates, and an acceptance from God. And God is Seer over the servants.\"", "verse": 15, "surah": 3}, {"quran": "The ones who say: \"Our Lord, we believe, so forgive us our sins, and spare us the retribution of the Fire.\"", "verse": 16, "surah": 3}, {"quran": "The patient, and the truthful, and the devout, and the givers, and the seekers of forgiveness in the late hours of the night.", "verse": 17, "surah": 3}, {"quran": "God bears witness that there is no god except He, as do the angels, and those with knowledge, He is standing with justice. There is no god except He, the Noble, the Wise.", "verse": 18, "surah": 3}, {"quran": "The system with God is submission, and those who received the Book did not dispute except after the knowledge came to them out of jealousy between them. And whoever rejects the revelations of God, then God is swift in judgment.", "verse": 19, "surah": 3}, {"quran": "If they debate with you, then say: \"I have submitted myself to God, as well as those who follow me.\" And say to those who have received the Book and the Gentiles: \"Have you submitted?\" If they have submitted then they are guided, and if they turn away, then you are only to deliver, and God is Seer over the servants.", "verse": 20, "surah": 3}, {"quran": "Those who reject the revelations of God and kill the prophets without right, and kill those who order justice from among the people; inform them of a painful retribution.", "verse": 21, "surah": 3}, {"quran": "These are the ones whose works will be lost in this world, and in the Hereafter they will have no supporters.", "verse": 22, "surah": 3}, {"quran": "Did you not note those who were given a portion of the Book being invited to the Book of God to judge between them, then a group of them turns away while they are adverse?", "verse": 23, "surah": 3}, {"quran": "That is because they said: \"The Fire will not touch us except for a few number of days,\" and they were arrogant by what they invented in their system.", "verse": 24, "surah": 3}, {"quran": "How shall it be when We gather them on the Day in which there is no doubt; and every soul shall receive what it has earned, and they will not be wronged.", "verse": 25, "surah": 3}, {"quran": "Say: \"Our god, Possessor of kingship; you grant kingship to whom You please, and revoke kingship from whom You please, and honor whom You please, and humiliate whom You please; in Your hand is goodness. You are capable of all things.\"", "verse": 26, "surah": 3}, {"quran": "\"You blend the night into the day, and blend the day into the night; and you bring the living out of the dead, and bring the dead out of the living; and You provide for whom You wish without reckoning.\"", "verse": 27, "surah": 3}, {"quran": "Let not the believers take the rejecters as allies instead of the believers. And whoever does so will have nothing with God; for you are to be cautious of them as they deserve. And God warns you of Himself, and to God is the destiny.", "verse": 28, "surah": 3}, {"quran": "Say: \"Whether you hide what is in your chests or you reveal it, God will know.\" And He knows what is in the heavens and the earth; and God is capable of all things.", "verse": 29, "surah": 3}, {"quran": "The Day every soul will find what good it had done present; and what bad it had done, it will wish that between them was a great distance. And God warns you of Himself, and God is Compassionate towards the servants.", "verse": 30, "surah": 3}, {"quran": "Say: \"If you love God then follow me so God will love you and forgive your sins.\" God is Forgiver, Merciful.", "verse": 31, "surah": 3}, {"quran": "Say: \"Obey God and the messenger.\" But if they turn away, then God does not love the rejecters.", "verse": 32, "surah": 3}, {"quran": "God has selected Adam, and Noah, and the family of Abraham, and the family of Imran over the worlds.", "verse": 33, "surah": 3}, {"quran": "A progeny each from the other, and God is Hearer, Knower.", "verse": 34, "surah": 3}, {"quran": "When the wife of Imran said: \"My Lord, I have vowed to You what is in my womb, devoted, so accept from me, You are the Hearer, the Knower.\"", "verse": 35, "surah": 3}, {"quran": "So when she had delivered she said: \"My Lord, I have delivered a female,\" and God is fully aware of what she delivered, \"And the male is not like the female, and I have named her Mary, and I seek refuge for her and her progeny with You from the outcast devil.\"", "verse": 36, "surah": 3}, {"quran": "So her Lord accepted her a good acceptance, and made her grow into a good growth, and charged Zachariah with her. Every time Zachariah entered upon her in the temple enclosure, he found provisions with her. He said: \"O Mary, from where did you get this?\" She said: \"It is from God, for God provides for whom He wishes without reckoning.\"", "verse": 37, "surah": 3}, {"quran": "It was then that Zachariah implored his Lord; he said: \"My Lord, grant me from You a good progeny. You are the hearer of prayer.\"", "verse": 38, "surah": 3}, {"quran": "So the angels called to him while he was standing, making contact, in the temple enclosure: \"God gives you glad tidings of John, affirming the word from God, and a master, and steadfast, and a prophet from the upright.\"", "verse": 39, "surah": 3}, {"quran": "He said: \"My Lord, how can I have a son when old age has reached me and my wife is infertile?\" He said: \"It is as such that God does what He pleases.\"", "verse": 40, "surah": 3}, {"quran": "He said: \"My Lord, make for me a sign.\" He said: \"Your sign is not to speak to the people for three days except by symbol, and remember your Lord greatly, and glorify at dusk and dawn.\"", "verse": 41, "surah": 3}, {"quran": "And the angels said: \"O Mary, God has selected you and cleansed you, and He has selected you over all the women of the worlds.\"", "verse": 42, "surah": 3}, {"quran": "\"O Mary, be devoted to your Lord and prostrate and kneel with those who kneel.\"", "verse": 43, "surah": 3}, {"quran": "This is from the news of the unseen that We inspire to you. You were not with them when they drew straws as to which one of them will be charged with Mary; you were not with them when they disputed.", "verse": 44, "surah": 3}, {"quran": "And the angels said: \"O Mary, God gives you glad tidings of a word from Him. His name is the Messiah, Jesus, son of Mary. Honorable in this world and in the Hereafter, and from among those who are made close.\"", "verse": 45, "surah": 3}, {"quran": "\"And he will speak to the people from the cradle and to middleage, and is from among the upright.\"", "verse": 46, "surah": 3}, {"quran": "She said: \"My Lord, how can I have a son when no mortal has been with me?\" He said: \"It is thus that God creates what He wills, when He decrees a command, He merely says to it 'Be,' and it is.\"", "verse": 47, "surah": 3}, {"quran": "And He teaches him the Book and the Wisdom and the Torah and the Gospel.", "verse": 48, "surah": 3}, {"quran": "And as a messenger to the Children of Israel: \"I have come to you with a sign from your Lord; that I create for you from clay the form of a bird, then I blow into it and it becomes a bird with the permission of God, and I heal the blind and the lepers, and give life to the dead with the permission of God, and I prophesize for you what you shall eat and what to store in your homes. In that is a sign for you if you are believers.\"", "verse": 49, "surah": 3}, {"quran": "\"And affirming what is between my hands of the Torah, and to make lawful some of that which was made unlawful to you; and I have come to you with a sign from your Lord, so be aware of God and obey me.\"", "verse": 50, "surah": 3}, {"quran": "\"God is my Lord and your Lord, so serve Him, this is a straight path.\"", "verse": 51, "surah": 3}, {"quran": "So when Jesus felt their rejection, he said: \"Who are my supporters to God?\" The disciples said: \"We are the supporters of God, we believe in God and we bear witness that we have submitted.\"", "verse": 52, "surah": 3}, {"quran": "\"Our Lord, we believe in what You have sent down, and followed the messenger, so record us with those who bear witness.\"", "verse": 53, "surah": 3}, {"quran": "And they schemed and God schemed, but God is the best schemer.", "verse": 54, "surah": 3}, {"quran": "For God said: \"O Jesus, I will terminate your life, and raise you to Me, and cleanse you of those who have rejected, and make those who have followed you above those who have rejected until the Day of Resurrection. Then to Me is your return, all of you,so I will judge between you in what it was that you disputed.\"", "verse": 55, "surah": 3}, {"quran": "\"As for those who have rejected, I will punish them severely in this world and in the Hereafter, they will have no supporters.\"", "verse": 56, "surah": 3}, {"quran": "\"And as for those who have believed and have done good works, We will pay them their recompense; God does not love the wicked.\"", "verse": 57, "surah": 3}, {"quran": "This We recite to you from the revelations and the wise reminder.", "verse": 58, "surah": 3}, {"quran": "The example of Jesus with God is similar to that of Adam; He created him from dust, then He said to him \"Be\" and he was.", "verse": 59, "surah": 3}, {"quran": "The truth is from your Lord, so do not be of those who doubt.", "verse": 60, "surah": 3}, {"quran": "Whoever debates with you in this after the knowledge has come to you, then say: \"Let us call our children and your children, our women and your women, ourselves and yourselves, then, let us invoke and make the curse of God upon the liars.\"", "verse": 61, "surah": 3}, {"quran": "This is the narration of truth, there is no god except God; and God is the Noble, the Wise.", "verse": 62, "surah": 3}, {"quran": "And if they turn away, then God is aware of the corrupters.", "verse": 63, "surah": 3}, {"quran": "Say: \"O people of the Book, let us come to a mutual understanding between us and between you; that we serve none except God, and that we do not set up anything with Him, and that none of us takes each other as patrons besides God.\" If they turn away, then say: \"Bear witness that we have submitted.\"", "verse": 64, "surah": 3}, {"quran": "\"O people of the Book, why do you debate with us regarding Abraham when the Torah and the Gospel were not sent down except after him? Do you not comprehend?\"", "verse": 65, "surah": 3}, {"quran": "Here you have debated in what you knew; so why then do you debate in what you do not know? And God knows while you do not know.", "verse": 66, "surah": 3}, {"quran": "Abraham was neither a Jew nor a Nazarene, but he was a monotheist who submitted; he was not of the polytheists.", "verse": 67, "surah": 3}, {"quran": "The most legitimate people to Abraham are those who followed him; and this prophet, and those who believed; and God is the supporter of the believers.", "verse": 68, "surah": 3}, {"quran": "A group from the people of the Book wished that they could misguide you, but they only misguide themselves and they do not notice.", "verse": 69, "surah": 3}, {"quran": "\"O people of the Book, why do you reject the revelations of God while you are bearing witness?\"", "verse": 70, "surah": 3}, {"quran": "\"O people of the Book, why do you confound the truth with falsehood and conceal the truth while you know?\"", "verse": 71, "surah": 3}, {"quran": "And a group from among the people of the Book said: \"Believe in what was sent down to those who believe during the beginning of the day, and reject it by the end of it, perhaps they will return.\"", "verse": 72, "surah": 3}, {"quran": "\"And do not believe except in he who follows your system.\" Say: \"The guidance is the guidance of God.\" That anyone should be given similar to what you have been given, or that they debate with you at your Lord. Say: \"The bounty is in the hand of God, He gives it to whom He chooses, and God is Encompassing, Knowledgeable.\"", "verse": 73, "surah": 3}, {"quran": "He singles out with His mercy whom He chooses, and God is with Great Bounty.", "verse": 74, "surah": 3}, {"quran": "And from among the people of the Book are those whom if you entrust him with a large amount he gives it back to you, and there are those whom if you entrust with one gold coin he will not return it to you unless you are standing over him. That is because they said: \"We have no obligation towards the Gentiles.\" They say about God lies while they know.", "verse": 75, "surah": 3}, {"quran": "Indeed, anyone who fulfils his pledge and is righteous, then God loves the righteous.", "verse": 76, "surah": 3}, {"quran": "The ones who purchase with the pledge of God and their oaths a cheap price, those will have no portion in the Hereafter, and God will not speak to them, nor will He look at them on the Day of Resurrection, nor will He purify them, and they will have a painful retribution.", "verse": 77, "surah": 3}, {"quran": "And from among them is a group who twist their tongues with the Book so that you may think it is from the Book, while it is not from the Book, and they say it is from God while it is not from God, and they say about God lies while they know.", "verse": 78, "surah": 3}, {"quran": "It is not for any mortal that God would give him the Book and the authority and the prophethood, then he would say to the people: \"Be servants to me rather than God!\" Rather: \"Be Devotees for what you have been taught of the Book, and of what you have studied.\"", "verse": 79, "surah": 3}, {"quran": "Nor does He order you that you take the angels and the prophets as patrons. Would He order you to rejection after you have submitted?", "verse": 80, "surah": 3}, {"quran": "And God took a covenant from the prophets: \"For what I have given you of the Book and wisdom, then a messenger will come to you affirming what is with you. You will believe in him and support him.\" He said: \"Do you testify, and agree to this burden?\" They said: \"We testify.\" He said: \"Then bear witness, and I am with you bearing witness.\"", "verse": 81, "surah": 3}, {"quran": "Whoever turns away after that, then they are the wicked.", "verse": 82, "surah": 3}, {"quran": "Is it other than the system of God that they desire, when those in the heavens and the earth have submitted to Him voluntarily or by force? And to Him they will be returned.", "verse": 83, "surah": 3}, {"quran": "Say: \"We believe in God and what was sent down to us and what was sent down to Abraham and Ishmael and Isaac and Jacob and the Patriarchs, and what was given to Moses and Jesus and the prophets from their Lord. We do not make a distinction between any of them, and to Him we submit.\"", "verse": 84, "surah": 3}, {"quran": "And whoever follows other than submission as a system, it will not be accepted from him, and in the Hereafter he is of the losers.", "verse": 85, "surah": 3}, {"quran": "How can God guide a people who have rejected after believing, and they had witnessed that the messenger was true, and the clarity had come to them? God does not guide the wicked people.", "verse": 86, "surah": 3}, {"quran": "To these the punishment will be that the curse of God will be upon them and that of the angels and the people all together!", "verse": 87, "surah": 3}, {"quran": "Abiding therein, the retribution will not be lightened for them, nor will they be reprieved.", "verse": 88, "surah": 3}, {"quran": "Except those who repent after this and make amends, then God is Forgiver, Merciful.", "verse": 89, "surah": 3}, {"quran": "Those who have rejected after their belief, then increased in rejection, their repentance will not be accepted, they are the strayers.", "verse": 90, "surah": 3}, {"quran": "Those who have rejected and died while they were rejecters, if the earth full of gold were to be ransomed with it would not be accepted from any of them. For these there will be a painful retribution and they will have no supporters.", "verse": 91, "surah": 3}, {"quran": "You will not reach piety until you spend from what you love; and whatever you spend, God is aware of it.", "verse": 92, "surah": 3}, {"quran": "All the food was made lawful to the Children of Israel except what Israel forbade for himself before the Torah was sent down. Say: \"Bring the Torah and recite it if you are truthful.\"", "verse": 93, "surah": 3}, {"quran": "Whoever invents lies about God after this, these are the wicked.", "verse": 94, "surah": 3}, {"quran": "Say: \"God bears truth. Follow the creed of Abraham, monotheism, and he was not of the polytheists.\"", "verse": 95, "surah": 3}, {"quran": "The first Shrine established for the people is the one in Bakk'a, blessed, and a guidance for the worlds.", "verse": 96, "surah": 3}, {"quran": "In it are clear signs: the station of Abraham. And whoever enters it will be secure. And God is owed from the people to make Pilgrimage to the Shrine, whoever can make a path to it. And whoever rejects, then God has no need of the worlds.", "verse": 97, "surah": 3}, {"quran": "Say: \"O people of the Book, why do you reject the revelations of God, while God is witness over what you do?\"", "verse": 98, "surah": 3}, {"quran": "Say: \"O people of the Book, why do you repel from the path of God those who believe? You wish to twist it while you are witnesses. And God is not unaware of what you do.\"", "verse": 99, "surah": 3}, {"quran": "O you who believe, if you obey a group of those who received the Book they will turn you after your belief into rejecters!", "verse": 100, "surah": 3}, {"quran": "And how can you reject when the revelations of God are being recited to you and with you is His messenger? And whoever holds firmly to God has been guided to the straight path.", "verse": 101, "surah": 3}, {"quran": "O you who believe, reverence God as He deserves to be reverenced, and do not die except as ones who have submitted.", "verse": 102, "surah": 3}, {"quran": "And hold firmly to the rope of God, all of you, and do not be separated. And remember the blessing of God upon you when you were enemies and He united your hearts. Then you became, with His blessing, brothers; and you were on the edge of a pit of fire and He saved you from it; it is thus that God clarifies for you His signs that you may be guided.", "verse": 103, "surah": 3}, {"quran": "And let there be a nation from among you who calls towards goodness, and orders kindness, and prohibits vice. And these are the successful ones.", "verse": 104, "surah": 3}, {"quran": "And do not be like those who separated and differed after the clarity had come to them. And for them is a painful retribution.", "verse": 105, "surah": 3}, {"quran": "The Day on which faces will be lightened and faces will be darkened; as for those whose faces will be darkened: \"Did you reject after believing? Taste the retribution for what you rejected.\"", "verse": 106, "surah": 3}, {"quran": "As for those whose faces will be lightened, they are in the mercy of God, in it they abide.", "verse": 107, "surah": 3}, {"quran": "These are the revelations of God, We recite them to you with the truth. God does not want wickedness for the worlds.", "verse": 108, "surah": 3}, {"quran": "And to God is all that is in the heavens and the earth; and to God all matters are returned.", "verse": 109, "surah": 3}, {"quran": "You were the best nation that emerged for the people, you ordered kindness and prohibited vice, and believed in God. If the people of the Book believed it would have been better for them; from among them are the believers, but the majority are the wicked.", "verse": 110, "surah": 3}, {"quran": "They will not harm you except in being an annoyance, and if they fight you they will turn and flee, then they will not be supported.", "verse": 111, "surah": 3}, {"quran": "They are struck with humiliation wherever they are encountered, except for a rope from God and a rope from the people. And they stayed in the wrath of God and were struck with humiliation; that is because they were disbelieving in the revelations of God and killing the prophets without right; that is for what they disobeyed and were transgressing.", "verse": 112, "surah": 3}, {"quran": "They are not all the same, from the people of the Book are a nation that is upright; they recite the revelations of God during the night hours and they prostrate.", "verse": 113, "surah": 3}, {"quran": "They believe in God and the Last Day and order kindness and prohibit vice, and they hasten in goodness; these are of the good doers.", "verse": 114, "surah": 3}, {"quran": "And what they do of good will not be turned back, and God is aware of the righteous.", "verse": 115, "surah": 3}, {"quran": "As for those who rejected, neither their money nor their children will avail them anything from God. These are the people of the Fire, in it they abide.", "verse": 116, "surah": 3}, {"quran": "The example of what they spend in this world is like a wind in which there is a frost; it afflicts the field of the people who wronged themselves, and thus destroys it. God did not wrong them, but it was their souls that they wronged.", "verse": 117, "surah": 3}, {"quran": "O you who believe do not take as an inner circle any from besides yourselves; they will only disrupt you greatly. They wish that you deviate; the hatred is apparent out of their mouths and what their chests conceal is even greater! We have made clear for you the signs if you comprehend.", "verse": 118, "surah": 3}, {"quran": "Here you love them while they do not love you, and you believe in the entire Book. And if they meet you they say: \"We believe,\" and if they are alone they bite their fingers out of frustration at you. Say: \"Die in your frustration, God is aware of what is in the chests.\"", "verse": 119, "surah": 3}, {"quran": "If any good befalls you it disturbs them, and if any bad befalls you they rejoice with it. And if you are patient and righteous their planning will not harm you at all. God is Encompassing all they do.", "verse": 120, "surah": 3}, {"quran": "And as you departed from your family to prepare for the believers their stations for battle-and God is Hearer, Knowledgeable.", "verse": 121, "surah": 3}, {"quran": "When two parties from among you were obsessed that they would fail; while God was their supporter. In God the believers should trust.", "verse": 122, "surah": 3}, {"quran": "God had granted you victory at Badr, while you had been the lesser, so reverence God that you may be thankful.", "verse": 123, "surah": 3}, {"quran": "When you said to the believers: \"Is it not enough for you that your Lord would supply you with three thousand of the angels sent down?\"", "verse": 124, "surah": 3}, {"quran": "Indeed, if you are patient and are righteous and they come and attack you, He will supply you with five thousand of the angels battle trained.", "verse": 125, "surah": 3}, {"quran": "And God did not give this except as good news to you, and so that your hearts may be assured with it. Victory is only from God, the Noble, the Wise.", "verse": 126, "surah": 3}, {"quran": "Thus He will sever a group of those who reject, or disgrace them; then they will turn back frustrated.", "verse": 127, "surah": 3}, {"quran": "You will have no say in the matter, for He may pardon them, or punish them; for they are wicked.", "verse": 128, "surah": 3}, {"quran": "And to God is what is in the heavens and in the earth, He forgives whom He pleases, and He punishes whom He pleases; and God is Forgiving, Merciful.", "verse": 129, "surah": 3}, {"quran": "O you who believe, do not consume usury, compounding over and over; and reverence God that you may succeed.", "verse": 130, "surah": 3}, {"quran": "And be aware of the Fire that has been prepared for the rejecters.", "verse": 131, "surah": 3}, {"quran": "And obey God and the messenger so that you may obtain mercy.", "verse": 132, "surah": 3}, {"quran": "And race towards forgiveness from your Lord and a Paradise whose width encompasses the width of the heavens and of the earth; it has been prepared for the righteous.", "verse": 133, "surah": 3}, {"quran": "The ones who spend in prosperity and hardship, and who repress anger, and who pardon the people; God loves the good doers.", "verse": 134, "surah": 3}, {"quran": "And those who, if they commit lewdness, or wrong themselves, they remember God and seek forgiveness for their sins. And who can forgive the sins except God? And they do not persist in what they have done while they know.", "verse": 135, "surah": 3}, {"quran": "To these the recompense will be forgiveness from their Lord and estates with rivers flowing beneath them; abiding therein. Excellent is the recompense of the workers.", "verse": 136, "surah": 3}, {"quran": "Many nations have come before you, so roam the earth and see how the punishment was for the deniers.", "verse": 137, "surah": 3}, {"quran": "This is a clarification for the people and a reminder for the righteous.", "verse": 138, "surah": 3}, {"quran": "Do not be weak, and do not grieve, for you will have the upper hand, if you are believers.", "verse": 139, "surah": 3}, {"quran": "If you are wounded, then know that the other group is also wounded. And such are the days, We alternate them between the people, so that God will distinguish those who believe, and so He may make witnesses from among you; and God does not love the wicked.", "verse": 140, "surah": 3}, {"quran": "And God will prove those who believe and He will condemn the rejecters.", "verse": 141, "surah": 3}, {"quran": "Or did you think that you would enter Paradise without God distinguishing those who would strive among you and distinguishing those who are patient?", "verse": 142, "surah": 3}, {"quran": "And you used to long for death before you came upon it; so now you see it right in front of you!", "verse": 143, "surah": 3}, {"quran": "And Mohammed is but a messenger, like many messengers who have passed before him. If he dies or is killed will you turn back on your heels? And whoever turns back on his heels, he will not harm God in the least. And God will recompense the thankful.", "verse": 144, "surah": 3}, {"quran": "It is not permitted for a person to die except by the permission of God in an appointed record. And whoever wants the reward of this world We give him of it, and whoever wants the reward of the Hereafter, We give him of it. And We will reward the thankful.", "verse": 145, "surah": 3}, {"quran": "And many a prophet had a large number of Devotees fighting with him. They did not waver by what afflicted them in the cause of God, nor did they become weak, nor did they become discouraged; and God loves the patient ones.", "verse": 146, "surah": 3}, {"quran": "And they did not say except: \"Our Lord, forgive us our sins and our shortcomings in our responsibility, and make firm our foothold, and grant us victory over the rejecting people.\"", "verse": 147, "surah": 3}, {"quran": "So God gave them the reward of this world and the best reward of the Hereafter; and God loves the good doers.", "verse": 148, "surah": 3}, {"quran": "O you who believe, if you obey those who have rejected, then they will turn you back on your heels and you will turn back as losers.", "verse": 149, "surah": 3}, {"quran": "It is God who is your Patron, and He is the best victor.", "verse": 150, "surah": 3}, {"quran": "We will cast terror in the hearts of those who have rejected, because of what they have set up besides God while He never sent down any authority to do so, and their destiny is the Fire. Miserable is the abode of the wicked.", "verse": 151, "surah": 3}, {"quran": "And God has fulfilled His promise to you, that you would overwhelm them with His permission; but then you failed and disputed in the matter and disobeyed after He showed you what you had sought. Some of you want this world, and some of you want the Hereafter. Then He let you retreat from them that He may test you; and He has pardoned you. God is with great grace over the believers.", "verse": 152, "surah": 3}, {"quran": "For you were ascending to the high ground and would not even glance towards anyone, and the messenger was calling to you from behind. Therefore He gave you worry to replace your worry, so that you would not have sadness by what has passed you, or for what afflicted you, and God is Expert over what you do.", "verse": 153, "surah": 3}, {"quran": "Then He sent down to you after the worry a tranquility in sleepiness, it overtook a group of you; and another group was obsessed with themselves, they were thinking about God other than the truth, the thoughts of the days of ignorance. They say: \"Why are we involved in this affair?\" Say: \"The entire affair is for God.\" They hide in their souls what they do not show to you, they say: \"If we had a say in this affair then none of us would have been killed here.\" Say: \"If you were inside your own homes, then the ones who had been marked for death would have come out to their resting place.\" God will test what is in your chests and bring out what is in your hearts. God is Knowledgeable as to what is in the chests.", "verse": 154, "surah": 3}, {"quran": "Those of you who turned away on the day that the two hosts met, it was the devil who caused them to slip due to some of what they had earned. And God has pardoned them, for God is Forgiver, Compassionate.", "verse": 155, "surah": 3}, {"quran": "O you who believe do not be like those who rejected and said to their brothers when they had gone forth in the land or on the offensive: \"If they were here with us they would not have died nor been killed.\" God will make this a source of grief in their hearts, and God grants life and death, and God is watching over what you do.", "verse": 156, "surah": 3}, {"quran": "And if you are killed in the cause of God or die, then forgiveness from God and mercy are far greater than all they can put together.", "verse": 157, "surah": 3}, {"quran": "And if you die or are killed, then to God you will be gathered.", "verse": 158, "surah": 3}, {"quran": "It was a mercy from God that you were soft towards them; had you been harsh and hard-hearted, they would have dispersed from you; so pardon them and ask forgiveness for them, and consult them in the matter; but when you are convinced, then put your trust in God; for God loves those who put their trust.", "verse": 159, "surah": 3}, {"quran": "If God grants you victory then none can defeat you, and if He abandons you then who can grant you victory after Him? And towards God the believers should put their trust.", "verse": 160, "surah": 3}, {"quran": "It was not for any prophet to embezzle, and he who embezzles will be brought with what he has embezzled on the Day of Resurrection, then every soul will be given what it has earned without being wronged.", "verse": 161, "surah": 3}, {"quran": "Is he who follows the pleasure of God as he who draws the wrath of God and his abode is Hell and a miserable destiny?", "verse": 162, "surah": 3}, {"quran": "They are in grades with God, and God is Seer of what they do.", "verse": 163, "surah": 3}, {"quran": "God has bestowed grace upon the believers by sending them a messenger from among themselves reciting His revelations and purifying them and teaching them the Book and the wisdom, and they were before in manifest darkness.", "verse": 164, "surah": 3}, {"quran": "And so it was when you suffered setback; even though you afflicted them with twice as much setback; you said: \"Where is this coming from?\" Say: \"It is from yourselves.\" God is capable of all things.", "verse": 165, "surah": 3}, {"quran": "And what you suffered on the day the two hosts met was with the permission of God, and to let the believers know.", "verse": 166, "surah": 3}, {"quran": "And to let those who are hypocrites know, that they were told: \"Come fight in the cause of God or defend,\" they said: \"If we knew how to fight we would have followed you.\" They are closer to rejection than they are to belief. They say with their mouths what is not in their hearts, and God is aware of what they conceal.", "verse": 167, "surah": 3}, {"quran": "Those who remained and said to their brothers: \"If they obeyed us they would not have been killed.\" Say: \"Then avert death away from yourselves if you are truthful!\"", "verse": 168, "surah": 3}, {"quran": "And do not think that those who are killed in the cause of God are dead. No, they are alive at their Lord receiving a bounty.", "verse": 169, "surah": 3}, {"quran": "Happy with what God has granted them from His grace, and they rejoice in those who have yet to follow after them. There is no fear upon them nor do they grieve.", "verse": 170, "surah": 3}, {"quran": "They rejoice with the bounty of God and grace; God will not waste the recompense of the believers.", "verse": 171, "surah": 3}, {"quran": "Those who have answered God and the messenger after they were afflicted with wounds. For those of them who did good and were righteous is a great recompense.", "verse": 172, "surah": 3}, {"quran": "The ones who the people said to them: \"The people have gathered against you, so be concerned by them,\" but it only increased their faith and they said: \"God is sufficient for us, and He is the best to put our trust in.\"", "verse": 173, "surah": 3}, {"quran": "So they came back with a recompense from God and a bounty, no harm would touch them. And they had followed the pleasure of God, and God is the One with great pleasure.", "verse": 174, "surah": 3}, {"quran": "It is only the devil trying to create fear for his allies, so do not fear them, but fear Me if you are believers.", "verse": 175, "surah": 3}, {"quran": "And do not be saddened by those who rush into disbelief. They will not harm God in the least. God does not wish to make for them any share in the Hereafter, and they will have a painful retribution.", "verse": 176, "surah": 3}, {"quran": "Those who have purchased rejection with belief will not harm God in the least, and they will have a painful retribution.", "verse": 177, "surah": 3}, {"quran": "And let not those who reject think that We are providing for them out of the goodness of themselves. We are only providing for them so that they may increase in transgression, and they will have a humiliating retribution.", "verse": 178, "surah": 3}, {"quran": "God was not to leave the believers as they were without distinguishing the rotten from the good. And God was not to let you know the future, but God chooses from His messengers whom He wishes; so believe in God and His messengers. And if you believe and are righteous, then you will have a great recompense.", "verse": 179, "surah": 3}, {"quran": "And let not those who are stingy with what God has given them of His bounty think that it is good for them, no, it is evil for them. They will be surrounded by what they were stingy with on the Day of Resurrection. And to God will be the inheritance of the heavens and the earth; and God is Expert over what you do.", "verse": 180, "surah": 3}, {"quran": "God has heard the words of those who said: \"God is poor and we are rich!\" We will record what they have said and their killing of the prophets without right; and We will say: \"Taste the retribution of the Fire!\"", "verse": 181, "surah": 3}, {"quran": "This is for what their hands have delivered, and God does not wrong the servants.", "verse": 182, "surah": 3}, {"quran": "Those who said: \"God has pledged to us that we should not believe in a messenger unless he brings us an offering which the fire will devour.\" Say: \"Messengers have come to you before me with clarity and with what you have said, so why did you kill them if you were truthful?\"", "verse": 183, "surah": 3}, {"quran": "If they deny you, then messengers before you were also denied; they came with the proofs and the scriptures and the Book of Enlightenment.", "verse": 184, "surah": 3}, {"quran": "Every person will taste death, and you will be recompensed your dues on the Day of Resurrection. Whoever is swayed from the Fire and entered into Paradise, he has indeed won. This worldly life is nothing more than the enjoyment of vanity.", "verse": 185, "surah": 3}, {"quran": "We will test you in your wealth and in yourselves, and you will hear from those who have been given the Book from before you and from the polytheists much annoyance. And if you are patient and righteous, then that is from a strength of conviction.", "verse": 186, "surah": 3}, {"quran": "And God took the covenant of those who were given the Book: \"You will make it clear to the people and not conceal it.\" But they placed it behind their backs and purchased with it a cheap price. Miserable indeed is what they have purchased.", "verse": 187, "surah": 3}, {"quran": "Do not think that those who are happy with what they have been given, and they love to be praised for what they did not do; do not think they are saved from the punishment. For them is a painful retribution.", "verse": 188, "surah": 3}, {"quran": "And to God is the sovereignty of the heavens and the earth, and God is capable of all things.", "verse": 189, "surah": 3}, {"quran": "In the creation of the heavens and the earth, and the difference between the night and the day, are signs for those who possess intelligence.", "verse": 190, "surah": 3}, {"quran": "Those who remember God while standing, and sitting, and on their sides, and they ponder over the creation of the heavens and the earth: \"Our Lord you have not created this without purpose, glory to You, spare us the retribution of the Fire!\"", "verse": 191, "surah": 3}, {"quran": "\"Our Lord, whoever You admit to the Fire has been disgraced. The wicked will have no supporters.\"", "verse": 192, "surah": 3}, {"quran": "\"Our Lord, we have heard a caller inviting to the faith: \"Believe in your Lord,\" so we have believed. Our Lord forgive us our bad deeds, and forgive our sins, and let us die in the company of the righteous.\"", "verse": 193, "surah": 3}, {"quran": "\"Our Lord, and grant us what You have promised through Your messengers, and do not embarrass us on the Day of Resurrection. You do not break the promise.\"", "verse": 194, "surah": 3}, {"quran": "Their Lord answered them: \"I do not waste the work of any worker from among you, whether male or female, you are all as each other. For those who emigrated and were driven out from their homes and were harmed in My cause, and they fought and were killed, I will forgive for them their sins and admit them to estates with rivers flowing beneath them.\" A recompense from God; and God has the best recompense.", "verse": 195, "surah": 3}, {"quran": "Do not be deceived by the success of those who have rejected in the land.", "verse": 196, "surah": 3}, {"quran": "A brief enjoyment, then their abode is Hell. What a miserable abode!", "verse": 197, "surah": 3}, {"quran": "As for those who reverence their Lord, they will have estates with rivers flowing beneath them; abiding therein as a dwelling from God. What is with God is better for the obedient.", "verse": 198, "surah": 3}, {"quran": "And from the people of the Book are those who believe in God and what was sent down to you and what was sent down to them; fearful to God, they do not purchase with the revelations of God a cheap price. These will have their recompense with their Lord. For God is swift in reckoning.", "verse": 199, "surah": 3}, {"quran": "O you who believe, be patient and call for patience, and stand firm, and reverence God that you may succeed.", "verse": 200, "surah": 3}]]