[[{"quran": "In the name of God, the Almighty, the Merciful.", "verse": 0, "surah": 57}, {"quran": "Glorifying God is everything in the heavens and the earth. He is the Noble, the Wise.", "verse": 1, "surah": 57}, {"quran": "To Him is the kingship of the heavens and the earth. He brings life and death. And He is capable of all things.", "verse": 2, "surah": 57}, {"quran": "He is the First and the Last, the Evident and the Innermost. And He is fully aware of all things.", "verse": 3, "surah": 57}, {"quran": "He is the One who has created the heavens and the earth in six days, then He settled upon the Throne. He knows everything that enters within the earth, and everything that comes out of it, and everything that comes down from the heaven, and everything that ascends into it. And He is with you wherever you may be. God is Seer of what you do.", "verse": 4, "surah": 57}, {"quran": "To Him is the kingship of the heavens and the earth, and to God all matters are returned.", "verse": 5, "surah": 57}, {"quran": "He merges the night into the day, and He merges the day into the night. He is fully aware of what is in the chests.", "verse": 6, "surah": 57}, {"quran": "Believe in God and His messenger, and spend from what He has made you successors to. Those among you who believe and spend have deserved a great recompense.", "verse": 7, "surah": 57}, {"quran": "Why should you not believe in God when the messenger is inviting you to believe in your Lord? And He has already taken a covenant from you, if you are believers.", "verse": 8, "surah": 57}, {"quran": "He is the One who sends down to His servant clear revelations, to bring you out of the darkness and into the light. God is Compassionate towards you, Merciful.", "verse": 9, "surah": 57}, {"quran": "And why do you not spend in the cause of God, when God possesses all wealth in the heavens and the earth? Not equal among you are those who spent before the victory and fought. They attained a greater rank than those who spent after the victory and fought. And for each, God promises goodness. And God is Expert in everything you do.", "verse": 10, "surah": 57}, {"quran": "Who will lend God a loan of righteousness that He may multiply it for him, and he will have a generous recompense?", "verse": 11, "surah": 57}, {"quran": "The Day will come when you see the believing males and the believing females with their light radiating around them and to their right. \"Good news is yours today, you will have estates with rivers flowing beneath them; abiding therein. This is the great triumph!\"", "verse": 12, "surah": 57}, {"quran": "On that Day, the hypocrite males and the hypocrite females will say to those who believed: \"Wait for us! Let us absorb some of your light.\" It will be said: \"Go back behind you, and seek light.\" So a barrier will be put forth between them, whose gate separates mercy on the inner side, from retribution on the outer side.", "verse": 13, "surah": 57}, {"quran": "They will call upon them: \"Were we not with you?\" They will reply: \"Yes, but you led yourselves into temptation, and you hesitated, and doubted, and became misled by wishful thinking, until the judgment of God came. You were diverted from God by arrogance.\"", "verse": 14, "surah": 57}, {"quran": "\"This Day, no ransom can be taken from you, nor from those who disbelieved. Your abode is the Fire, it is your patron; what a miserable abode.\"", "verse": 15, "surah": 57}, {"quran": "Has not the time come for those who believed to open up their hearts for the remembrance of God, and the truth that is revealed herein? And they should not be like those who were given the Book before, and the waiting became long for them, so their hearts became hardened, and many of them were wicked.", "verse": 16, "surah": 57}, {"quran": "Know that God revives the land after it had died. We have made clear to you the signs, perhaps you may comprehend.", "verse": 17, "surah": 57}, {"quran": "Surely, the charitable males and charitable females, who lend God a loan of righteousness, He will multiply their reward, and they will have a generous recompense.", "verse": 18, "surah": 57}, {"quran": "And those who believed in God and His messengers are the truthful ones. And the martyrs at their Lord will have their reward and their light. As for those who disbelieved and denied Our revelations, they are the dwellers of Hell.", "verse": 19, "surah": 57}, {"quran": "Know that the worldly life is no more than play and distraction and adornments, and boasting among you, and to increase in wealth and children. It is like plants that are supplied by an abundant rain, which appear pleasing to the rejecters. But then they dry up and turn yellow, and become useless hay. And in the Hereafter there is severe retribution, and forgiveness from God and acceptance. This worldly life is no more than a deceiving enjoyment.", "verse": 20, "surah": 57}, {"quran": "You shall race towards forgiveness from your Lord, and a Paradise whose width is as the width of the heaven and the earth, prepared for those who believed in God and His messengers. Such is the grace of God that He bestows upon whoever He wills. God is the Possessor of Infinite Grace.", "verse": 21, "surah": 57}, {"quran": "No misfortune can happen on the earth, or in yourselves, except it is decreed in a record, before We bring it about. This is easy for God to do.", "verse": 22, "surah": 57}, {"quran": "In order that you do not despair over anything that has passed you by, nor be happy of anything He has bestowed upon you. God does not love those who are boastful, proud.", "verse": 23, "surah": 57}, {"quran": "They are stingy, and order the people to be stingy. And for anyone who turns away, then know that God is the Rich, the Praiseworthy.", "verse": 24, "surah": 57}, {"quran": "We have sent Our messengers with clear proofs, and We sent down with them the Book and the balance, so that the people may uphold justice. And We sent down the iron, wherein there is great strength, and many benefits for the people. So that God would distinguish those who would support Him and His messengers in the unseen. God is Powerful, Noble.", "verse": 25, "surah": 57}, {"quran": "And We had sent Noah and Abraham, and We placed in their progeny the prophethood and the Book. Some of them were guided, while many were wicked.", "verse": 26, "surah": 57}, {"quran": "Then We sent in their tracks Our messengers. And We sent Jesus, son of Mary, and We gave him the Gospel, and We ordained in the hearts of his followers kindness and mercy. But they invented Monasticism which We never decreed for them. They wanted to please God, but they did not observe it the way it should have been observed. Consequently, We gave those who believed among them their recompense, while many of them were wicked.", "verse": 27, "surah": 57}, {"quran": "O you who believe, you shall reverence God and believe in His messenger. He will then grant you double the reward from His mercy, and He will make for you a light by which you shall walk, and He will forgive you. And God is Forgiving, Merciful.", "verse": 28, "surah": 57}, {"quran": "So that the followers of the Book should know that they have no power over the grace of God, and that all grace is in the hand of God. He bestows it upon whoever He wills. God is Possessor of Infinite Grace.", "verse": 29, "surah": 57}]]