[[{"quran": "In the name of God, the Almighty, the Merciful.", "verse": 0, "surah": 45}, {"quran": "HM.", "verse": 1, "surah": 45}, {"quran": "The revelation of the Book is from God, the Noble, the Wise.", "verse": 2, "surah": 45}, {"quran": "In the heavens and the earth are signs for the believers.", "verse": 3, "surah": 45}, {"quran": "And in your creation, and what creatures He puts forth are signs for people who are certain.", "verse": 4, "surah": 45}, {"quran": "And the alternation of the night and  the day, and what God sends down from the heaven of provisions to revive the land after its death, and the dispatching of the winds, are signs for a people who comprehend.", "verse": 5, "surah": 45}, {"quran": "These are the revelations of God, We recite them to you with the truth. So, in which narrative after God and His revelations do they believe?", "verse": 6, "surah": 45}, {"quran": "Woe to every sinful fabricator.", "verse": 7, "surah": 45}, {"quran": "He hears the revelations of God being recited to him, then he persists arrogantly, as if he never heard them. Give him news of a painful retribution.", "verse": 8, "surah": 45}, {"quran": "And if he learns anything from Our revelations, he takes it in mockery. For these will be a humiliating retribution.", "verse": 9, "surah": 45}, {"quran": "Waiting for them is Hell. And that which they earned will not help them, nor those whom they have taken as allies besides God, and for them is a terrible retribution.", "verse": 10, "surah": 45}, {"quran": "This is a guidance. And those who reject the revelations of their Lord, for them is an affliction of a painful retribution.", "verse": 11, "surah": 45}, {"quran": "God is the One who commissioned the sea in your service, so that the ships can run in it by His command, and that you may seek of His provisions, and that you may be thankful.", "verse": 12, "surah": 45}, {"quran": "And He commissioned in your service what is in the heavens and what is in the earth; all from Him. In that are signs for a people who reflect.", "verse": 13, "surah": 45}, {"quran": "Say to those who believed to forgive those who do not look forward to the days of God. He will recompense a people for whatever they have earned.", "verse": 14, "surah": 45}, {"quran": "Whoever works good does so for himself, and whoever works evil will suffer it. Then to your Lord you will be returned.", "verse": 15, "surah": 45}, {"quran": "And We had given the Children of Israel the Book, and the judgment, and the prophethood, and We provided them with good provisions; and We preferred them over the worlds.", "verse": 16, "surah": 45}, {"quran": "And We gave them clarity in the matter, but then they disputed after the knowledge had come to them, out of jealousy among themselves. Your Lord will judge them on the Day of Resurrection regarding everything that they have disputed.", "verse": 17, "surah": 45}, {"quran": "Then We have established you on the path of things; so follow it and do not follow the desires of those who do not know.", "verse": 18, "surah": 45}, {"quran": "They cannot help you against God in the least. And the transgressors are allies to one another, while God is the Protector of the righteous.", "verse": 19, "surah": 45}, {"quran": "This is a physical evidence for the people, and a guidance and a mercy for a people who are certain.", "verse": 20, "surah": 45}, {"quran": "Or do those who work evil expect that We would treat them the same as those who believe and do good works, in their present life and their death? Miserable is how they judge.", "verse": 21, "surah": 45}, {"quran": "And God created the heavens and the earth with the truth, and so that every soul may be recompensed for whatever it earned, and they will not be wronged.", "verse": 22, "surah": 45}, {"quran": "Have you seen the one who took his desire as his god, and God led him astray, despite his knowledge, and He sealed his hearing and his heart, and He made a veil on his eyes? Who then can guide him after God? Will you not remember?", "verse": 23, "surah": 45}, {"quran": "And they said: \"There is nothing except this worldly life; we die and we live and nothing destroys us except the passing of time!\" And they have no knowledge about this; they only conjecture.", "verse": 24, "surah": 45}, {"quran": "And when Our clear revelations are recited to them, their only argument is to say: \"Then bring back our forefathers, if you are truthful.\"", "verse": 25, "surah": 45}, {"quran": "Say: \"God gives you life, then He puts you to death, then He will gather you to the Day of Resurrection, in which there is no doubt. But most of the people do not know.\"", "verse": 26, "surah": 45}, {"quran": "And to God is the sovereignty of the heavens and the earth. And on the Day the Hour comes to pass, on that Day the falsifiers will lose.", "verse": 27, "surah": 45}, {"quran": "And you will see every nation lined up together. Every nation will be called to its book. \"Today, you will be recompensed for everything you have done.\"", "verse": 28, "surah": 45}, {"quran": "\"This is Our record; it utters the truth about you. We have been recording everything you did.\"", "verse": 29, "surah": 45}, {"quran": "As for those who believed and did good works, their Lord will admit them into His mercy. Such is the clear triumph.", "verse": 30, "surah": 45}, {"quran": "As for those who disbelieve: \"Were not My revelations recited to you, but you turned arrogant and were a criminal people?\"", "verse": 31, "surah": 45}, {"quran": "And when it was said: \"Surely the promise of God is the truth, and there is no doubt about the coming of the Hour,\" you said: \"We do not know what the Hour is! We are full of conjecture about it; we are not certain.\"", "verse": 32, "surah": 45}, {"quran": "And the evils of their works will become evident to them, and they will be surrounded by that which they used to mock.", "verse": 33, "surah": 45}, {"quran": "And it will be said to them: \"Today We will forget you, just as you forgot the meeting of this Day. And your abode is the Fire, and you will have no helpers.\"", "verse": 34, "surah": 45}, {"quran": "\"This is because you took the revelations of God in mockery, and you were deceived by the worldly life.\" So from this Day, they will never exit therefrom, nor will they be excused.", "verse": 35, "surah": 45}, {"quran": "To God belongs all praise; the Lord of the heavens, and the Lord of the earth; the Lord of the worlds.", "verse": 36, "surah": 45}, {"quran": "And to Him belongs all majesty in the heavens and the earth. He is the Noble, the Wise.", "verse": 37, "surah": 45}]]