[[{"quran": "In the name of God, the Almighty, the Merciful.", "verse": 0, "surah": 35}, {"quran": "Praise be to God, Initiator of the heavens and the earth; maker of the angels as messengers with wings of two, and three, and four. He increases in the creation as He wishes. God is able to do all things.", "verse": 1, "surah": 35}, {"quran": "Whatever mercy God opens for the people, none can stop it. And what He holds back none can send it other than He. And He is the Noble, the Wise.", "verse": 2, "surah": 35}, {"quran": "O people, remember the blessings of God upon you. Is there any creator other than God who provides for you from the heaven and the earth? There is no god besides Him, so why do you deviate?", "verse": 3, "surah": 35}, {"quran": "And if they deny you, then also messengers before you have been denied. And to God all matters are returned.", "verse": 4, "surah": 35}, {"quran": "O people, the promise of God is the truth; therefore, do not be overwhelmed by this worldly life, and do not let arrogance overwhelm you from God.", "verse": 5, "surah": 35}, {"quran": "The devil is an enemy to you, so treat him as an enemy. He only invites his faction to be the dwellers of Hell.", "verse": 6, "surah": 35}, {"quran": "Those who reject will have a painful retribution, and those who believe and do good works they will have a forgiveness and a great reward.", "verse": 7, "surah": 35}, {"quran": "As for he whose evil work is adorned for him so he sees it as being good; for God thus misguides whom He wills, and He guides whom He wills. So do not let yourself grieve over them. God is fully aware of what they are doing.", "verse": 8, "surah": 35}, {"quran": "And God is the One who sends the winds so it stirs up a cloud, then We drive it to a land that is dead, and We revive with it the earth after it had died. Such is the resurrection.", "verse": 9, "surah": 35}, {"quran": "Whoever is seeking dignity, then know that to God belongs all dignity. To Him ascend the good words, and the good deeds raise them up. And as for those who scheme evil, they will have a painful retribution, and their scheming will fail.", "verse": 10, "surah": 35}, {"quran": "And God created you from dust, then from a seed, then He made you into pairs. And no female becomes pregnant, nor gives birth, without His knowledge. Nor does anyone have his life extended, or his life is shortened, except in a record. This is easy for God.", "verse": 11, "surah": 35}, {"quran": "Nor are the two seas the same. One is fresh and palatable, good to drink, while the other is salty and bitter. And from each of them you eat tender meat, and you extract jewelry to wear. And you see the ships sailing through them, seeking His provisions; and perhaps you may be thankful.", "verse": 12, "surah": 35}, {"quran": "He merges the night into the day, and He merges the day into the night. And He has commissioned the sun and the moon, each running for an appointed term. Such is God your Lord; to Him is the sovereignty. And as for those whom you pray to besides Him, they do not possess even the shell of a seed.", "verse": 13, "surah": 35}, {"quran": "If you pray to them, they cannot hear you. And even if they hear you, they cannot respond to you. And on the Day of Resurrection, they will reject your partnership. And none can inform you like an Expert.", "verse": 14, "surah": 35}, {"quran": "O people, you are the poor when it comes to God, while God is the Rich, the Praiseworthy.", "verse": 15, "surah": 35}, {"quran": "If He wishes, He could do away with you and He would bring a new creation.", "verse": 16, "surah": 35}, {"quran": "And this is not difficult for God.", "verse": 17, "surah": 35}, {"quran": "And none can carry the load of another; and even if it calls on another to bear part of its load, no other can carry any part of it, even if they were related. You will only be able to warn those who are concerned towards their Lord while unseen, and they hold the contact prayer. And whoever contributes, is contributing for himself. And to God is the final destiny.", "verse": 18, "surah": 35}, {"quran": "The blind and the seer are not equal.", "verse": 19, "surah": 35}, {"quran": "Nor are the darkness and the light.", "verse": 20, "surah": 35}, {"quran": "Nor are the shade and the heat.", "verse": 21, "surah": 35}, {"quran": "Nor equal are the living and the dead; God causes whoever He wills to hear; and you cannot make those who are in the graves hear.", "verse": 22, "surah": 35}, {"quran": "You are but a warner.", "verse": 23, "surah": 35}, {"quran": "We have sent you with the truth as a bearer of good news and a warner. There was not a nation that a warner did not come to it.", "verse": 24, "surah": 35}, {"quran": "And if they deny you, then those before them have also denied. Their messengers went to them with the proofs and the scriptures and the Book of Enlightenment.", "verse": 25, "surah": 35}, {"quran": "Then I seized those who rejected; so how was My retribution!", "verse": 26, "surah": 35}, {"quran": "Do you not see that God sends down water from the sky, thus We produce with it fruits of various colors? And of the mountains are peaks that are white, red, or some other color and intense black.", "verse": 27, "surah": 35}, {"quran": "And from the people, and the animals, and the livestock, are various colors. Those concerned with God from among His servants are the most knowledgeable. God is Noble, Forgiving.", "verse": 28, "surah": 35}, {"quran": "Surely, those who recite the Book of God and hold the contact prayer, and spend secretly and openly from what We have provided them, they are seeking a trade that can never lose.", "verse": 29, "surah": 35}, {"quran": "He will give them their recompense, and He will increase them from His blessings. He is Forgiving, Thankful.", "verse": 30, "surah": 35}, {"quran": "And what We inspired to you from the Book, it is the truth, authenticating what is between his hands. God is Expert over His servants, Seer.", "verse": 31, "surah": 35}, {"quran": "Then We inherited the Book to those whom We selected from Our servants. Subsequently, some of them wronged themselves, and others upheld it partly, while others were eager to work righteousness in accordance with the will of God; such is the great benefit.", "verse": 32, "surah": 35}, {"quran": "They will enter gardens of delight, where they will be adorned with bracelets of gold and pearls, and their garments in it will be of silk.", "verse": 33, "surah": 35}, {"quran": "And they will say: \"Praise be to God who took away our sorrow. Our Lord is Forgiving, Thankful.\"", "verse": 34, "surah": 35}, {"quran": "\"The One who admitted us into the abode of eternal bliss, out of His grace. In it, no boredom touches us, nor does any fatigue.\"", "verse": 35, "surah": 35}, {"quran": "As for those who have rejected, for them is the fire of Hell, where they do not terminate and die, nor is its retribution ever reduced for them. It is such that We requite every rejecter.", "verse": 36, "surah": 35}, {"quran": "And they will scream in it: \"Our Lord, let us out, and we will work righteousness instead of the works we used to do.\" Did We not give you a long life so that he who would remember would take heed, and a warner came to you? Therefore, taste, for the transgressors will have no supporter.", "verse": 37, "surah": 35}, {"quran": "God knows the unseen of the heavens and the earth. He is knowledgeable of what is even in the chests.", "verse": 38, "surah": 35}, {"quran": "He is the One who made you successors on the earth. So, whoever rejects, then to him is his rejection. And the rejection of the rejecters only increases the abhorrence of their Lord towards them. The rejection of the rejecters only increases their loss.", "verse": 39, "surah": 35}, {"quran": "Say: \"Do you see the partners whom you have called on besides God? Show me what they have created on the earth. Or do they possess any partnership in the heavens? Or have We given them a book wherein they are taking knowledge from it? Indeed, what the transgressors promise one another is no more than arrogance.\"", "verse": 40, "surah": 35}, {"quran": "God is the One who holds the heavens and the earth, lest they cease to exist. And they would certainly cease to exist if anyone else were to hold them after Him. He is Compassionate, Forgiving.", "verse": 41, "surah": 35}, {"quran": "And they swore by God in their strongest oaths, that if a warner came to them, they would be the most guided of all nations, but when a warner came to them, it only increased their aversion!", "verse": 42, "surah": 35}, {"quran": "Arrogance on the earth, and evil scheming. And the evil schemes only backfire on those who scheme them. Were they expecting anything different from the ways used on the people of the past? You will not find any change in the way of God, and you will not find any bypass to the way of God.", "verse": 43, "surah": 35}, {"quran": "Did they not roam the earth and note how was the consequence for those who were before them? And they were even more powerful than they in strength. But nothing can inhibit God be it in the heavens, or the earth. He is Knowledgeable, Omnipotent.", "verse": 44, "surah": 35}, {"quran": "And if God were to punish the people for what they have earned, He would not leave a single creature standing. But He delays them to an appointed term. So, when their time comes, then God is Seer of His servants.", "verse": 45, "surah": 35}]]