[[{"quran": "In the name of God, the Almighty, the Merciful.", "verse": 0, "surah": 27}, {"quran": "T'S, these are the signs of the Qur'an and a clear Book.", "verse": 1, "surah": 27}, {"quran": "A guide and good news to the believers.", "verse": 2, "surah": 27}, {"quran": "Those who hold the contact prayer, and contribute towards purification, and regarding the Hereafter they are certain.", "verse": 3, "surah": 27}, {"quran": "As for those who do not believe in the Hereafter, We have made their work appear pleasing to them, so they walk around blind.", "verse": 4, "surah": 27}, {"quran": "They will have the worst retribution, and in the Hereafter they are the biggest losers.", "verse": 5, "surah": 27}, {"quran": "And you are receiving the Qur'an from One who is Wise, Knowledgeable.", "verse": 6, "surah": 27}, {"quran": "And Moses said to his family: \"I have seen a fire, I will bring you from there some news or I will bring you a burning piece so that you may be warmed.\"", "verse": 7, "surah": 27}, {"quran": "So when he came to it he was called: \"Blessed is the One at the fire and whoever is around it, and glory to God, Lord of the worlds.\"", "verse": 8, "surah": 27}, {"quran": "\"O Moses, it is I God, the Noble, the Wise.\"", "verse": 9, "surah": 27}, {"quran": "\"And cast down your staff.\" So when he saw it vibrate as if it were a Jinn, he ran away and would not turn back. \"O Moses, do not fear, for My messengers shall have no fear from Me.\"", "verse": 10, "surah": 27}, {"quran": "\"Except he who has done wrong. But then if he replaces the evil deed with good, then I am Forgiving, Merciful.\"", "verse": 11, "surah": 27}, {"quran": "\"And place your hand into your pocket; it will come out white with no blemish, one of nine signs to Pharaoh and his people; for they are a wicked people.\"", "verse": 12, "surah": 27}, {"quran": "So when Our signs came to them for all to see, they said: \"This is clearly magic!\"", "verse": 13, "surah": 27}, {"quran": "And they rejected them, while their souls knew, out of transgression and arrogance. So see how it ended for the wicked.", "verse": 14, "surah": 27}, {"quran": "And We bestowed upon David and Solomon knowledge, and they both said: \"Praise be to God who preferred us over many of His believing servants.\"", "verse": 15, "surah": 27}, {"quran": "And Solomon inherited from David, and he said: \"O people, we have been taught how to understand the speech of the creatures that fly, and we have been given from everything. This is indeed an evident grace.\"", "verse": 16, "surah": 27}, {"quran": "And the soldiers of Solomon were gathered, comprising of mankind and Jinn and birds, for they were to be spread out.", "verse": 17, "surah": 27}, {"quran": "Until they came to a valley of ants, a female ant said: \"O ants, enter your homes else you will be crushed by Solomon and his soldiers while they do not notice.\"", "verse": 18, "surah": 27}, {"quran": "He then smiled, amused by what she said. And he said: \"My Lord, help me to be thankful for the blessings You have bestowed upon me and upon my parents, and that I may do good works that please You, and admit me by Your mercy with Your righteous servants.\"", "verse": 19, "surah": 27}, {"quran": "And he inspected the birds, then said: \"Why do I not see the hoopoe, or is he among those absent?\"", "verse": 20, "surah": 27}, {"quran": "\"I will punish him severely, or I will kill him, else he should have a clear excuse.\"", "verse": 21, "surah": 27}, {"quran": "But the hoopoe did not stay away long, then he said: \"I have seen what you do not know, and I have come to you from Sheba with news which is certain.\"", "verse": 22, "surah": 27}, {"quran": "\"I found them ruled by a woman, and she was given all possessions, and she had a great throne.\"", "verse": 23, "surah": 27}, {"quran": "\"And I found her and her people prostrating to the sun instead of God! And the devil had made their works appear good to them, so he kept them away from the path, for they are not being guided.\"", "verse": 24, "surah": 27}, {"quran": "\"Will they not prostrate to God who brings out what is hidden in the heavens and the earth, and He knows what you hide and what you declare?\"", "verse": 25, "surah": 27}, {"quran": "\"God, there is no god except He, the Lord of the supreme Throne.\"", "verse": 26, "surah": 27}, {"quran": "He said: \"We will see if you are being truthful or are one of those who lie.\"", "verse": 27, "surah": 27}, {"quran": "\"Take this letter of mine and cast it to them, then withdraw from them and observe what they respond with.\"", "verse": 28, "surah": 27}, {"quran": "She said: \"O commanders, a noble letter has been delivered to me.\"", "verse": 29, "surah": 27}, {"quran": "\"It is from Solomon, and it reads: 'In the name of God, the Almighty, the Merciful'\"", "verse": 30, "surah": 27}, {"quran": "\"'Do not be arrogant towards me and come to me as submitters'\"", "verse": 31, "surah": 27}, {"quran": "She said: \"O commanders, advise me in this matter of mine, for I will not take a decision until you give testimony.\"", "verse": 32, "surah": 27}, {"quran": "They said: \"We are a people of strength and mighty in power. But the decision is yours, so see what you will command.\"", "verse": 33, "surah": 27}, {"quran": "She said: \"When the kings enter a town they destroy it and make its most noble people humiliated. It is such that they do.\"", "verse": 34, "surah": 27}, {"quran": "\"And I will send to them a gift, then I will see with what the messengers will return.\"", "verse": 35, "surah": 27}, {"quran": "So when they came to Solomon he said: \"Are you providing me with wealth? What God has provided for me is far better than what He has given you. Now you are happy with your gift!\"", "verse": 36, "surah": 27}, {"quran": "\"Go back to them. For we shall come to them with soldiers the like of which they have never seen, and we will drive them out humiliated, while they are feeble.\"", "verse": 37, "surah": 27}, {"quran": "He said: \"O commanders, which of you can bring me her throne before they come to me in submission?\"", "verse": 38, "surah": 27}, {"quran": "A powerful being from among the Jinn said: \"I will bring it to you before you rise from your station. For I am strong and trustworthy.\"", "verse": 39, "surah": 27}, {"quran": "And one who had knowledge from the Book said: \"I will bring it to you before you blink.\" So when he saw it resting before him, he said: \"This is from the grace of my Lord, so that He tests me whether I am thankful or whether I reject. As for he who is thankful, he is thankful for himself, and as for he who rejects, then my Lord is Rich, Bountiful.\"", "verse": 40, "surah": 27}, {"quran": "He said: \"Disguise her throne so we may see if she will be guided or if she will be of those who are not guided.\"", "verse": 41, "surah": 27}, {"quran": "So when she came, it was said: \"Is your throne like this?\" She said: \"It appears to be similar.\" \"And we were given knowledge before her, and we had submitted.\"", "verse": 42, "surah": 27}, {"quran": "And she was prevented by that which she served besides God. She was of the people who were rejecters.", "verse": 43, "surah": 27}, {"quran": "It was said to her: \"Enter the palace.\" So when she saw it she thought there was a pool, and she uncovered her legs. He said: \"It is a palace paved with crystal.\" She said: \"My Lord, I have wronged myself; and I submit with Solomon to God, Lord of the worlds.\"", "verse": 44, "surah": 27}, {"quran": "And We have sent to Thamud their brother Saleh: \"You shall serve God.\" But they became two disputing groups.", "verse": 45, "surah": 27}, {"quran": "He said: \"My people, why do you hasten with evil ahead of good? If you would only seek the forgiveness of God, perhaps you will receive mercy.\"", "verse": 46, "surah": 27}, {"quran": "They said: \"You have an ill omen with you and those with you.\" He said: \"Your ill omen is with God, but you are a people who are being tested.\"", "verse": 47, "surah": 27}, {"quran": "And in the city were nine ruffians who were causing corruption in the land, and they were not reforming.", "verse": 48, "surah": 27}, {"quran": "They said: \"Swear by God to one another that we will attack him and his family at night, and we will then say to his supporters: 'We did not witness who murdered his family, and we are being truthful'\"", "verse": 49, "surah": 27}, {"quran": "And they schemed a scheme and We schemed a scheme, while they did not notice.", "verse": 50, "surah": 27}, {"quran": "So see what the result of their planning was! We destroyed them and their people together.", "verse": 51, "surah": 27}, {"quran": "So these are their homes, ruined, for what they transgressed. In that is a sign for a people who know.", "verse": 52, "surah": 27}, {"quran": "And We saved those who believed and were righteous.", "verse": 53, "surah": 27}, {"quran": "And Lot, when he said to his people: \"Why do you commit immorality when you can clearly see?\"", "verse": 54, "surah": 27}, {"quran": "\"You are approaching the men out of desire instead of the women! Indeed, you are an ignorant people.\"", "verse": 55, "surah": 27}, {"quran": "But the reply of his people was that they said: \"Expel the family of Lot from your town, for they are a people who are being pure!\"", "verse": 56, "surah": 27}, {"quran": "So We saved him and his family, except for his wife; We found her to be of those doomed.", "verse": 57, "surah": 27}, {"quran": "And We rained down a rain upon them. Miserable was the rain of those warned.", "verse": 58, "surah": 27}, {"quran": "Say: \"Praise be to God, and peace be upon His servants whom He has selected.\" Is God better, or that which you set up?", "verse": 59, "surah": 27}, {"quran": "The One who has created the heavens and the earth, and He sent down water from the sky for you, so We cause gardens to grow with it that are full of beauty. It is not your ability that causes the growth of its trees. Is there a god with God? No. But they are a people who ascribe equals!", "verse": 60, "surah": 27}, {"quran": "The One who made the earth a habitat, and He made in it rivers and He made for it stabilizers, and He made between the two seas a barrier. Is there a god with God? No. But most of them do not know.", "verse": 61, "surah": 27}, {"quran": "The One who answers the distressed when he calls Him, and He removes the evil, and He makes you successors on the earth. Is there a god with God? Little do you remember!", "verse": 62, "surah": 27}, {"quran": "The One who guides you in the darkness of the land and the sea, and He sends the winds to spread between the hands of His mercy. Is there a god with God? God be exalted above what they set up!", "verse": 63, "surah": 27}, {"quran": "The One who initiates the creation then He returns it, and He provides for you from the sky and the land. Is there a god with God? Say: \"Bring your proof if you are being truthful.\"", "verse": 64, "surah": 27}, {"quran": "Say: \"None in the heavens or the earth know the unseen except God. And they do not perceive when they will be resurrected.\"", "verse": 65, "surah": 27}, {"quran": "No, they have no knowledge of the Hereafter. No, they are in doubt regarding it. No, they are blind to it.", "verse": 66, "surah": 27}, {"quran": "And those who rejected said: \"When we have become dust, as our fathers, shall we be brought out?\"", "verse": 67, "surah": 27}, {"quran": "\"We have been promised this, both us and our fathers before. This is nothing except fictional tales of old!\"", "verse": 68, "surah": 27}, {"quran": "Say: \"Roam the earth and see how was the end of the criminals.\"", "verse": 69, "surah": 27}, {"quran": "And do not be saddened for them, and do not be distraught for what they plot.", "verse": 70, "surah": 27}, {"quran": "And they say: \"When is this promise if you are truthful?\"", "verse": 71, "surah": 27}, {"quran": "Say: \"Perhaps He is now sending your way some of that which you hasten.\"", "verse": 72, "surah": 27}, {"quran": "And your Lord has given grace to the people, but most of them are not thankful.", "verse": 73, "surah": 27}, {"quran": "And your Lord knows what is concealed in their chests and what they reveal.", "verse": 74, "surah": 27}, {"quran": "And there is not a thing hidden in the heavens or the earth, but is in a clear record.", "verse": 75, "surah": 27}, {"quran": "This Qur'an tells to the Children of Israel most of that which they are in dispute over.", "verse": 76, "surah": 27}, {"quran": "And it is a guidance and a mercy for the believers.", "verse": 77, "surah": 27}, {"quran": "Your Lord decides between them by His judgment. And He is the Noble, the Knowledgeable.", "verse": 78, "surah": 27}, {"quran": "So put your trust in God, for you are clearly on the truth.", "verse": 79, "surah": 27}, {"quran": "You cannot make the dead hear, nor can you make the deaf hear the call when they turn their backs and flee.", "verse": 80, "surah": 27}, {"quran": "Nor can you guide the blind from their misguidance. You can only make those who believe in Our revelations hear you, for they have submitted.", "verse": 81, "surah": 27}, {"quran": "And when the punishment has been deserved by them, We will bring out for them a creature from the earth, it will speak to them that the people have been unaware regarding Our revelations.", "verse": 82, "surah": 27}, {"quran": "And the Day We gather from every nation a party that denied Our revelations, then they will be driven.", "verse": 83, "surah": 27}, {"quran": "Then, when they have come, He will say: \"Have you denied My revelations while you had no explicit knowledge of them? What were you doing?\"", "verse": 84, "surah": 27}, {"quran": "And the punishment was deserved by them for what they transgressed; they shall not speak.", "verse": 85, "surah": 27}, {"quran": "Did they not see that We made the night for them to reside in, and the day to see in? In that are signs for a people who have faith.", "verse": 86, "surah": 27}, {"quran": "And on the Day when the horn is blown, then those in the heavens and the earth will be horrified, except for whom God wills. And all shall come to Him humbled.", "verse": 87, "surah": 27}, {"quran": "And you see the mountains, you think they are solid, while they are passing by like the clouds. The making of God who perfected everything. He is Expert over what you do.", "verse": 88, "surah": 27}, {"quran": "Whoever comes with a good deed will receive better than it, and from the terror of that Day they will be safe.", "verse": 89, "surah": 27}, {"quran": "And whoever comes with the bad deed, their faces will be cast in Hell. Are you not being rewarded for what you used to do?", "verse": 90, "surah": 27}, {"quran": "\"I have been ordered to serve the Lord of this land, that He has restricted, and to Him are all things, and I have been ordered to be of those who submit.\"", "verse": 91, "surah": 27}, {"quran": "\"And that I recite the Qur'an.\" He who is guided is guided for himself, and to he who is misguided, say: \"I am but one of the warners.\"", "verse": 92, "surah": 27}, {"quran": "Say: \"Praise be to God, He will show you His signs and you will know them. And your Lord is not unaware of what you do.\"", "verse": 93, "surah": 27}]]