[[{"quran": "In the name of God, the Almighty, the Merciful.", "verse": 0, "surah": 13}, {"quran": "ALMR, these are the signs of the Book. And what has been sent down to you from your Lord is the truth; but most of the people do not believe.", "verse": 1, "surah": 13}, {"quran": "God, Who raised the heavens without any pillars that you can see, then He settled upon the Throne, and He commissioned the sun and the moon, each running for an appointed term. He manages all affairs, and He details the signs so that you will be aware of the meeting with your Lord.", "verse": 2, "surah": 13}, {"quran": "And He is the One who has spread out the land, and made in it stabilizers and rivers, and all the fruits He made in pairs. The night covers the day. In that are signs for a people who think.", "verse": 3, "surah": 13}, {"quran": "And on the earth are neighboring pieces of land with gardens of grapes and plants and palm trees, some of which may be twin sharing the same root, or single, even though they are being watered with the same water source; and We make preference for some of them over others in what they consume. In that are signs for a people who comprehend.", "verse": 4, "surah": 13}, {"quran": "And if you are surprised, then what is more surprising is their saying: \"Can it be that when we are dust, we will be created anew!\" These are the ones who have rejected their Lord, and they will have shackles around their necks, and they are the dwellers of the Fire, in it they will abide.", "verse": 5, "surah": 13}, {"quran": "And they hasten towards you with evil before good, and the examples of those before them have already been given. And your Lord is with forgiveness towards the people for their transgression, and your Lord is severe in retribution.", "verse": 6, "surah": 13}, {"quran": "And those who reject say: \"If only a sign was sent down to him from his Lord.\" You are but a warner, and to every people is a guide.", "verse": 7, "surah": 13}, {"quran": "God knows what every female carries, and how short her pregnancy is or how long. And everything with Him is measured.", "verse": 8, "surah": 13}, {"quran": "The Knower of the unseen and the seen, the Great, the Most High.", "verse": 9, "surah": 13}, {"quran": "It is the same whether any of you openly declares what he says, or conceals it; whether he is hiding in the night or going openly in the day.", "verse": 10, "surah": 13}, {"quran": "Present with him and behind him are retainers, they preserve him from the command of God. God does not change the condition of a people until they change the condition of their souls. And if God wanted to harm a people, then there is no turning Him back, nor will they have any protector against Him.", "verse": 11, "surah": 13}, {"quran": "He is the One who shows you the lightning, giving you fear and hope. And He establishes the heavy clouds.", "verse": 12, "surah": 13}, {"quran": "And the thunder glorifies His praise, and the angels are in awe of Him, and He sends the thunderbolts to strike with them whom He wills. Yet they are still arguing regarding God, while He is severe in punishment.", "verse": 13, "surah": 13}, {"quran": "To Him is the call of truth. And those who are called on besides Him, they will not respond to them in anything; like one who places his hands openly in the water to drink, except it never reaches his mouth. The call of the rejecters is nothing but in misguidance.", "verse": 14, "surah": 13}, {"quran": "And to God will prostrate all who are in the heavens and the earth, willingly and unwillingly, as do their shadows in the morning and the evening.", "verse": 15, "surah": 13}, {"quran": "Say: \"Who is the Lord of the heavens and the earth?\" Say: \"God.\" Say: \"Have you taken besides Him allies who do not possess for themselves any benefit or harm?\" Say: \"Is the blind and the seer the same? Or do the darkness and the light equate? Or have they set up partners with God who have created like His creation, so the creations all seemed the same to them?\" Say: \"God has created all things, and He is the One, the Supreme.\"", "verse": 16, "surah": 13}, {"quran": "He sends down water from the sky, so valleys flow according to their capacity, and the flood produces foam. And from what they burn to smelt jewelry or goods is produced a similar foam. It is in such a manner that God strikes the falsehood with the truth. As for the foam, it passes away, and as for what benefits the people, it remains in the earth. It is such that God puts forth the examples.", "verse": 17, "surah": 13}, {"quran": "For those who have responded to their Lord is goodness. As for those who have not responded to Him, if they had all that is on the earth twice over, they would ransom it to be saved. For these will be a terrible reckoning, and their abode is Hell; what a miserable abode.", "verse": 18, "surah": 13}, {"quran": "Is he who knows that the truth has been sent down to you from your Lord like he who is blind? Only those who possess intelligence will remember.", "verse": 19, "surah": 13}, {"quran": "Those who fulfill the pledge of God, and they do not break the covenant.", "verse": 20, "surah": 13}, {"quran": "And those who deliver what God has ordered to be delivered, and they are concerned towards their Lord and they fear a terrible reckoning.", "verse": 21, "surah": 13}, {"quran": "And those who are patient seeking the face of their Lord; and they hold the contact prayer, and they spend from what We have bestowed upon them secretly and openly, and they counter evil with good; these will have an excellent abode.", "verse": 22, "surah": 13}, {"quran": "The gardens of delight; which they will enter with those who are good doers from their fathers and their mates and their progeny. And the angels will enter upon them from every gate.", "verse": 23, "surah": 13}, {"quran": "\"Peace be upon you for what you have been patient for. Excellent indeed is the final abode.\"", "verse": 24, "surah": 13}, {"quran": "As for those who break their pledge with God after having made its covenant, and they withhold what God has ordered to be delivered, and they cause corruption on the earth; upon those is a curse and they will have a miserable abode.", "verse": 25, "surah": 13}, {"quran": "God gives the provisions for whom He wishes, and He is Capable. And they were happy with the worldly life, but the worldly life compared to the Hereafter is nothing except a brief enjoyment.", "verse": 26, "surah": 13}, {"quran": "And those who have rejected say: \"If only a sign were sent down to him from his Lord!\" Say: \"God misguides whom He wishes and guides to Him whoever is repenting.\"", "verse": 27, "surah": 13}, {"quran": "The ones who have believed, and their hearts are relieved by the remembrance of God; for in the remembrance of God the hearts are relieved.", "verse": 28, "surah": 13}, {"quran": "The ones who have believed, and have done good works, there will be happiness for them and a wonderful abode.", "verse": 29, "surah": 13}, {"quran": "Thus, We have sent you to a nation, as with other nations before it, so that you may recite to them that which has been inspired to you; while they are still rejecting the Almighty. Say: \"He is my Lord, there is no god except He, in Him I place my trust and to Him is my repentance.\"", "verse": 30, "surah": 13}, {"quran": "And if a revelation were to be used to move mountains, or to slice the earth, or the dead were spoken to with it! Indeed, to God are all matters. Did not those who have believed know that if God had wished He would have guided all the people? As for those who reject, they continue to be stricken with disaster or it comes near to their homes, until the promise of God comes true. God does not break the appointment.", "verse": 31, "surah": 13}, {"quran": "And messengers before you were mocked, but I gave time to those who had rejected, then I took them; so how was My punishment?", "verse": 32, "surah": 13}, {"quran": "It is He who is standing upon every soul for what it has earned; yet they set up partners with God. Say: \"Name them?\" Or are you informing Him of what He does not know on the earth or is it just a show of words? Indeed, to the rejecters, their scheming is made to appear pleasing, and they are repelled from the path. And whoever God misguides will have no guide.", "verse": 33, "surah": 13}, {"quran": "They will have a punishment in the worldly life, and the punishment of the Hereafter is more difficult. And they will have no defender against God.", "verse": 34, "surah": 13}, {"quran": "The example of Paradise which the righteous are promised, is that rivers flow beneath it, and its provisions are continuous as is its shade. Such is the abode of those who were righteous, while the abode of the rejecters is the Fire.", "verse": 35, "surah": 13}, {"quran": "And those to whom We have previously given the Book rejoice at what has been sent down to you, but there are some from the Confederates who reject parts of it. Say: \"I am only ordered to serve God and not set up any partner with Him. Towards Him I implore and towards Him is the return.\"", "verse": 36, "surah": 13}, {"quran": "And as such, We have sent it down a law which is in Arabic. And if you follow their desires after what has come to you of the knowledge, then you will not have any ally or defender against God.", "verse": 37, "surah": 13}, {"quran": "And We have sent messengers before you and We have made for them mates and offspring. It was not for a messenger to come with any sign except with the permission of God; for each period there is a Book.", "verse": 38, "surah": 13}, {"quran": "God erases and confirms what He wishes, and with Him is the source of the Book.", "verse": 39, "surah": 13}, {"quran": "And if We show you some of what We promise them, or We terminate your life, then you are only to deliver while for Us is the reckoning.", "verse": 40, "surah": 13}, {"quran": "Do they not see that We come to the land and reduce it from its ends? And God gives judgment and there is none to override His judgment. And He is swift to reckoning.", "verse": 41, "surah": 13}, {"quran": "And those before them had schemed, but to God is all scheming. He knows what every soul earns and the rejecters will come to know to whom is the better abode.", "verse": 42, "surah": 13}, {"quran": "And those who reject say: \"You are not a messenger.\" Say: \"God is enough as a witness between me and you; the One who has the knowledge of the Book.\"", "verse": 43, "surah": 13}]]