[[{"quran": "In the name of God, the Almighty, the Merciful.", "verse": 0, "surah": 62}, {"quran": "Glorifying God is everything in the heavens and everything on the earth; the King, the Holy, the Noble, the Wise.", "verse": 1, "surah": 62}, {"quran": "He is the One who sent to the Gentiles a messenger from among themselves, to recite to them His revelations, and to purify them, and teach them the Book and the wisdom. And before this, they were clearly astray.", "verse": 2, "surah": 62}, {"quran": "And to other generations subsequent to them. He is the Noble, the Wise.", "verse": 3, "surah": 62}, {"quran": "Such is the grace of God, which He bestows upon whoever He wills. God is Possessor of Infinite Grace.", "verse": 4, "surah": 62}, {"quran": "The example of those who were given the Torah, but then failed to uphold it, is like the donkey that is carrying a cargo of books. Miserable indeed is the example of the people who denied the revelations of God. And God does not guide the wicked people.", "verse": 5, "surah": 62}, {"quran": "Say: \"O you who are Jewish, if you claim that you are the chosen of God, to the exclusion of all other people, then you should long for death if you are truthful!\"", "verse": 6, "surah": 62}, {"quran": "But they will never long for it, because of what their hands have delivered. God is fully aware of the wicked.", "verse": 7, "surah": 62}, {"quran": "Say: \"The death that you are fleeing from, it will come to find you. Then you will be returned to the Knower of all secrets and declarations, then He will inform you of everything you had done.\"", "verse": 8, "surah": 62}, {"quran": "O you who believe, if the contact prayer is called to during the day of Congregation, then you shall hasten towards the remembrance of God, and cease all selling. This is better for you, if only you knew.", "verse": 9, "surah": 62}, {"quran": "Then, once the contact prayer is complete, you shall disperse through the land and seek the provisions of God, and remember God frequently that you may succeed.", "verse": 10, "surah": 62}, {"quran": "And if they come across any trade, or some entertainment, they rush to it and leave you standing! Say: \"What God possesses is far better than entertainment or trade. And God is the best Provider.\"", "verse": 11, "surah": 62}]]