[[{"quran": "In the name of God, the Almighty, the Merciful.", "verse": 0, "surah": 43}, {"quran": "HM.", "verse": 1, "surah": 43}, {"quran": "And the clarifying Book.", "verse": 2, "surah": 43}, {"quran": "We have made it an Arabic revelation, perhaps you may comprehend.", "verse": 3, "surah": 43}, {"quran": "And it is held honorable and wise in the master record with Us.", "verse": 4, "surah": 43}, {"quran": "Shall We turn away the Reminder from you, because you are a transgressing people?", "verse": 5, "surah": 43}, {"quran": "And how many a prophet did We send to the previous generations!", "verse": 6, "surah": 43}, {"quran": "And every time a prophet went to them, they mocked him.", "verse": 7, "surah": 43}, {"quran": "We have destroyed those who were even more powerful than these, and the example of the previous generations has already been given.", "verse": 8, "surah": 43}, {"quran": "And if you asked them: \"Who has created the heavens and the earth?\" They will say: \"They were created by the One who is the Noble, the Knowledgeable.\"", "verse": 9, "surah": 43}, {"quran": "He is the One who made the earth a habitat for you, and He made paths in it that you may be guided.", "verse": 10, "surah": 43}, {"quran": "And He is the One who sends down water from the sky, in exact measure. We then revive with it a dead land. Similarly, you will be brought out.", "verse": 11, "surah": 43}, {"quran": "And He is the One who has created all the pairs, and He made for you of the ships and the livestock that which you can ride.", "verse": 12, "surah": 43}, {"quran": "So that you may settle on their backs; then recall the blessing of your Lord once you have settled on them, and say: \"Glory to the One who has committed this for us, and we could not have done so by ourselves.\"", "verse": 13, "surah": 43}, {"quran": "\"And we will ultimately return to our Lord.\"", "verse": 14, "surah": 43}, {"quran": "And they assigned a share to Him from His own servants! The human being is clearly denying.", "verse": 15, "surah": 43}, {"quran": "Or has He selected daughters from among His creation, while He has left you with the sons?", "verse": 16, "surah": 43}, {"quran": "And if one of them is given news of that which he puts forth as an example for the Almighty, his face becomes dark, and he is miserable!", "verse": 17, "surah": 43}, {"quran": "\"What good is an offspring that is brought up to be beautiful, and cannot help in a fight?\"", "verse": 18, "surah": 43}, {"quran": "And they have claimed the angels who are with the Almighty are females! Have they been made witness to their creation? We will record their testimony, and they will be asked.", "verse": 19, "surah": 43}, {"quran": "And they said: \"If the Almighty had willed, we would not have worshipped them.\" They have no knowledge of this; they only conjecture.", "verse": 20, "surah": 43}, {"quran": "Or have We given them a book before this which they are upholding?", "verse": 21, "surah": 43}, {"quran": "The fact is, they have said: \"We found our fathers following a certain way, and we are following in their footsteps.\"", "verse": 22, "surah": 43}, {"quran": "And similarly, We did not send a warner to a town, except its carefree ones said: \"We found our fathers following a certain way, and we are being guided in their footsteps.\"", "verse": 23, "surah": 43}, {"quran": "He said: \"What if I brought to you better a guidance than what you found your fathers upon?\" They said: \"We are disbelievers in that with which you have been sent.\"", "verse": 24, "surah": 43}, {"quran": "Consequently, We took revenge upon them. So see how was the consequences of the deniers.", "verse": 25, "surah": 43}, {"quran": "And when Abraham said to his father and his people: \"I am innocent of that which you worship.\"", "verse": 26, "surah": 43}, {"quran": "\"Except for the One who initiated me, He will guide me.\"", "verse": 27, "surah": 43}, {"quran": "And he made it a word to last in his subsequent generations; perhaps they may turn back.", "verse": 28, "surah": 43}, {"quran": "Indeed, I have given these people and their fathers to enjoy, until the truth came to them, and a clarifying messenger.", "verse": 29, "surah": 43}, {"quran": "And when the truth came to them, they said: \"This is magic, and we reject it.\"", "verse": 30, "surah": 43}, {"quran": "And they said: \"If only this Qur'an was sent down to a man of greatness from the two towns!\"", "verse": 31, "surah": 43}, {"quran": "Is it they who assign the mercy of your Lord? We have assigned their share in this worldly life, and We raised some of them above others in ranks, so that they would take one another in service. The mercy from your Lord is far better than that which they amass.", "verse": 32, "surah": 43}, {"quran": "And were it not that all the people would become one nation, We would have provided for those who reject the Almighty silver roofs for their homes, and stairs upon which they could ascend.", "verse": 33, "surah": 43}, {"quran": "And for their homes, gates, and beds on which they could recline.", "verse": 34, "surah": 43}, {"quran": "And many ornaments. All these are the pleasures of this worldly life. And the Hereafter with your Lord is for the righteous.", "verse": 35, "surah": 43}, {"quran": "And whoever turns away from the remembrance of the Almighty, We appoint a devil to be his associate.", "verse": 36, "surah": 43}, {"quran": "And they hinder from the path, but they think they are guided!", "verse": 37, "surah": 43}, {"quran": "Until he comes to Us, he will say, \"Oh, I wish that between you and me was the distance of the two easts. What a miserable associate!\"", "verse": 38, "surah": 43}, {"quran": "It would not benefit you this Day, for you have transgressed; you are partners in the retribution.", "verse": 39, "surah": 43}, {"quran": "Can you make the deaf hear, or can you guide the blind and those who are far astray?", "verse": 40, "surah": 43}, {"quran": "So if We take you away, We may then seek revenge on them.", "verse": 41, "surah": 43}, {"quran": "Or We may show you that which We promised for them; for We are able to take them.", "verse": 42, "surah": 43}, {"quran": "You shall hold on to that which is inspired to you; for you are on a straight path.", "verse": 43, "surah": 43}, {"quran": "And this is indeed a reminder for you and your people; and you will all be questioned.", "verse": 44, "surah": 43}, {"quran": "And ask those of Our messengers whom We sent before you: \"Did We ever appoint gods besides the Almighty to be served?\"", "verse": 45, "surah": 43}, {"quran": "And We sent Moses with Our signs to Pharaoh and his commanders; so he said: \"I am a messenger of the Lord of the worlds.\"", "verse": 46, "surah": 43}, {"quran": "But when he came to them with Our signs, they laughed at them.", "verse": 47, "surah": 43}, {"quran": "And every sign We showed them was greater than the one before it, and We seized them with the torment, perhaps they would return.", "verse": 48, "surah": 43}, {"quran": "And they said: \"O you magician, call on your Lord for what pledge He gave you; we will then be guided.\"", "verse": 49, "surah": 43}, {"quran": "But when We removed the torment from them, they broke their word.", "verse": 50, "surah": 43}, {"quran": "And Pharaoh proclaimed among his people: \"O my people, do I not possess the kingship of Egypt, and these rivers that flow below me? Do you not see?\"", "verse": 51, "surah": 43}, {"quran": "\"Am I not better than this one who is despised and he can barely be understood?\"", "verse": 52, "surah": 43}, {"quran": "\"Why then are not golden bracelets bestowed on him, or the angels are accompanying him?\"", "verse": 53, "surah": 43}, {"quran": "He thus convinced his people, and they obeyed him; they were a wicked people.", "verse": 54, "surah": 43}, {"quran": "So when they persisted in opposing Us, We sought revenge from them, and drowned them all.", "verse": 55, "surah": 43}, {"quran": "We thus made them a thing of the past, and an example for the others.", "verse": 56, "surah": 43}, {"quran": "And when the son of Mary was put forth as an example, your people turned away from it.", "verse": 57, "surah": 43}, {"quran": "And they said: \"Our gods are better or is he?\" They only put this forth to argue with you. Indeed, they are a quarrelsome people.", "verse": 58, "surah": 43}, {"quran": "He was no more than a servant whom We blessed, and We made him an example for the Children of Israel.", "verse": 59, "surah": 43}, {"quran": "And if We willed, We could have made some of you angels to be successors on the earth.", "verse": 60, "surah": 43}, {"quran": "And he was a lesson for the Hour. So have no doubt about it. And follow Me; this is a straight path.", "verse": 61, "surah": 43}, {"quran": "And let not the devil repel you; he is to you a clear enemy.", "verse": 62, "surah": 43}, {"quran": "And when Jesus came with the proofs, he said: \"I have come to you with the wisdom, and to clarify some of the matters in which you dispute. So be aware of God and obey me.\"", "verse": 63, "surah": 43}, {"quran": "\"God is my Lord and your Lord. So serve Him. This is a straight path.\"", "verse": 64, "surah": 43}, {"quran": "The Confederates disputed among themselves. So, woe to those who have been wicked from the retribution of a painful Day.", "verse": 65, "surah": 43}, {"quran": "Do they only wait for the Hour to come to them suddenly, while they do not perceive?", "verse": 66, "surah": 43}, {"quran": "Friends on that Day will become enemies of one another, except for the righteous.", "verse": 67, "surah": 43}, {"quran": "\"O My servants, you will have no fear on this Day, nor will you grieve.\"", "verse": 68, "surah": 43}, {"quran": "They are the ones who believed in Our revelations, and had submitted.", "verse": 69, "surah": 43}, {"quran": "\"Enter Paradise, together with your spouses, in happiness.\"", "verse": 70, "surah": 43}, {"quran": "They will be served with golden trays and cups, and they will find everything the self desires and the eyes wish for, and you will abide therein.", "verse": 71, "surah": 43}, {"quran": "And this is Paradise that you have inherited, in return for your works.", "verse": 72, "surah": 43}, {"quran": "In it you will have all kinds of fruits, from which you eat.", "verse": 73, "surah": 43}, {"quran": "Surely, the criminals will abide in the retribution of Hell.", "verse": 74, "surah": 43}, {"quran": "It will not be removed from them; they will be confined therein.", "verse": 75, "surah": 43}, {"quran": "And We did not wrong them, but it was they who were the wrongdoers.", "verse": 76, "surah": 43}, {"quran": "And they called out: \"O Malek, please let your Lord terminate us!\" He will say: \"No, you are remaining.\"", "verse": 77, "surah": 43}, {"quran": "We have come to you with the truth,  but most of you hate the truth.", "verse": 78, "surah": 43}, {"quran": "Or have they devised some scheme? We will also devise.", "verse": 79, "surah": 43}, {"quran": "Or do they think that We do not hear their secrets and their private counsel? Yes indeed; and Our messengers are with them, recording.", "verse": 80, "surah": 43}, {"quran": "Say: \"If the Almighty had a son, I would be the first to serve!\"", "verse": 81, "surah": 43}, {"quran": "Glory be to the Lord of the heavens and the earth, the Lord of the Throne, from what they describe.", "verse": 82, "surah": 43}, {"quran": "So leave them to speak nonsense and play until they meet their Day which they have been promised.", "verse": 83, "surah": 43}, {"quran": "And He is the One who is a god in the heaven and a god on the earth. And He is the Wise, the Knowledgeable.", "verse": 84, "surah": 43}, {"quran": "And blessed is the One who possesses the sovereignty of the heavens and the earth, and everything between them; and with Him is the knowledge of the Hour, and to Him you will be returned.", "verse": 85, "surah": 43}, {"quran": "And those whom they call on besides Him do not possess any intercession; except those who bear witness to the truth, and they fully know.", "verse": 86, "surah": 43}, {"quran": "And if you asked them who has created them, they would say, \"God.\" Why then do they deviate?", "verse": 87, "surah": 43}, {"quran": "And it will be said: \"O my Lord, these are a people who do not believe.\"", "verse": 88, "surah": 43}, {"quran": "So disregard them and say: \"Peace.\" For they will come to know.", "verse": 89, "surah": 43}]]