[[{"quran": "In the name of God, the Almighty, the Merciful.", "verse": 0, "surah": 18}, {"quran": "Praise be to God who has sent down the Book to His servant, and He has not made in it any crookedness.", "verse": 1, "surah": 18}, {"quran": "It is valuable, giving warning of the severe punishment from Him; and it gives glad tidings to the believers who do good works, that they will have an excellent reward.", "verse": 2, "surah": 18}, {"quran": "In which they will remain eternally.", "verse": 3, "surah": 18}, {"quran": "And to warn those who said: \"God has taken a son.\"", "verse": 4, "surah": 18}, {"quran": "They have no knowledge of this, nor do their fathers. Tremendous indeed is the word coming out of their mouths. They are but saying a lie!", "verse": 5, "surah": 18}, {"quran": "Perhaps you will torment yourself in grief over them, because they will not believe in this narrative at all.", "verse": 6, "surah": 18}, {"quran": "We have made what is on the earth an adornment for them, so that We will test them as to which of them is best in works.", "verse": 7, "surah": 18}, {"quran": "And We will surely make what is on it completely barren.", "verse": 8, "surah": 18}, {"quran": "Did you perceive that the dwellers of the cave and the numbers related were of Our wondrous signs?", "verse": 9, "surah": 18}, {"quran": "When the youths hid in the cave, and they said: \"Our Lord, bring us a mercy from Yourself, and help us in our affair!\"", "verse": 10, "surah": 18}, {"quran": "So We sealed their ears in the cave for many years.", "verse": 11, "surah": 18}, {"quran": "Then We sent them to know which of the two groups had remained for as long as they stayed.", "verse": 12, "surah": 18}, {"quran": "We tell to you their news with the truth. They were youths who believed in their Lord, and We increased them in guidance.", "verse": 13, "surah": 18}, {"quran": "And We made firm their hearts when they stood and said: \"Our Lord, the Lord of the heavens and the earth, we will not call besides Him any god. If we have done so then it was in error.\"", "verse": 14, "surah": 18}, {"quran": "\"Here are our people, they have taken gods besides Him, while they do not come with any clear authority. Who then is more wicked than he who invents lies about God?\"", "verse": 15, "surah": 18}, {"quran": "\"So when you withdraw from them and what they serve besides God, seek refuge in the cave, and your Lord will spread His mercy upon you and prepare for your problem a solution.\"", "verse": 16, "surah": 18}, {"quran": "And you see the sun when it rises, it visits their cave from the right, and when it sets, it touches them from the left, while they are in an enclosure from it. That is from the signs of God. Whoever God guides is the guided one, and whoever He misguides, you will not find for him any ally to give direction.", "verse": 17, "surah": 18}, {"quran": "And you would think they are awake while they are asleep. And We turn them on the right-side and on the left-side, and their dog has his arms outstretched at the threshold. If you looked upon them you would have run away from them and you would have been filled with terror from them!", "verse": 18, "surah": 18}, {"quran": "And it was thus that We delivered them so they would ask themselves. A speaker from among them said: \"How long have you stayed?\" They said: \"We stayed a day or part of a day.\" He said: \"Your Lord is surely aware how long you stayed, so send one of you with these stamped coins of yours to the city, and let him see which is the tastiest food, and let him come with a provision of it. And let him be careful and let no one notice you.\"", "verse": 19, "surah": 18}, {"quran": "\"If they discover you, they will stone you or return you to their creed. Then you will never be successful.\"", "verse": 20, "surah": 18}, {"quran": "And as such, We revealed their case so that they would know that the promise of God is true and that there is no doubt regarding the Hour. They argued among themselves regarding them, so they said: \"Erect a monument for them!\" Their Lord is fully aware of them, those who managed to win the argument said: \"We will construct a temple over them.\"", "verse": 21, "surah": 18}, {"quran": "They will say: \"Three, the fourth is their dog.\" And they say: \"Five, the sixth is their dog,\" guessing at what they do not know. And they say: \"Seven, and the eighth is their dog.\" Say: \"My Lord is fully aware of their number, none know them except for a few.\" So do not argue regarding them except with proof, and do not seek information regarding them from anyone.", "verse": 22, "surah": 18}, {"quran": "And do not simply say of something: \"I will do this tomorrow.\"", "verse": 23, "surah": 18}, {"quran": "\"Except if God wills.\" And remember your Lord if you forget and say: \"Perhaps my Lord will guide me to what is nearer than this in wisdom.\"", "verse": 24, "surah": 18}, {"quran": "And they remained in their cave for three hundred years, and increased by nine.", "verse": 25, "surah": 18}, {"quran": "Say: \"God is fully aware how long they remained, to Him is the unseen of the heavens and the earth, He sees and hears. They do not have besides Him any ally, and He does not share in His judgment with anyone.\"", "verse": 26, "surah": 18}, {"quran": "And recite what has been inspired to you from the Book of your Lord, there is no changing His words, and you will not find besides Him any refuge.", "verse": 27, "surah": 18}, {"quran": "And have patience upon yourself regarding those who call on their Lord at dawn and dusk seeking His face, and let not your eyes overlook them that you seek the beauty of this worldly life. And do not obey he whom We have made his heart heedless of Our remembrance and he followed his desire, and his fate was lost.", "verse": 28, "surah": 18}, {"quran": "And say: \"The truth is from your Lord, so let whoever desires believe, and whoever desires reject.\" We have prepared for the wicked a Fire whose walls will be surrounding them. And if they cry out, they are given a water like boiling oil which burns their faces. What a dreadful drink and what a miserable place!", "verse": 29, "surah": 18}, {"quran": "Those who believe and do good works, We do not waste the reward of those who have done good work.", "verse": 30, "surah": 18}, {"quran": "They will have gardens of delight with rivers flowing beneath them, and they will be adorned with bracelets of gold and they will wear green garments of fine silk. They will sit in it on raised thrones. Beautiful is the reward, and beautiful is the dwelling.", "verse": 31, "surah": 18}, {"quran": "And give them the example of two men: We made for one of them two gardens of grapes, and We surrounded them with palm trees, and We made crops in their midst.", "verse": 32, "surah": 18}, {"quran": "Each of the two gardens brought forth its produce, and none failed in the least. And We caused a river to gush through them.", "verse": 33, "surah": 18}, {"quran": "And he had fruit, so he said to his friend while discussing with him: \"I am better off than you financially, and of great influence.\"", "verse": 34, "surah": 18}, {"quran": "And he went back into his garden while he had wronged himself. He said: \"I do not think that this will ever perish.\"", "verse": 35, "surah": 18}, {"quran": "\"And I do not think that the Hour is coming. And if I am indeed returned to my Lord, then I will surely find even better things for me.\"", "verse": 36, "surah": 18}, {"quran": "His friend said to him while discussing with him: \"Have you disbelieved in the One who has created you from dust, then from a seed, then He evolved you into a man?\"", "verse": 37, "surah": 18}, {"quran": "\"But He is God, my Lord, and I do not set up any partners at all with my Lord.\"", "verse": 38, "surah": 18}, {"quran": "\"And if you enter your garden, you should say: 'This is what God has given, there is no power except by God.' You see me as being less than you in wealth and in children?\"", "verse": 39, "surah": 18}, {"quran": "\"Perhaps my Lord will give me better than your garden, and He will send upon it a tornado from the sky, so it becomes completely barren.\"", "verse": 40, "surah": 18}, {"quran": "\"Or that its water becomes deep underground, so you will not be capable of seeking it.\"", "verse": 41, "surah": 18}, {"quran": "So his fruits were ruined, and he began turning his hands at that which he had spent on it while it remained destroyed upon its branches. And he said: \"I wish I had not set up any partner with my Lord!\"", "verse": 42, "surah": 18}, {"quran": "And he had no group which could help against God, and he would not have had victory.", "verse": 43, "surah": 18}, {"quran": "Such is the true authority of God. He is best to reward, and best to end.", "verse": 44, "surah": 18}, {"quran": "And give them the example of this worldly life is like a water which We have sent down from the sky, so that the plants of the earth mix with it and it becomes murky being moved by the wind. And God is capable of all things.", "verse": 45, "surah": 18}, {"quran": "Wealth and sons are a beauty of this worldly life. But the good deeds that remain behind are better with your Lord for a reward, and better for hope.", "verse": 46, "surah": 18}, {"quran": "And the Day We move the mountains, and you see the earth level, and We gather them; so We will not leave out anyone of them.", "verse": 47, "surah": 18}, {"quran": "And they are displayed before your Lord as a column: \"You have come to Us as We had created you the first time. No, you claimed We would not make for you an appointed time!\"", "verse": 48, "surah": 18}, {"quran": "And the record was displayed, so you see the criminals fearful of what is in it. And they say: \"Woe to us! What is with this record that it does not leave out anything small or large but has counted it.\" And they found what they had done present. And your Lord does not wrong anyone.", "verse": 49, "surah": 18}, {"quran": "And We said to the angels: \"Yield to Adam.\" So they all yielded except for Satan. He was of the Jinn, he disobeyed the order of his Lord. Will you take him and his progeny as allies besides Me, while they are your enemy? Miserable for the transgressors is the substitute!", "verse": 50, "surah": 18}, {"quran": "I did not make them witness the creation of the heavens and the earth, nor the creation of themselves. Nor do I take the misleaders as helpers.", "verse": 51, "surah": 18}, {"quran": "The Day when He says: \"Call on your partners that you had claimed.\" So they called them, but they did not respond to them. And We made between them a barrier.", "verse": 52, "surah": 18}, {"quran": "And the criminals saw the Fire, and they realized they will be placed in it, and they did not find any way to avert it.", "verse": 53, "surah": 18}, {"quran": "And We have dispatched in this Qur'an for the people from every example; but the human being has always been most argumentative.", "verse": 54, "surah": 18}, {"quran": "And what prevented the people from believing when the guidance came to them, and to seek forgiveness from their Lord? Are they waiting for what happened to the people of old to come to them, or that the retribution be brought to them face to face?", "verse": 55, "surah": 18}, {"quran": "And We do not send the messengers except as bearers of good news and warners. But those who reject will argue using falsehood to overshadow the truth with it. And they took My revelations and what they have been warned by for mockery!", "verse": 56, "surah": 18}, {"quran": "And who is more wicked than he who was reminded of the revelations of his Lord but he turned away from them, and he forgot what his hands had done. We have made veils upon their hearts from understanding it, and a deafness in their ears. And if you invite them to the guidance, they will never be guided.", "verse": 57, "surah": 18}, {"quran": "And your Lord is forgiving, with mercy. If He were to evaluate the people for what they had already earned, He would hasten for them the retribution. No, they have an appointment, beyond which they will find no escape.", "verse": 58, "surah": 18}, {"quran": "And those towns, We destroyed them when they transgressed. And We made for their destruction an appointed time.", "verse": 59, "surah": 18}, {"quran": "And Moses said to his youth: \"I will not stop until I reach the junction of the two seas, or I spend a lifetime trying.\"", "verse": 60, "surah": 18}, {"quran": "But when they reached the junction that was in-between, they forgot their fish, and it was able to make its way back to the sea in a stream.", "verse": 61, "surah": 18}, {"quran": "And when they passed further on, he said to his youth: \"Bring us our lunch; we have found much fatigue in this journey of ours.\"", "verse": 62, "surah": 18}, {"quran": "He said: \"Do you remember when we rested upon the rock? I forgot the fish, and it was the devil who made me forget to remember it. It made its way back to the sea amazingly!\"", "verse": 63, "surah": 18}, {"quran": "He said: \"That is what we have been seeking!\" So they went back retracing their steps.", "verse": 64, "surah": 18}, {"quran": "So they came upon a servant of Ours whom We had given him mercy from Us and We had taught him knowledge from Us.", "verse": 65, "surah": 18}, {"quran": "Moses said to him: \"Can I follow you so that you will teach me from the guidance you have been taught?\"", "verse": 66, "surah": 18}, {"quran": "He said: \"You will not be able to have patience with me.\"", "verse": 67, "surah": 18}, {"quran": "\"And how can you be patient about that which you have not been given any news?\"", "verse": 68, "surah": 18}, {"quran": "He said: \"You will find me, God willing, to be patient. And I will not disobey any command of yours.\"", "verse": 69, "surah": 18}, {"quran": "He said: \"If you follow me, then do not ask about anything until I relate it to you.\"", "verse": 70, "surah": 18}, {"quran": "So they ventured forth until they rode in a boat and he made a hole in it. He said: \"Have you made a hole in it to drown its people? You have done something dreadful!\"", "verse": 71, "surah": 18}, {"quran": "He said: \"Did I not tell you that you will not be able to have patience with me?\"", "verse": 72, "surah": 18}, {"quran": "He said: \"Forgive me for what I forgot, and do not be hard upon my request with you.\"", "verse": 73, "surah": 18}, {"quran": "So they ventured forth until they came upon a youth, and he killed him. He said: \"Have you killed an innocent person without justice? You have done something awful!\"", "verse": 74, "surah": 18}, {"quran": "He said: \"Did I not tell you that you will not be able to have patience with me?\"", "verse": 75, "surah": 18}, {"quran": "He said: \"If I ask you about anything after this, then do not keep me in your company. You will then have a reason over me.\"", "verse": 76, "surah": 18}, {"quran": "So they ventured forth until they came to the people of a town. They requested food from its people but they refused to host them. Then they found a wall which was close to collapsing, so he built it. He said: \"If you had wished, you could have asked a wage for it!\"", "verse": 77, "surah": 18}, {"quran": "He said: \"For this, we will now part ways. I will inform you of the meanings of those things that you could not have patience over.\"", "verse": 78, "surah": 18}, {"quran": "\"As for the boat, it belonged to some poor people who were working the sea, so I wanted to damage it as there was a king coming who takes every boat by force.\"", "verse": 79, "surah": 18}, {"quran": "\"And as for the youth, his parents were believers, so we were concerned that he would oppress them by his transgression and disbelief.\"", "verse": 80, "surah": 18}, {"quran": "\"So we wanted their Lord to replace for them with one who is better than him in purity and closer to mercy.\"", "verse": 81, "surah": 18}, {"quran": "\"And as for the wall, it belonged to two orphaned boys in the city, and underneath it was a treasure for them, and their father was a good man, so your Lord wanted that they reach their independence and bring out their treasure as a mercy from your Lord. And none of what I have done was of my own accord. That is the meaning of what you could not have patience for.\"", "verse": 82, "surah": 18}, {"quran": "And they ask you about the Two Horned One, say: \"I will recite to you a remembrance of him.\"", "verse": 83, "surah": 18}, {"quran": "We had facilitated for him in the land, and We had given him the means to all things.", "verse": 84, "surah": 18}, {"quran": "So he followed the means.", "verse": 85, "surah": 18}, {"quran": "Until he reached the setting of the sun; he found it setting at a hot spring, and he found a people near it. We said: \"O Two Horned One, either you shall punish, or you shall do them good.\"", "verse": 86, "surah": 18}, {"quran": "He said: \"As for he who has done wrong, we will punish him then he will be returned to his Lord and He will punish him an awful punishment.\"", "verse": 87, "surah": 18}, {"quran": "\"And as for he who believes and does good, then he will have the reward of goodness, and we will speak to him simply of our plan.\"", "verse": 88, "surah": 18}, {"quran": "Then he followed the means.", "verse": 89, "surah": 18}, {"quran": "So when he reached the rising of the sun, he found it rising on a people for whom We did not make any cover except it.", "verse": 90, "surah": 18}, {"quran": "So it was, and We knew ahead of time about what he intended.", "verse": 91, "surah": 18}, {"quran": "Then he followed the means.", "verse": 92, "surah": 18}, {"quran": "Until he reached the area between the two barriers, he found no one besides them except a people who could barely understand anything said.", "verse": 93, "surah": 18}, {"quran": "They said: \"O Two Horned One, Gog and Magog are destroyers of the land, so shall we make a tribute for you that you will make between us and them a barrier?\"", "verse": 94, "surah": 18}, {"quran": "He said: \"What my Lord has given me is far better. So help me with strength and I will make between you and them a barrier.\"", "verse": 95, "surah": 18}, {"quran": "\"Bring me iron ore.\" Until he leveled between the two walls, he said: \"Blow,\" until he made it a furnace, he said: \"Bring me tar so I can pour it over.\"", "verse": 96, "surah": 18}, {"quran": "So they could not come over it, and they could not make a hole in it.", "verse": 97, "surah": 18}, {"quran": "He said: \"This is a mercy from my Lord. But when the promise of my Lord comes, He will make it rubble. And the  promise of my Lord is truth.\"", "verse": 98, "surah": 18}, {"quran": "And We left them until that day to surge like waves on one another. And the horn was blown, so We gathered them together.", "verse": 99, "surah": 18}, {"quran": "And We displayed Hell on that Day to the rejecters openly.", "verse": 100, "surah": 18}, {"quran": "Those whose eyes were covered against My remembrance, and they were unable to hear.", "verse": 101, "surah": 18}, {"quran": "Did those who reject think that they could take My servants as allies besides Me? We have prepared Hell for the rejecters as a dwelling.", "verse": 102, "surah": 18}, {"quran": "Say: \"Shall we inform you of the greatest losers?\"", "verse": 103, "surah": 18}, {"quran": "\"Those whose efforts in the worldly life were wasted while they thought they were doing good!\"", "verse": 104, "surah": 18}, {"quran": "These are the ones who rejected the revelations of their Lord and His meeting. So their works were in vain, and We will not give them any value on the Day of Resurrection.", "verse": 105, "surah": 18}, {"quran": "That is their recompense, Hell; for what they rejected and for taking My revelations and My messengers for mockery!", "verse": 106, "surah": 18}, {"quran": "Those who believe and do good works, they will have the gardens of Paradise  as a dwelling.", "verse": 107, "surah": 18}, {"quran": "Abiding therein. They will not want to be moved from it.", "verse": 108, "surah": 18}, {"quran": "Say: \"If the sea were an inkwell for the words of my Lord, then the sea would run out before the words of my Lord run out;\" even if We were to bring another like it as an extension.", "verse": 109, "surah": 18}, {"quran": "Say: \"I am but a mortal like you, being inspired that your god is One god. So whoever looks forward to meeting his Lord, then let him do good works, and not serve anyone besides his Lord.\"", "verse": 110, "surah": 18}]]