[[{"quran": "In the name of God, the Almighty, the Merciful.", "verse": 0, "surah": 47}, {"quran": "Those who rejected and repelled from the path of God, He will mislead their works.", "verse": 1, "surah": 47}, {"quran": "And those who believe and do good works, and believe in what was sent down to Mohammed, for it is the truth from their Lord, He cancels for them their sins, and relieves their concern.", "verse": 2, "surah": 47}, {"quran": "That is because those who reject followed falsehood, while those who believe followed the truth from their Lord. God thus puts forth for the people their examples.", "verse": 3, "surah": 47}, {"quran": "Therefore, if you encounter those who have rejected, then strike the necks; until you bind them, then secure the cords. You may then either set them free or ransom them, until the war ends. That, and if God had willed, He alone could have beaten them, but He thus tests you by one another. As for those who get killed in the cause of God, He will never let their deeds be put to waste.", "verse": 4, "surah": 47}, {"quran": "He will guide them, and relieve their concerns.", "verse": 5, "surah": 47}, {"quran": "And He will admit them into Paradise, which He has described to them.", "verse": 6, "surah": 47}, {"quran": "O you who believe, if you support God, He will support you, and make your foothold firm.", "verse": 7, "surah": 47}, {"quran": "And those who rejected, for them is destruction; and He has misled their works.", "verse": 8, "surah": 47}, {"quran": "That is because they hated what God sent down, thus He nullifies their works.", "verse": 9, "surah": 47}, {"quran": "Did they not roam the earth and note how was the end for those before them? God destroyed them; and for the rejecters in a similar fate.", "verse": 10, "surah": 47}, {"quran": "This is because God is the Master for those who believe, while the rejecters have no master.", "verse": 11, "surah": 47}, {"quran": "God admits those who believe and do good works to gardens with rivers flowing beneath them. As for those who reject, they are enjoying and eating as the livestock eat, and the Fire will be their abode.", "verse": 12, "surah": 47}, {"quran": "And many a town was stronger than your own town, which drove you out. We destroyed them, and there was none who could help them.", "verse": 13, "surah": 47}, {"quran": "Is he who is based on proof from his Lord, as he for whom his evil works have been adorned for him and they followed their desires?", "verse": 14, "surah": 47}, {"quran": "Is the example of Paradise; that the righteous have been promised with rivers of pure water, and rivers of milk whose taste does not change, and rivers of intoxicants that are delicious for the drinkers, and rivers of strained honey, and for them in it are all kinds of fruits, and a forgiveness from their Lord; like that of those who abide in the Fire, and are given to drink boiling water that cuts-up their intestines?", "verse": 15, "surah": 47}, {"quran": "And some of them listen to you, until when they go out from you, they say to those who have been given the knowledge: \"What did he say?\" Those are the ones whom God has sealed their hearts, and they followed their desires.", "verse": 16, "surah": 47}, {"quran": "And those who are guided, He increases their guidance, and grants them their righteousness.", "verse": 17, "surah": 47}, {"quran": "So are they waiting until the Hour comes to them suddenly? For its conditions have already been met. But once it comes to them, how will they benefit from their message?", "verse": 18, "surah": 47}, {"quran": "So know that there is no god besides God, and ask forgiveness of your sins and also for the believing males and the believing females. And God knows your movements and your place of rest.", "verse": 19, "surah": 47}, {"quran": "And those who believe say: \"If only a Chapter is sent down!\" But when a lawgiving Chapter is sent down, and fighting is mentioned in it, you see those who have a disease in their hearts look at you, as if death had already come to them. It thus revealed them.", "verse": 20, "surah": 47}, {"quran": "Obedience and to speak righteousness until the matter is decided, then if they trust God it would be better for them.", "verse": 21, "surah": 47}, {"quran": "So do you plan that when you turn away, that you will corrupt the land and sever your family ties?", "verse": 22, "surah": 47}, {"quran": "These are the ones whom God has cursed and thus He made them deaf and blinded their sight.", "verse": 23, "surah": 47}, {"quran": "Do they not reflect upon the Qur'an? Or are there locks on the hearts?", "verse": 24, "surah": 47}, {"quran": "Surely, those who returned back, after the guidance has been made clear to them, the devil has enticed them and has led them on.", "verse": 25, "surah": 47}, {"quran": "That is because they said to those who hated what God had sent down: \"We will obey you in certain matters.\" And God knows their secrets.", "verse": 26, "surah": 47}, {"quran": "So how will it be when their lives are terminated by the angels, while striking their faces and their backs?", "verse": 27, "surah": 47}, {"quran": "That is because they followed that which angered God, and they hated that which pleased Him. Thus, He nullified their works.", "verse": 28, "surah": 47}, {"quran": "Or did those who harbor a disease in their hearts think that God would not bring out their evil thoughts?", "verse": 29, "surah": 47}, {"quran": "And if We wished, We would show them to you so you would recognize them by their looks. However, you can recognize them by their speech. And God is fully aware of your works.", "verse": 30, "surah": 47}, {"quran": "And We will test you for We know those who strive among you and those who are patient. And We will bring out your qualities.", "verse": 31, "surah": 47}, {"quran": "Those who have rejected and repelled from the path of God, and stood against the messenger; after the guidance has been made clear for them; they will not harm God in the least, and He will nullify their works.", "verse": 32, "surah": 47}, {"quran": "O you who believe, obey God, and obey the messenger. And do not render your works in vain.", "verse": 33, "surah": 47}, {"quran": "Surely, those who rejected and repelled from the path of God, then they died while still rejecting, God will never forgive them.", "verse": 34, "surah": 47}, {"quran": "Therefore, do not be weak and ask for peace, for you are on a higher moral ground, and God is with you. And He will not waste your efforts.", "verse": 35, "surah": 47}, {"quran": "The worldly life is no more than play and distraction. But if you believe and lead a righteous life, He will reward you, and He will not ask you for your wealth.", "verse": 36, "surah": 47}, {"quran": "If He were to ask you for it, to the extent of creating a hardship for you, you would become stingy, and your hidden evil will be exposed.", "verse": 37, "surah": 47}, {"quran": "Here you are being invited to spend in the cause of God, but some among you turn stingy. And whoever is stingy is only being stingy on himself. And God is the Rich, while you are the poor. And if you turn away, He will substitute another people instead of you, then they will not be like you.", "verse": 38, "surah": 47}]]