[[{"quran": "In the name of God, the Almighty, the Merciful.", "verse": 0, "surah": 71}, {"quran": "We have sent Noah to his people: \"Warn your people before a painful retribution comes to them.\"", "verse": 1, "surah": 71}, {"quran": "He said: \"My people, I am to you a clear warner.\"", "verse": 2, "surah": 71}, {"quran": "hat you shall serve God and be aware of Him and obey me.\"", "verse": 3, "surah": 71}, {"quran": "e shall forgive your sins and delay you to a predetermined time. When the time of God comes, then it cannot be delayed, if you know.\"", "verse": 4, "surah": 71}, {"quran": "He said: \"My Lord, I have called on my people night and day.\"", "verse": 5, "surah": 71}, {"quran": "\"But my calling only drove them away!\"", "verse": 6, "surah": 71}, {"quran": "\"And every time I called on them so that You may forgive them, they put their fingers in their ears and they covered their heads with their outer garments and they insisted, and they became greatly arrogant.\"", "verse": 7, "surah": 71}, {"quran": "\"Then I called to them openly.\"", "verse": 8, "surah": 71}, {"quran": "\"Then I announced to them, and I spoke to them in secret.\"", "verse": 9, "surah": 71}, {"quran": "\"And I said: Seek forgiveness from your Lord, for He was forgiving.\"", "verse": 10, "surah": 71}, {"quran": "\"He sends the sky to you abundantly.\"", "verse": 11, "surah": 71}, {"quran": "\"And He provides you with wealth and sons, and He makes for you gardens, and He makes for you rivers.\"", "verse": 12, "surah": 71}, {"quran": "hy do you not seek God humbly.\"", "verse": 13, "surah": 71}, {"quran": "\"While He created you in stages?\"", "verse": 14, "surah": 71}, {"quran": "id you not see how God created seven heavens in layers?\"", "verse": 15, "surah": 71}, {"quran": "\"And He made the moon to illuminate in them, and He made the sun to be a lamp?\"", "verse": 16, "surah": 71}, {"quran": "nd God made you grow from the earth as plants.\"", "verse": 17, "surah": 71}, {"quran": "\"Then He returns you to it, and He brings you out totally?\"", "verse": 18, "surah": 71}, {"quran": "nd God made the land for you as a plain.\"", "verse": 19, "surah": 71}, {"quran": "\"So that you may seek in it ways and paths?\"", "verse": 20, "surah": 71}, {"quran": "Noah said: \"My Lord, they have disobeyed me and have followed he whose money and children only increased him in loss.\"", "verse": 21, "surah": 71}, {"quran": "And they plotted a great plotting.", "verse": 22, "surah": 71}, {"quran": "And they said: \"Do not abandon your gods. Do not abandon Destroyer, nor Fertility, nor Lion, Stallion and Eagle.\"", "verse": 23, "surah": 71}, {"quran": "And they have misguided many, but We only increase the wicked in misguidance.", "verse": 24, "surah": 71}, {"quran": "cause of their wrongdoing they were drowned, then they were admitted to the Fire, and they could not find besides God any victor.", "verse": 25, "surah": 71}, {"quran": "And Noah said: \"My Lord, do not leave on the earth any of the rejecters at all.\"", "verse": 26, "surah": 71}, {"quran": "\"If you are to leave them, then they will misguide Your servants and they will only give birth to a wicked rejecter.\"", "verse": 27, "surah": 71}, {"quran": "\"My Lord, forgive me, and my parents, and whoever enters my home as a believer, and the believing males, and the believing females; and do not increase the wicked except in destruction.\"", "verse": 28, "surah": 71}]]