[[{"quran": "In the name of God, the Almighty, the Merciful.", "verse": 0, "surah": 73}, {"quran": "O you who are covered with your garments.", "verse": 1, "surah": 73}, {"quran": "Stand the night except for a little.", "verse": 2, "surah": 73}, {"quran": "Half of it, or a little less than that.", "verse": 3, "surah": 73}, {"quran": "Or a little more, and arrange the Qur\"an in its arrangement.", "verse": 4, "surah": 73}, {"quran": "We will place upon you a saying which is heavy.", "verse": 5, "surah": 73}, {"quran": "The time of the night is more effective and better for study.", "verse": 6, "surah": 73}, {"quran": "For you have many duties during the day.", "verse": 7, "surah": 73}, {"quran": "And remember the name of your Lord, and devote to Him completely.", "verse": 8, "surah": 73}, {"quran": "The Lord of the east and the west, there is no god except He, so take Him as a protector.", "verse": 9, "surah": 73}, {"quran": "And be patient over what they say, and depart from them in a good manner.", "verse": 10, "surah": 73}, {"quran": "And leave Me to deal with the deniers who have been given the good things, and give them time for a while.", "verse": 11, "surah": 73}, {"quran": "We have with Us chains and a raging fire.", "verse": 12, "surah": 73}, {"quran": "And food that chokes, and a painful retribution.", "verse": 13, "surah": 73}, {"quran": "The Day the earth and the mountains shake, and the mountains become a crumbling pile.", "verse": 14, "surah": 73}, {"quran": "We have sent to you a messenger as a witness over you, as We have sent to Pharaoh a messenger.", "verse": 15, "surah": 73}, {"quran": "But Pharaoh disobeyed the messenger, so We took him in a severe manner.", "verse": 16, "surah": 73}, {"quran": "So how can you be righteous when you have rejected? A Day which will turn the children white haired!", "verse": 17, "surah": 73}, {"quran": "The heavens will crack with it. His promise is always delivered.", "verse": 18, "surah": 73}, {"quran": "This is a reminder, so let he who wishes take a path to his Lord.", "verse": 19, "surah": 73}, {"quran": "ur Lord knows that you rise a little less than two thirds of the night, and half of it, and one third of it; and a group of those who are with you. And God measures the night and the day. He knows that you will not be able to keep-up, so He pardons you. So read what is made easy of the Qur\"an. He knows that there will be sick among you, and others that go forth in the land seeking from the bounty of God, and others who are fighting in the cause of God, so read what you can of it. And hold the contact prayer and contribute towards purification and lend God a loan of righteousness. And whatever you put forth yourselves, you will find it with God, for it is better and a greater reward. And seek the forgiveness of God, for God is Forgiving, Merciful.", "verse": 20, "surah": 73}]]