[[{"quran": "In the name of God, the Almighty, the Merciful.", "verse": 0, "surah": 16}, {"quran": "The command of God will come, so do not hasten it. Be He glorified and exalted above the partners they set up.", "verse": 1, "surah": 16}, {"quran": "He sends down the angels with the Spirit by His command upon whom He wishes of His servants: \"That you shall warn that there is no god except I, so be aware of Me.\"", "verse": 2, "surah": 16}, {"quran": "He has created the heavens and the earth with the truth. Be He exalted above the partners they set up.", "verse": 3, "surah": 16}, {"quran": "He has created the human being from a seed, but then he becomes clearly in opposition.", "verse": 4, "surah": 16}, {"quran": "And the livestock He has created them for you, in them is warmth and benefits, and from them you eat.", "verse": 5, "surah": 16}, {"quran": "And for you in them is beauty, when you relax and when you travel.", "verse": 6, "surah": 16}, {"quran": "And they carry your loads to a land that you would not have been able to reach except with great strain. Your Lord is Compassionate, Merciful.", "verse": 7, "surah": 16}, {"quran": "And the horses and the mules and the donkeys, that you may ride them and as an adornment; and He creates what you do not know.", "verse": 8, "surah": 16}, {"quran": "And upon God the path is sought; and from it are deviations. And if He had wished, He could have guided you all.", "verse": 9, "surah": 16}, {"quran": "He is the One who has sent down water from the sky for you, from it you drink, and from it are woods in which you pasture.", "verse": 10, "surah": 16}, {"quran": "He brings forth with it the vegetation and the olives and the palm trees and the grapes, and of all the fruits; in that are signs for a people who think.", "verse": 11, "surah": 16}, {"quran": "And He has commissioned for you the night and the day, and the sun and the moon, and the stars are commissioned by His command. In that are signs for a people who comprehend.", "verse": 12, "surah": 16}, {"quran": "And what He has placed for you on the earth in various colors. In that are signs for a people who remember.", "verse": 13, "surah": 16}, {"quran": "And He is the One who has commissioned the sea, that you may eat from it a tender meat, and that you may extract from it pearls that you wear. And you see the ships flowing through it, so that you may seek from His bounty, and that you may be thankful.", "verse": 14, "surah": 16}, {"quran": "And He has cast onto the earth stabilizers so that it would not tumble with you, and rivers, and paths, perhaps you will be guided.", "verse": 15, "surah": 16}, {"quran": "And landmarks, and by the star they are guided.", "verse": 16, "surah": 16}, {"quran": "Is He who creates the same he who does not create? Will you not remember?", "verse": 17, "surah": 16}, {"quran": "And if you count the blessings of God, you will not be able to number them. God is Forgiving, Merciful.", "verse": 18, "surah": 16}, {"quran": "And God knows what you conceal and what you reveal.", "verse": 19, "surah": 16}, {"quran": "As for those they call on besides God, they do not create a thing, but are themselves created!", "verse": 20, "surah": 16}, {"quran": "They are dead, not alive, and they do not perceive when they will be resurrected.", "verse": 21, "surah": 16}, {"quran": "Your god is One god. Those who do not believe in the Hereafter, their hearts are denying, and they are arrogant.", "verse": 22, "surah": 16}, {"quran": "Certainly, God knows what they hide and what they reveal. He does not like the arrogant.", "verse": 23, "surah": 16}, {"quran": "And if they are told: \"What has your Lord sent down?\" They say: \"Fictional tales of old!\"", "verse": 24, "surah": 16}, {"quran": "They will carry their burdens in full on the Day of Resurrection, and also from the burdens of those whom they misguided without knowledge. Evil indeed is what they bear.", "verse": 25, "surah": 16}, {"quran": "Those before them had schemed, so God came to their buildings from the foundation, thus the roof fell on top of them; and the retribution came to them from where they did not know.", "verse": 26, "surah": 16}, {"quran": "Then, on the Day of Resurrection He will humiliate them, and say: \"Where are My partners regarding whom you used to dispute?\" Those who have received the knowledge said: \"The humiliation today and the misery are upon the rejecters.\"", "verse": 27, "surah": 16}, {"quran": "Those whom their lives are terminated by the angels, while they had wronged themselves: \"Amnesty, we have not done any evil!\" \"Alas, God is aware of what you have done.\"", "verse": 28, "surah": 16}, {"quran": "\"So enter the gates of Hell, in it you shall reside; such is the abode of the arrogant.\"", "verse": 29, "surah": 16}, {"quran": "And it was said to those who were righteous: \"What has your Lord sent down?\" They said: \"All goodness.\" For those who have done good in this world there is good; and the Hereafter is goodness. Excellent indeed is the home of the righteous.", "verse": 30, "surah": 16}, {"quran": "Gardens of delight; which they will enter, with rivers flowing beneath them, in it they will have what they wish. It is such that God rewards the righteous.", "verse": 31, "surah": 16}, {"quran": "Those whom their lives are terminated by the angels, while they had been good, they will say: \"Peace be upon you, enter Paradise because of that which you have done.\"", "verse": 32, "surah": 16}, {"quran": "Are they waiting for the angels to come for them, or a command from your Lord? It was exactly the same as what those before them did. God did not wrong them, but it was their own souls that they wronged.", "verse": 33, "surah": 16}, {"quran": "Thus is was, that the evil of their work has afflicted them, and they will be surrounded by that which they used to mock.", "verse": 34, "surah": 16}, {"quran": "And those who were polytheists said: \"If God had wished, we would not have served a thing other than Him; neither us nor our fathers; nor would we have made unlawful anything other than from Him.\" Those before them did exactly the same thing; so are the messengers required to do anything except deliver with clarity?", "verse": 35, "surah": 16}, {"quran": "And We have sent a messenger to every nation: \"You shall serve God and avoid evil.\" Some of them were guided by God, and some of them deserved to be misguided. So travel the earth, and see how the punishment was of those who denied.", "verse": 36, "surah": 16}, {"quran": "If you are concerned for their guidance, God does not guide whom He misguides; and they will have no supporters.", "verse": 37, "surah": 16}, {"quran": "And they swore by God, in their strongest oaths, that God will not resurrect he who dies. No, it is a promise of truth upon Him, but most of the people do not know.", "verse": 38, "surah": 16}, {"quran": "So that He will clarify for them that in which they have disputed, and so that those who have rejected will know that they were liars.", "verse": 39, "surah": 16}, {"quran": "Indeed, Our saying to a thing, if We wanted it, is that We say to it: 'Be,' and it is.", "verse": 40, "surah": 16}, {"quran": "And those who have emigrated for God, after they were oppressed, We will grant them good in the world, and the reward of the Hereafter will be greater, if only they knew.", "verse": 41, "surah": 16}, {"quran": "Those who are patient, and put their trust in their Lord.", "verse": 42, "surah": 16}, {"quran": "And We did not send any except men before you whom We inspired, so ask the people who have received the Reminder if you do not know.", "verse": 43, "surah": 16}, {"quran": "With proofs and the scriptures. And We sent down to you the Reminder to reveal to the people what was sent to them, and perhaps they will think.", "verse": 44, "surah": 16}, {"quran": "Have those who schemed evil guaranteed that God will not make the earth swallow them, or the retribution come to them from where they do not expect?", "verse": 45, "surah": 16}, {"quran": "Or that He will take them in their sleep? For they cannot stop it.", "verse": 46, "surah": 16}, {"quran": "Or that He will take them while they are in a state of fear? Your Lord is Compassionate, Merciful.", "verse": 47, "surah": 16}, {"quran": "Have they not seen that what God has created of a thing, its shadow inclines to the right and the left in prostration to God; and they are humbled!", "verse": 48, "surah": 16}, {"quran": "And to God prostrate all those in the heavens and all those on the earth, from the creatures and the angels, and they are not arrogant.", "verse": 49, "surah": 16}, {"quran": "They fear their Lord from above them, and they do what they are commanded.", "verse": 50, "surah": 16}, {"quran": "And God said: \"Do not take two gods, there is only One god, so it is Me that you shall reverence.\"", "verse": 51, "surah": 16}, {"quran": "And to Him is what is in the heavens and the earth, and the system shall be to Him. Is it other than God that you shall be aware of?", "verse": 52, "surah": 16}, {"quran": "And any blessing that is with you is from God. Then, when harm afflicts you, to Him you cry out.", "verse": 53, "surah": 16}, {"quran": "Then, when He removes the harm from you, a group of you set up partners with their Lord!", "verse": 54, "surah": 16}, {"quran": "So they reject what We have given them. Enjoy, for you will come to know.", "verse": 55, "surah": 16}, {"quran": "And they allocate a portion from what We provide for them to that which they have no knowledge of. By God, you will be asked about the lies you have invented!", "verse": 56, "surah": 16}, {"quran": "And they assign daughters to God; be He glorified; and to them is what they desire.", "verse": 57, "surah": 16}, {"quran": "And when one of them is given news of a female, his face becomes darkened and he is in grief!", "verse": 58, "surah": 16}, {"quran": "He hides from his people because of the bad news he has received. Shall he keep her with dishonor, or bury her in the sand? Miserable indeed is how they judge!", "verse": 59, "surah": 16}, {"quran": "To those who do not believe in the Hereafter is the worst example, and to God is the highest example, and He is the Noble, the Wise.", "verse": 60, "surah": 16}, {"quran": "And if God were to call the people to account for their transgression, He would not have left on it a single creature. But He delays them to a determined time; so when their time comes, they do not delay by one hour and they do not advance.", "verse": 61, "surah": 16}, {"quran": "And they assign to God what they hate, and their tongues describe with lies that they will have what is good. No doubt they will have the Fire, for they have rebelled.", "verse": 62, "surah": 16}, {"quran": "By God, We had sent to nations before you, but the devil adorned their work for them. So he is their ally today, and they will have a painful retribution.", "verse": 63, "surah": 16}, {"quran": "And We have not sent down the Book to you except that you may clarify for them that in which they have disputed, and as a guidance and a mercy for a people who believe.", "verse": 64, "surah": 16}, {"quran": "And God has sent down water from the sky, so He revives the land with it after its death. In that is a sign for a people who listen.", "verse": 65, "surah": 16}, {"quran": "And for you there is a lesson in the livestock; We give you to drink from what is in its belly between the digested food and the blood, a pure milk which is relieving for the drinkers.", "verse": 66, "surah": 16}, {"quran": "And from the fruits of the palm trees and the grapes you make strong drink and a good provision. In that is a sign for a people who comprehend.", "verse": 67, "surah": 16}, {"quran": "And your Lord inspired to the bees: \"You shall take homes of the mountains and of the trees and of what they erect.\"", "verse": 68, "surah": 16}, {"quran": "\"Then you shall eat from every fruit, so seek the path your Lord has made easy.\" From its belly will emerge a liquid that has different colors, in it is a healing for the people. In that is a sign for a people who will think.", "verse": 69, "surah": 16}, {"quran": "And God has created you, then He will terminate your lives. And some of you will continue to old age so that he will not know anything more after his knowledge. God is Knowledgeable, Capable.", "verse": 70, "surah": 16}, {"quran": "And God has preferred some of you over others in provision. Yet, those who have been preferred will not relinquish their provision to those who are maintained by their oaths, that they may become equal in it. Is it the favor of God that they deny?", "verse": 71, "surah": 16}, {"quran": "And God has made for you mates from among yourselves, and He has made from your mates sons and grandchildren, and He has provided you from the good provisions. Is it the falsehood that they believe in, while the favor of God they reject?", "verse": 72, "surah": 16}, {"quran": "And they serve besides God that which does not and cannot possess anything of the provisions from the heaven or the earth.", "verse": 73, "surah": 16}, {"quran": "So do not give examples to God. God knows while you do not know.", "verse": 74, "surah": 16}, {"quran": "God puts forth the example of a slave who is owned and cannot achieve anything, against one whom We have provided a good provision which he spends of it secretly and openly. Are they the same? Praise be to God, but most of them do not know.", "verse": 75, "surah": 16}, {"quran": "And God puts forth the example of two men, one of them is mute and he cannot achieve anything, and he is a burden to his guardian. Wherever he points him, he does not come with any good. Is he the same as one who orders good and he is upon a straight path?", "verse": 76, "surah": 16}, {"quran": "And to God is the unseen of the heavens and the earth, and the matter of the Hour is like the blink of the eye or nearer. God is capable of all things.", "verse": 77, "surah": 16}, {"quran": "And God brought you out of the wombs of your mothers while you knew nothing. And He has made for you the hearing and the eyesight and the heart, perhaps you would be thankful.", "verse": 78, "surah": 16}, {"quran": "Have they not looked at the birds held in the atmosphere of the sky? No one holds them up except God. In that are signs for a people who believe.", "verse": 79, "surah": 16}, {"quran": "And God has made your homes a habitat, and He has made for you from the hides of the livestock homes which you find light when you travel and when you camp; and from its wool, fur, and hair you make furnishings and goods, until a time.", "verse": 80, "surah": 16}, {"quran": "And God has made for you shade from what He has created, and He has made from the mountains a refuge for you, and He has made for you garments which protect you from the heat, and garments which protect you from attack. It is such that He completes His blessings upon you, that perhaps you may submit.", "verse": 81, "surah": 16}, {"quran": "So if they turn away, then you are only required to deliver clearly.", "verse": 82, "surah": 16}, {"quran": "They recognize the blessings of God, then they deny them. And most of them are rejecters.", "verse": 83, "surah": 16}, {"quran": "And the Day We send from every nation a witness, then those who have rejected will not be given leave, nor will they be allowed to repent.", "verse": 84, "surah": 16}, {"quran": "And then those who were wicked will see the retribution; it will not be lightened for them, nor will they be given respite.", "verse": 85, "surah": 16}, {"quran": "And when those who were polytheists saw their partners, they said: \"Our Lord, these are our partners that we used to call upon besides You.\" But they returned in answer to them: \"You are liars!\"", "verse": 86, "surah": 16}, {"quran": "And they offered submission to God on that Day; and what they had invented abandoned them!", "verse": 87, "surah": 16}, {"quran": "Those who rejected, and repelled others from the path of God, We have added them retribution over the retribution, for what they had corrupted.", "verse": 88, "surah": 16}, {"quran": "And the Day We send to every nation a witness against them from themselves, and We have brought you as a witness against these. And We have sent down to you the Book as a clarification for all things, and a guidance and a mercy and good tidings to those who have submitted.", "verse": 89, "surah": 16}, {"quran": "God orders justice and goodness and that you shall help your relatives, and He prohibits immorality and vice and transgression. He warns you that you may remember.", "verse": 90, "surah": 16}, {"quran": "And fulfill your pledge to God when you pledge so, and do not break your oath after making it, for you have made God a sponsor over you. God is aware of what you do.", "verse": 91, "surah": 16}, {"quran": "And do not be like she who unraveled her knitting after it had become strong, by breaking your oaths as a means of deception between you. That a nation shall be more numerous than another nation, for God puts you to the test by it. And He will show you on the Day of Resurrection that which you were disputing in.", "verse": 92, "surah": 16}, {"quran": "And if God had wished, He would have made you one nation, but He misguides whom He wishes, and He guides whom He wishes. And you will be asked about what you used to do.", "verse": 93, "surah": 16}, {"quran": "And do not use your oaths as a means of deception between you, that a foot will slip after it has been made firm, and you will taste the evil of turning away from the path of God, and you will have a great retribution.", "verse": 94, "surah": 16}, {"quran": "And do not purchase with the pledge of God a cheap price. What is with God is far better for you if you know.", "verse": 95, "surah": 16}, {"quran": "What you have will run out, while what God has will remain. And We will deliver to those who are patient their reward for the best of what they used to do.", "verse": 96, "surah": 16}, {"quran": "Whoever does good works, whether male or female, and is a believer, We will give him a good life and We will reward them their dues with the best of what they used to do.", "verse": 97, "surah": 16}, {"quran": "When you read the Qur'an, you shall seek refuge with God from the outcast devil.", "verse": 98, "surah": 16}, {"quran": "He has no authority over those who believe, and who put their trust in their Lord.", "verse": 99, "surah": 16}, {"quran": "His authority is over those who follow him, and set him up as a partner.", "verse": 100, "surah": 16}, {"quran": "nd if We exchange a revelation in place of another revelation; and God is more aware of what He is revealing; they say: \"You are making this up!\" Alas, most of them do not know.", "verse": 101, "surah": 16}, {"quran": "Say: \"The Holy Spirit has brought it down from your Lord with the truth, so that those who believe will be strengthened, and as a guidance and good news for those who have submitted.\"", "verse": 102, "surah": 16}, {"quran": "And We are aware that they say: \"A mortal is teaching him.\" The tongue of the one they refer to is foreign, while this is a clear Arabic tongue.", "verse": 103, "surah": 16}, {"quran": "hose who do not believe in the revelations of God, God will not guide them, and they will have a painful retribution.", "verse": 104, "surah": 16}, {"quran": "nventing fabrications is only done by those who do not believe in the revelations of God; and these are the liars.", "verse": 105, "surah": 16}, {"quran": "hoever rejects God after having believed-except for he who is forced while his heart is still content with belief-and has comforted his chest towards rejection, then these will have a wrath from God and they will have a great retribution.", "verse": 106, "surah": 16}, {"quran": "hat is because they have preferred the worldly life over the Hereafter, and God does not guide the rejecting people.", "verse": 107, "surah": 16}, {"quran": "hose are the ones whom God has stamped on their hearts, and their hearing, and their sight, and these are the unaware ones.", "verse": 108, "surah": 16}, {"quran": "Without doubt, in the Hereafter they are the losers.", "verse": 109, "surah": 16}, {"quran": "Then your Lord is; for those who emigrated after they were persecuted, then they strived and were patient; your Lord is, after that, Forgiver, Merciful.", "verse": 110, "surah": 16}, {"quran": "The Day every soul will come to argue for itself, and every soul will be paid in full for what it did, and they will not be wronged.", "verse": 111, "surah": 16}, {"quran": "nd God puts forth the example of a town which was peaceful and content, its provisions were coming to it bountifully from all places, but then it rebelled against the blessings of God, and God made it taste hunger and fear for what they used to do.", "verse": 112, "surah": 16}, {"quran": "And a messenger came to them from themselves, but they denied him, so the punishment took them while they were wicked.", "verse": 113, "surah": 16}, {"quran": "o eat from what God has provided you, that which is good and lawful, and be thankful for the blessing of God, if it is indeed He whom you serve.", "verse": 114, "surah": 16}, {"quran": "e has only forbidden for you carrion, and blood, and the meat of pig, and what was dedicated to other than God. But whoever is forced to, without seeking disobedience or transgression, then God is Forgiver, Merciful.", "verse": 115, "surah": 16}, {"quran": "nd do not say, as to what your tongues falsely describe: \"This is lawful, and that is forbidden;\" that you seek to invent lies about God. Those who invent lies about God will not succeed.", "verse": 116, "surah": 16}, {"quran": "A small enjoyment, and they will have a painful retribution.", "verse": 117, "surah": 16}, {"quran": "And for those who are Jewish, We forbade what We told to you before. And We did not wrong them, but they were wronging themselves.", "verse": 118, "surah": 16}, {"quran": "Then your Lord to those who do evil out of ignorance, then they repent after that and they make good, your Lord after that is Forgiver, Merciful.", "verse": 119, "surah": 16}, {"quran": "braham was a nation, devoted to God, a monotheist, and he was not of the polytheists.", "verse": 120, "surah": 16}, {"quran": "Thankful for His blessings. He chose him and guided him to a straight path.", "verse": 121, "surah": 16}, {"quran": "And We gave him good in this world, and in the Hereafter he is of the upright ones.", "verse": 122, "surah": 16}, {"quran": "Then We inspired to you: \"You shall follow the creed of Abraham, monotheism, and he was not of the polytheists.\"", "verse": 123, "surah": 16}, {"quran": "Indeed, the Sabbath was only decreed for those who had disputed in it, and your Lord will judge between them for that in which they had disputed.", "verse": 124, "surah": 16}, {"quran": "Invite to the path of your Lord with wisdom and good advice, and argue with them in that which is better. Your Lord is fully aware of who is misguided from His path, and He is fully aware of the guided ones.", "verse": 125, "surah": 16}, {"quran": "And if you punish, then punish with equivalence to that which you were punished. And if you are patient then it is better for the patient ones.", "verse": 126, "surah": 16}, {"quran": "nd be patient, for your patience is on none except God. And do not grieve for them, and do not be depressed by what they scheme.", "verse": 127, "surah": 16}, {"quran": "God is with those who are aware and are good doers.", "verse": 128, "surah": 16}]]