[[{"quran": "In the name of God, the Almighty, the Merciful.", "verse": 0, "surah": 44}, {"quran": "HM.", "verse": 1, "surah": 44}, {"quran": "And the clarifying Book.", "verse": 2, "surah": 44}, {"quran": "We have sent it down in a blessed night-We were surely to warn.", "verse": 3, "surah": 44}, {"quran": "In it is a distinction for all decree of wisdom.", "verse": 4, "surah": 44}, {"quran": "A decree from Us-We were surely to send.", "verse": 5, "surah": 44}, {"quran": "A mercy from your Lord. He is the Hearer, the Knowledgeable.", "verse": 6, "surah": 44}, {"quran": "The Lord of the heavens and the earth, and everything between them. If you were certain!", "verse": 7, "surah": 44}, {"quran": "There is no god except He. He gives life and causes death; your Lord and the Lord of your ancestors.", "verse": 8, "surah": 44}, {"quran": "No; they are in doubt, playing.", "verse": 9, "surah": 44}, {"quran": "Therefore, watch for the day when the heaven will bring a visible smoke.", "verse": 10, "surah": 44}, {"quran": "It will envelop the people: \"This is a painful retribution!\"", "verse": 11, "surah": 44}, {"quran": "\"Our Lord, remove the retribution from us; we are believers.\"", "verse": 12, "surah": 44}, {"quran": "How is it that now they remember, while a clarifying messenger had come to them?", "verse": 13, "surah": 44}, {"quran": "But then, they turned away from him and said: \"Clearly educated, but crazy!\"", "verse": 14, "surah": 44}, {"quran": "We will remove the retribution in a while; you will then return back.", "verse": 15, "surah": 44}, {"quran": "On the Day We strike the great strike, We will avenge.", "verse": 16, "surah": 44}, {"quran": "And We had tested before them the people of Pharaoh, and an honorable messenger came to them.", "verse": 17, "surah": 44}, {"quran": "\"Restore to me the servants of God. I am a trustworthy messenger to you.\"", "verse": 18, "surah": 44}, {"quran": "\"And, do not transgress against God. I come to you with clear authority.\"", "verse": 19, "surah": 44}, {"quran": "\"And I seek refuge with my Lord and your Lord, should you stone me.\"", "verse": 20, "surah": 44}, {"quran": "\"And if you do not believe in me, then have no dealing with me.\"", "verse": 21, "surah": 44}, {"quran": "Subsequently, he called on his Lord: \"These are a criminal people.\"", "verse": 22, "surah": 44}, {"quran": "You shall travel with My servants during the night; you will be pursued.", "verse": 23, "surah": 44}, {"quran": "And cross the sea quickly; their troops will be drowned.", "verse": 24, "surah": 44}, {"quran": "How many gardens and springs did they leave behind?", "verse": 25, "surah": 44}, {"quran": "And crops and an honorable station?", "verse": 26, "surah": 44}, {"quran": "And blessings that they enjoyed?", "verse": 27, "surah": 44}, {"quran": "Thus it was; and We caused another people to inherit it.", "verse": 28, "surah": 44}, {"quran": "Neither the heaven, nor the earth wept over them, and they were not respited.", "verse": 29, "surah": 44}, {"quran": "And We saved the Children of Israel from the humiliating agony.", "verse": 30, "surah": 44}, {"quran": "From Pharaoh; he was a transgressing tyrant.", "verse": 31, "surah": 44}, {"quran": "And We have chosen them, out of knowledge, over the worlds.", "verse": 32, "surah": 44}, {"quran": "And We granted them signs, which constituted a great test.", "verse": 33, "surah": 44}, {"quran": "These people now are saying:", "verse": 34, "surah": 44}, {"quran": "\"There is nothing except our first death; and we will never be resurrected!\"", "verse": 35, "surah": 44}, {"quran": "\"So bring back our forefathers, if you are truthful!\"", "verse": 36, "surah": 44}, {"quran": "Are they better or the people of Tubba` and those before them? We destroyed them, they were criminals.", "verse": 37, "surah": 44}, {"quran": "And We have not created the heavens and the earth, and everything between them, for mere play.", "verse": 38, "surah": 44}, {"quran": "We did not create them except with the truth, but most of them do not know.", "verse": 39, "surah": 44}, {"quran": "Surely, the Day of Separation is the appointment for them all.", "verse": 40, "surah": 44}, {"quran": "That is the Day when no friend can help his friend in any way; nor will they be helped.", "verse": 41, "surah": 44}, {"quran": "Except him on whom God has mercy. He is the Noble, the Merciful.", "verse": 42, "surah": 44}, {"quran": "Surely, the tree of Bitterness,", "verse": 43, "surah": 44}, {"quran": "Will be the food for the sinful.", "verse": 44, "surah": 44}, {"quran": "Like hot oil, it will boil in the bellies.", "verse": 45, "surah": 44}, {"quran": "Like the boiling of liquid.", "verse": 46, "surah": 44}, {"quran": "\"Take him and throw him into the midst of Hell.\"", "verse": 47, "surah": 44}, {"quran": "\"Then pour upon his head the retribution of boiling liquid.\"", "verse": 48, "surah": 44}, {"quran": "\"Taste this; surely you are the noble, the generous!\"", "verse": 49, "surah": 44}, {"quran": "Surely, this is what you used to doubt!", "verse": 50, "surah": 44}, {"quran": "The righteous will be in a station of security.", "verse": 51, "surah": 44}, {"quran": "Among gardens and springs.", "verse": 52, "surah": 44}, {"quran": "Wearing silk and satin; facing each other.", "verse": 53, "surah": 44}, {"quran": "So it is, and We married them to wonderful companions.", "verse": 54, "surah": 44}, {"quran": "They enjoy in it all kinds of fruits, in perfect peace.", "verse": 55, "surah": 44}, {"quran": "They do not taste death therein except for the first death, and He has spared them the retribution of Hell.", "verse": 56, "surah": 44}, {"quran": "As a blessing from your Lord. Such is the great triumph.", "verse": 57, "surah": 44}, {"quran": "We have thus made it easy in your language, perhaps they may take heed.", "verse": 58, "surah": 44}, {"quran": "Therefore, watch; for they too will be watching.", "verse": 59, "surah": 44}]]