[[{"quran": "In the name of God, the Almighty, the Merciful.", "verse": 0, "surah": 52}, {"quran": "By the mount.", "verse": 1, "surah": 52}, {"quran": "And a recorded Book.", "verse": 2, "surah": 52}, {"quran": "In parchment published.", "verse": 3, "surah": 52}, {"quran": "And the constructed Shrine.", "verse": 4, "surah": 52}, {"quran": "And the ceiling which is raised.", "verse": 5, "surah": 52}, {"quran": "And the sea that is overflowing.", "verse": 6, "surah": 52}, {"quran": "The retribution of your Lord is unavoidable.", "verse": 7, "surah": 52}, {"quran": "Nothing can stop it.", "verse": 8, "surah": 52}, {"quran": "The Day when the heaven will violently thunder.", "verse": 9, "surah": 52}, {"quran": "And the mountains will be wiped out.", "verse": 10, "surah": 52}, {"quran": "Woe on that Day to the deniers.", "verse": 11, "surah": 52}, {"quran": "Who are in their recklessness, playing.", "verse": 12, "surah": 52}, {"quran": "The Day they will be called into Hell, forcibly:", "verse": 13, "surah": 52}, {"quran": "\"This is the Fire which you used to deny!\"", "verse": 14, "surah": 52}, {"quran": "\"Is this magic, or do you not see?\"", "verse": 15, "surah": 52}, {"quran": "\"Enter it, whether you are patient or impatient, it will be the same for you. You are only being requited for what you used to do.\"", "verse": 16, "surah": 52}, {"quran": "The righteous are in gardens and bliss.", "verse": 17, "surah": 52}, {"quran": "Delighted by what their Lord has granted them; and their Lord has spared them the retribution of Hell.", "verse": 18, "surah": 52}, {"quran": "Eat and drink happily because of what you used to do.", "verse": 19, "surah": 52}, {"quran": "They recline on arranged beds, and We married them to wonderful companions.", "verse": 20, "surah": 52}, {"quran": "And those who believed, and their progeny also followed them in belief; We will have their progeny join them. We never fail to reward them for any work. Every person is paid for what he did.", "verse": 21, "surah": 52}, {"quran": "We will supply them with fruit and meat such as they desire.", "verse": 22, "surah": 52}, {"quran": "They will enjoy drinks therein, from which there is no nonsense, nor blame.", "verse": 23, "surah": 52}, {"quran": "And around them will be children like protected pearls.", "verse": 24, "surah": 52}, {"quran": "And they came to one another asking.", "verse": 25, "surah": 52}, {"quran": "They said: \"We used to be compassionate among our people.\"", "verse": 26, "surah": 52}, {"quran": "\"God thus blessed us, and has spared us the agony of the fierce hot winds.\"", "verse": 27, "surah": 52}, {"quran": "\"We used to implore Him before; He is the Kind, the Merciful.\"", "verse": 28, "surah": 52}, {"quran": "Therefore, you shall remind. For by the grace of your Lord, you are neither a soothsayer, nor crazy.", "verse": 29, "surah": 52}, {"quran": "Or do they say: \"He is a poet; so let us just wait until a disaster befalls him.\"", "verse": 30, "surah": 52}, {"quran": "Say: \"Continue waiting; for I will wait along with you.\"", "verse": 31, "surah": 52}, {"quran": "Or do their dreams dictate this to them, or are they a transgressing people?", "verse": 32, "surah": 52}, {"quran": "Or do they say: \"He made it all up\"? No, they simply do not believe.", "verse": 33, "surah": 52}, {"quran": "Let them produce a narrative like this, if they are truthful.", "verse": 34, "surah": 52}, {"quran": "Or were they created from nothing? Or was it them who have created?", "verse": 35, "surah": 52}, {"quran": "Or did they create the heavens and the earth? No, they do not comprehend.", "verse": 36, "surah": 52}, {"quran": "Or do they possess the treasures of your Lord? Are they in control?", "verse": 37, "surah": 52}, {"quran": "Or do they have a stairway that enables them to listen? Then let their listeners show their proof.", "verse": 38, "surah": 52}, {"quran": "Or to Him belong the daughters, and to you belong the sons?", "verse": 39, "surah": 52}, {"quran": "Or do you ask them for a wage, so they are burdened by the fine?", "verse": 40, "surah": 52}, {"quran": "Or do they know the future, thus they have it recorded?", "verse": 41, "surah": 52}, {"quran": "Or do they want to make a plan? Indeed, it is the rejecters who are being planned against.", "verse": 42, "surah": 52}, {"quran": "Or do they have another god besides God? God be glorified above what they set up.", "verse": 43, "surah": 52}, {"quran": "And if they see a portion from the heaven falling, they will say: \"Piled clouds!\"", "verse": 44, "surah": 52}, {"quran": "So disregard them until they meet their Day in which they are stricken.", "verse": 45, "surah": 52}, {"quran": "The Day when their scheming will not protect them in the least, nor will they be helped.", "verse": 46, "surah": 52}, {"quran": "And for those who transgressed will be a retribution beyond this, but most of them do not know.", "verse": 47, "surah": 52}, {"quran": "You shall be patient for the judgment of your Lord, for you are in Our sights; and glorify the praise of your Lord when you rise.", "verse": 48, "surah": 52}, {"quran": "Also from the night glorify Him, and at the fading of the stars.", "verse": 49, "surah": 52}]]