[[{"quran": "In the name of God, the Almighty, the Merciful.", "verse": 0, "surah": 60}, {"quran": "O you who believe, do not take My enemy and your enemy as allies. You extend love to them, even though they have rejected the truth that has come to you. They drive you and the messenger out, simply because you believe in God, your Lord. If you are mobilizing to strive in My cause, seeking My blessings, then how can you secretly love them? I am fully aware of everything you conceal and what you declare. And whoever of you does this, then he has gone astray from the right path.", "verse": 1, "surah": 60}, {"quran": "If they encounter you, they treat you as enemies, and they extend their hands and tongues against you to hurt you. They desire that you reject.", "verse": 2, "surah": 60}, {"quran": "Neither your relatives nor your children will benefit you; on the Day of Resurrection He will separate between you. And God is Seer of what you do.", "verse": 3, "surah": 60}, {"quran": "There has been a good example set for you by Abraham and those with him, when they said to their people: \"We are innocent from you and what you serve besides God. We have rejected you, and it appears that there shall be animosity and hatred between us and you until you believe in God alone.\" Except for the saying of Abraham to his father: \"I will ask forgiveness for you, but I do not possess any power to protect you from God.\" \"Our Lord, we have put our trust in You, and we turn to You, and to You is the final destiny.\"", "verse": 4, "surah": 60}, {"quran": "\"Our Lord, do not let us become a test for those who rejected, and forgive us. Our Lord, You are the Noble, the Wise.\"", "verse": 5, "surah": 60}, {"quran": "Certainly, a good example has been set by them for those who seek God and the Last Day. And whoever turns away, then God is the Rich, the Praiseworthy.", "verse": 6, "surah": 60}, {"quran": "Perhaps God will grant compassion between you and those you consider enemies; and God is Capable. And God is Forgiving, Merciful.", "verse": 7, "surah": 60}, {"quran": "God does not prohibit you from those who have not fought you because of your system, nor drove you out of your homes, that you deal kindly and equitably with them. For God loves the equitable.", "verse": 8, "surah": 60}, {"quran": "But God does prohibit you regarding those who fought you because of your system, and drove you out of your homes, and helped to drive you out. You shall not ally with them. Those who ally with them, then such are the transgressors.", "verse": 9, "surah": 60}, {"quran": "O you who believe, if the believing females come emigrating to you, then you shall test them. God is fully aware of their belief. Thus, if you establish that they are believers, then you shall not return them to the rejecters. They are no longer lawful for one another. And return the dowries that were paid. And there is no sin upon you to marry them, if you have paid their dowries to them. And do not keep disbelieving wives, and ask back what dowries you paid. And let them ask back what dowries they had paid. Such is the judgment of God; He judges between you. God is Knowledgeable, Wise.", "verse": 10, "surah": 60}, {"quran": "And if any of your wives have gone over to the camp of the rejecters, and you are granted victory over them, then you shall compensate those whose wives have gone over, to the equivalent of what dowry they spent. And be aware of God, in whom you believe.", "verse": 11, "surah": 60}, {"quran": "O prophet, if the believing females come to make allegiance to you that they will not set up anything besides God, nor steal, nor commit adultery, nor kill their children, nor fabricate any falsehood, nor disobey you in any matter which is righteous, then you shall accept their allegiance, and ask God to forgive them. God is Forgiver, Merciful.", "verse": 12, "surah": 60}, {"quran": "O you who believe, do not ally a people with whom God is angry; for they have given up regarding the Hereafter, just like the rejecters have given up on the people who are already in the graves.", "verse": 13, "surah": 60}]]