[[{"quran": "In the name of God, the Almighty, the Merciful.", "verse": 0, "surah": 36}, {"quran": "YS.", "verse": 1, "surah": 36}, {"quran": "And the Qur'an of wisdom.", "verse": 2, "surah": 36}, {"quran": "You are one of the messengers.", "verse": 3, "surah": 36}, {"quran": "Upon a straight path.", "verse": 4, "surah": 36}, {"quran": "The revelation of the Most Honorable, the Merciful.", "verse": 5, "surah": 36}, {"quran": "To warn a people whose fathers were not warned, for they are unaware.", "verse": 6, "surah": 36}, {"quran": "The retribution has been deserved by most of them, for they do not believe.", "verse": 7, "surah": 36}, {"quran": "We have placed shackles around their necks, up to their chins, so that they are forced in place.", "verse": 8, "surah": 36}, {"quran": "And We have placed a barrier in front of them, and a barrier behind them, thus We shielded them so they cannot see.", "verse": 9, "surah": 36}, {"quran": "And whether you warn them or do not warn them, they will not believe.", "verse": 10, "surah": 36}, {"quran": "You can only warn him who follows the Reminder, and is concerned towards the Almighty while unseen. Give him good news of forgiveness and a generous reward.", "verse": 11, "surah": 36}, {"quran": "It is indeed Us who resurrect the dead, and We record what they have done and left behind. And everything We have counted in a clear guide.", "verse": 12, "surah": 36}, {"quran": "And put forth for them the example of the people of the town, when the messengers came to it.", "verse": 13, "surah": 36}, {"quran": "Where We sent two to them, but they disbelieved in them, so We supported them with a third one, thus they said: \"We are messengers to you.\"", "verse": 14, "surah": 36}, {"quran": "They said: \"You are but mortals like us, and the Almighty did not send down anything, you are only telling lies.\"", "verse": 15, "surah": 36}, {"quran": "They said: \"Our Lord knows that we have been sent to you.\"", "verse": 16, "surah": 36}, {"quran": "\"And we are only required to give a clear delivery.\"", "verse": 17, "surah": 36}, {"quran": "They said: \"We have welcomed you better than you deserve. If you do not cease, we will stone you, and you will receive a painful retribution from us!\"", "verse": 18, "surah": 36}, {"quran": "They said: \"Keep your welcome with you, for you have been reminded. Indeed, you are transgressing people.\"", "verse": 19, "surah": 36}, {"quran": "And a man came running from the farthest part of the city, saying: \"O my people, follow the messengers.\"", "verse": 20, "surah": 36}, {"quran": "\"Follow those who do not ask you for any wage, and are guided.\"", "verse": 21, "surah": 36}, {"quran": "\"And why should I not serve the One who initiated me, and to Him is your ultimate return?\"", "verse": 22, "surah": 36}, {"quran": "\"Shall I take gods besides Him? If the Almighty intends any harm for me, their intercession cannot help me in the least, nor can they save me.\"", "verse": 23, "surah": 36}, {"quran": "\"Then I would be clearly astray.\"", "verse": 24, "surah": 36}, {"quran": "\"I have believed in your Lord, so listen to me!\"", "verse": 25, "surah": 36}, {"quran": "It was said: \"Enter Paradise.\" He said \"Oh, how I wish if only my people knew!\"", "verse": 26, "surah": 36}, {"quran": "\"Of what my Lord has forgiven me, and made me of the honored ones.\"", "verse": 27, "surah": 36}, {"quran": "And We did not send down upon his people after him soldiers from the heaven; for there was no need to send them down.", "verse": 28, "surah": 36}, {"quran": "For all it took was one scream, whereupon they were stilled.", "verse": 29, "surah": 36}, {"quran": "What sorrow for the servants. For every time a messenger went to them, they would mock him.", "verse": 30, "surah": 36}, {"quran": "Did they not see how many generations We destroyed before them, do they not go back to them?", "verse": 31, "surah": 36}, {"quran": "And how every one of them will be summoned before Us.", "verse": 32, "surah": 36}, {"quran": "And a sign for them is the dead land, We revive it and produce from it seeds from which they eat.", "verse": 33, "surah": 36}, {"quran": "And We made in it gardens of date palms, and grapes, and We cause springs to gush forth therein.", "verse": 34, "surah": 36}, {"quran": "So that they may eat from its fruits, and what they manufacture with their own hands. Would they be thankful?", "verse": 35, "surah": 36}, {"quran": "Praise be to the One who has created all pairs from what the earth sprouts out and from themselves, and from what they do not know.", "verse": 36, "surah": 36}, {"quran": "And a sign for them is the night, We strip the daylight from it, whereupon they are in darkness.", "verse": 37, "surah": 36}, {"quran": "And the sun runs to a specific destination, such is the design of the Noble, the Knowledgeable.", "verse": 38, "surah": 36}, {"quran": "And the moon We have measured it to appear in stages, until it returns like an old palm sheath.", "verse": 39, "surah": 36}, {"quran": "The sun is not required to overtake the moon, nor will the night precede the day; each of them is swimming in its own orbit.", "verse": 40, "surah": 36}, {"quran": "And a sign for them is that We carried their ancestors on the charged ship.", "verse": 41, "surah": 36}, {"quran": "And We created for them of its similarity, to ride in.", "verse": 42, "surah": 36}, {"quran": "And if We wished, We could drown them, so that their screaming would not be heard, nor could they be saved.", "verse": 43, "surah": 36}, {"quran": "Except through a mercy from Us, and as an enjoyment for awhile.", "verse": 44, "surah": 36}, {"quran": "And when they are told: \"Be aware of your present and your past, that you may attain mercy.\"", "verse": 45, "surah": 36}, {"quran": "And no matter what sign comes to them from the signs of their Lord, they turn away from it.", "verse": 46, "surah": 36}, {"quran": "And when they are told: \"Spend from what God has provisioned you.\" Those who reject say to those who believe: \"Shall we feed those whom God could feed, if He so willed? You are clearly misguided!\"", "verse": 47, "surah": 36}, {"quran": "And they say: \"When is this promise to come, if you are truthful?\"", "verse": 48, "surah": 36}, {"quran": "They will not realize it when one scream overwhelms them, while they dispute.", "verse": 49, "surah": 36}, {"quran": "They will not even be able to leave a will, nor will they be able to return to their people.", "verse": 50, "surah": 36}, {"quran": "And the horn will be blown, whereupon they will rise from the graves massing towards their Lord.", "verse": 51, "surah": 36}, {"quran": "They will say: \"Woe to us! Who has resurrected us from our resting place? This is what the Almighty had promised; and the messengers were truthful!\"", "verse": 52, "surah": 36}, {"quran": "It only took one scream, whereupon they are summoned before Us.", "verse": 53, "surah": 36}, {"quran": "On this Day, no soul will be wronged in the least. You will be recompensed precisely for whatever you did.", "verse": 54, "surah": 36}, {"quran": "The dwellers of Paradise will be, on that Day, joyfully busy.", "verse": 55, "surah": 36}, {"quran": "Both them and their spouses, they will be shaded, reclining on raised couches.", "verse": 56, "surah": 36}, {"quran": "They will have fruits therein; they will have in it whatever they ask for.", "verse": 57, "surah": 36}, {"quran": "Saying of: \"Peace\" from a Merciful Lord.", "verse": 58, "surah": 36}, {"quran": "\"As for you, O criminals, you are singled out.\"", "verse": 59, "surah": 36}, {"quran": "\"Did I not pledge to you, O Children of Adam, that you should not serve the devil for he is your most ardent enemy?\"", "verse": 60, "surah": 36}, {"quran": "\"And that you should serve Me? That is a straight path.\"", "verse": 61, "surah": 36}, {"quran": "\"He has misled mountain loads of you. Did you not comprehend?\"", "verse": 62, "surah": 36}, {"quran": "\"This is Hell that you have been promised!\"", "verse": 63, "surah": 36}, {"quran": "\"Burn in it today, as a consequence of your rejection.\"", "verse": 64, "surah": 36}, {"quran": "Today, We shall cease their mouths, and their hands will speak to Us, and their feet will bear witness to everything they had done.", "verse": 65, "surah": 36}, {"quran": "And if We wished, We can blind their eyes, and they would race towards the path, but how would they see?", "verse": 66, "surah": 36}, {"quran": "And if We wished, We can freeze them in their place; thus, they can neither move forward, nor go back.", "verse": 67, "surah": 36}, {"quran": "And for whoever We grant a long life, We weaken him in body. Do they not comprehend?", "verse": 68, "surah": 36}, {"quran": "And We did not teach him poetry, nor does he need it. This is a reminder and a clear Qur'an.", "verse": 69, "surah": 36}, {"quran": "To warn those who are alive, and so that the retribution will be deserved by the rejecters.", "verse": 70, "surah": 36}, {"quran": "Did they not see that We created for them with Our own hands livestock which they own?", "verse": 71, "surah": 36}, {"quran": "And they were subdued by Us for them. So some they ride, and some they eat.", "verse": 72, "surah": 36}, {"quran": "And they have benefits in them, and to drink. Would they not be thankful?", "verse": 73, "surah": 36}, {"quran": "And they have taken besides God other gods, perhaps they will help them!", "verse": 74, "surah": 36}, {"quran": "They cannot help them; while they are soldiers for them.", "verse": 75, "surah": 36}, {"quran": "So do not be saddened by what they say. We are fully   aware of what they conceal and what they declare.", "verse": 76, "surah": 36}, {"quran": "Has the human being not seen that We have created him from a seed, but he then becomes a clear opponent?", "verse": 77, "surah": 36}, {"quran": "And he puts forth an example for Us, while forgetting his own creation! He says: \"Who can resurrect the bones while they are dust?\"", "verse": 78, "surah": 36}, {"quran": "Say: \"The One who has made them in the first place will resurrect them. He is fully aware of every creation.\"", "verse": 79, "surah": 36}, {"quran": "The One who initiated for you a forest fire, by which you learned to light.", "verse": 80, "surah": 36}, {"quran": "Is not the One who has created the heavens and the earth able to create the like of them? Yes indeed; He is the Creator, the Knowledgeable.", "verse": 81, "surah": 36}, {"quran": "His command, when He wants anything, is to say to it: 'Be,' and it is.", "verse": 82, "surah": 36}, {"quran": "Therefore, praise be to the One in whose Hand is the sovereignty of all things, and to Him you will be returned.", "verse": 83, "surah": 36}]]