[[{"quran": "In the name of God, the Almighty, the Merciful.", "verse": 0, "surah": 15}, {"quran": "ALR, these are the signs of the Book, and a clear Qur'an.", "verse": 1, "surah": 15}, {"quran": "Ultimately, those who have rejected will wish they had submitted!", "verse": 2, "surah": 15}, {"quran": "Leave them to eat and enjoy, and let them be preoccupied with wishful thinking. They will come to know.", "verse": 3, "surah": 15}, {"quran": "We have not destroyed any town except that it had an appointed time.", "verse": 4, "surah": 15}, {"quran": "No nation can quicken its fate, nor can they delay it.", "verse": 5, "surah": 15}, {"quran": "And they said: \"O you upon whom the Reminder has been sent down, you are crazy.\"", "verse": 6, "surah": 15}, {"quran": "\"Why not bring us the angels if you are of the truthful ones?\"", "verse": 7, "surah": 15}, {"quran": "We do not send down the angels except with the truth, and then they would have no more delay.", "verse": 8, "surah": 15}, {"quran": "Indeed it is We who have sent down the Reminder, and indeed it is We who will preserve it.", "verse": 9, "surah": 15}, {"quran": "And We had sent before you, among the groups of old.", "verse": 10, "surah": 15}, {"quran": "And no messenger would come to them, except that they would mock him.", "verse": 11, "surah": 15}, {"quran": "It is such that We let it seep into the hearts of the criminals.", "verse": 12, "surah": 15}, {"quran": "They do not believe in it, while the way of the earlier generations has gone before.", "verse": 13, "surah": 15}, {"quran": "And if We opened for them a gate in the heaven and they were to continue ascending into it,", "verse": 14, "surah": 15}, {"quran": "They would have said: \"Our sight has been fogged. No, we are a people being bewitched!\"", "verse": 15, "surah": 15}, {"quran": "And We have placed towers in the heaven and We have made them pleasant to the onlookers.", "verse": 16, "surah": 15}, {"quran": "And We have guarded it from every outcast devil.", "verse": 17, "surah": 15}, {"quran": "Except he who manages to eavesdrop, he will be pursued by a visible flame.", "verse": 18, "surah": 15}, {"quran": "And the land We have stretched, and placed stabilizers in it, and We have planted in it from everything in balance.", "verse": 19, "surah": 15}, {"quran": "And We have made for you in it a habitat, and for those to whom you are not providers.", "verse": 20, "surah": 15}, {"quran": "And there is not a thing, except that We have treasuries of it, yet We do not send it down except in a precise measure.", "verse": 21, "surah": 15}, {"quran": "And We send the winds to pollinate, so We cause the water to descend from the sky, so We  give to you to drink-and it is not you who store it up.", "verse": 22, "surah": 15}, {"quran": "And it is indeed We who bring to life and make to die, and We are the inheritors.", "verse": 23, "surah": 15}, {"quran": "And We know those who have advanced among you, and We know those who have lagged.", "verse": 24, "surah": 15}, {"quran": "And it is your Lord who will gather them. He is Wise, Knowledgeable.", "verse": 25, "surah": 15}, {"quran": "And We have created the human being from a sludge from hot sediment.", "verse": 26, "surah": 15}, {"quran": "And the Jinn, We created him before that from the fire of the fierce hot winds.", "verse": 27, "surah": 15}, {"quran": "And your Lord said to the angels: \"I am creating a mortal from a sludge from hot sediment.\"", "verse": 28, "surah": 15}, {"quran": "\"So when I evolve him, and blow from My Spirit in him, you shall yield to him.\"", "verse": 29, "surah": 15}, {"quran": "Thus, all of the angels yielded.", "verse": 30, "surah": 15}, {"quran": "Except for Satan, he refused to be of those who yielded.", "verse": 31, "surah": 15}, {"quran": "He said: \"O Satan, what is the matter that you are not of those who yielded?\"", "verse": 32, "surah": 15}, {"quran": "He said: \"I am not to yield to a mortal whom You have created from a sludge from hot sediment.\"", "verse": 33, "surah": 15}, {"quran": "He said: \"Exit from here, you are cast out.\"", "verse": 34, "surah": 15}, {"quran": "\"And a curse shall be upon you until the Day of Recompense.\"", "verse": 35, "surah": 15}, {"quran": "He said: \"My Lord, respite me until the Day they are resurrected.\"", "verse": 36, "surah": 15}, {"quran": "He said: \"You are given respite.\"", "verse": 37, "surah": 15}, {"quran": "\"Until the Day of the time appointed.\"", "verse": 38, "surah": 15}, {"quran": "He said: \"My Lord, for that by which You have caused me to be misled, I will beautify for them what is on the earth, and I will mislead them all.\"", "verse": 39, "surah": 15}, {"quran": "\"Except Your servants from among them, the devoted ones.\"", "verse": 40, "surah": 15}, {"quran": "He said: \"This shall be a straight path to Me.\"", "verse": 41, "surah": 15}, {"quran": "\"For My servants, you shall have no authority over them, except those who are misled and follow you.\"", "verse": 42, "surah": 15}, {"quran": "\"And that Hell shall be their appointment, all of them.\"", "verse": 43, "surah": 15}, {"quran": "\"It has seven gates, for every gate will be an assigned segment from them.\"", "verse": 44, "surah": 15}, {"quran": "The righteous will be in gardens and springs.", "verse": 45, "surah": 15}, {"quran": "\"Enter it in peace and security.\"", "verse": 46, "surah": 15}, {"quran": "And We removed what animosity was in their chests, they are brothers in quarters facing one another.", "verse": 47, "surah": 15}, {"quran": "No fatigue shall touch them, nor will they be evicted from it.", "verse": 48, "surah": 15}, {"quran": "Inform My servants that I am the Forgiver, the Merciful.", "verse": 49, "surah": 15}, {"quran": "And that My punishment is a painful retribution.", "verse": 50, "surah": 15}, {"quran": "And inform them of the guests of Abraham.", "verse": 51, "surah": 15}, {"quran": "When they entered upon him, they said: \"Peace.\" He said: \"We are worrisome of you.\"", "verse": 52, "surah": 15}, {"quran": "They said: \"Do not worry, we bring you good news of a knowledgeable son.\"", "verse": 53, "surah": 15}, {"quran": "He said: \"What good news can you bring me when old age has come upon me? Is that your good news?\"", "verse": 54, "surah": 15}, {"quran": "They said: \"We have brought you good news with the truth, so do not be of those in denial.\"", "verse": 55, "surah": 15}, {"quran": "He said: \"And who would deny the mercy of his Lord except the misguided ones!\"", "verse": 56, "surah": 15}, {"quran": "He said: \"What then is your affair, O messengers?\"", "verse": 57, "surah": 15}, {"quran": "They said: \"We have been sent to a people who are criminals.\"", "verse": 58, "surah": 15}, {"quran": "\"Except for the family of Lot, we will save them all.\"", "verse": 59, "surah": 15}, {"quran": "\"Except for his wife, we have evaluated that she will be with those destroyed.\"", "verse": 60, "surah": 15}, {"quran": "So when the messengers came to the family of Lot.", "verse": 61, "surah": 15}, {"quran": "He said: \"You are an unknown people.\"", "verse": 62, "surah": 15}, {"quran": "They said: \"Alas, we have come to you with that which they are doubting.\"", "verse": 63, "surah": 15}, {"quran": "\"And we have come to you with the truth, and we are forthcoming.\"", "verse": 64, "surah": 15}, {"quran": "\"So let your family leave during the late hours of the night, and you follow just behind them, and do not let any of you look back, and go to where you are commanded.\"", "verse": 65, "surah": 15}, {"quran": "And We made the matter known to him, that the remainder of these people would be wiped out by the morning.", "verse": 66, "surah": 15}, {"quran": "And the people of the city came seeking good news.", "verse": 67, "surah": 15}, {"quran": "He said: \"These are my guests, so do not embarrass me!\"", "verse": 68, "surah": 15}, {"quran": "\"And be aware of God, and do not disgrace me!\"", "verse": 69, "surah": 15}, {"quran": "They said: \"Did we not prohibit you from the world?\"", "verse": 70, "surah": 15}, {"quran": "He said: \"Here are my daughters if it is your intention.\"", "verse": 71, "surah": 15}, {"quran": "By your life, they are in their intoxication, blundering.", "verse": 72, "surah": 15}, {"quran": "So the scream took them at sunrise.", "verse": 73, "surah": 15}, {"quran": "Thus We made its highest part become its lowest, and We rained upon them fiery projectiles.", "verse": 74, "surah": 15}, {"quran": "In this are signs for those who see.", "verse": 75, "surah": 15}, {"quran": "And it was on an established path.", "verse": 76, "surah": 15}, {"quran": "In that is a sign for the believers.", "verse": 77, "surah": 15}, {"quran": "And the people of the Sycamore were wicked.", "verse": 78, "surah": 15}, {"quran": "So, We sought revenge from them. And they are in a clear ledger.", "verse": 79, "surah": 15}, {"quran": "And the dwellers of the enclosure disbelieved the messengers.", "verse": 80, "surah": 15}, {"quran": "And We gave them Our signs, but they turned away from them.", "verse": 81, "surah": 15}, {"quran": "And they used to carve from the mountains homes, to be secure.", "verse": 82, "surah": 15}, {"quran": "So the scream took them in the morning.", "verse": 83, "surah": 15}, {"quran": "What benefit did what they earn make for them?", "verse": 84, "surah": 15}, {"quran": "And We have not created the heavens and the earth and what is in between except with the truth. And the Hour is coming, so overlook their faults gracefully.", "verse": 85, "surah": 15}, {"quran": "Your Lord is the Creator, the Knower.", "verse": 86, "surah": 15}, {"quran": "And We have given you seven of the pairs, and the great Qur'an.", "verse": 87, "surah": 15}, {"quran": "Do not linger with your eyes on what We have bestowed upon some couples from them, and do not grieve for them, and lower your wing for the believers.", "verse": 88, "surah": 15}, {"quran": "And say: \"I am the clarifying warner.\"", "verse": 89, "surah": 15}, {"quran": "As for the dividers in what We sent down.", "verse": 90, "surah": 15}, {"quran": "The ones who have made the Qur'an partial.", "verse": 91, "surah": 15}, {"quran": "By your Lord, We will ask them all.", "verse": 92, "surah": 15}, {"quran": "Regarding what they used to do.", "verse": 93, "surah": 15}, {"quran": "So proclaim what you have been commanded and turn away from the polytheists.", "verse": 94, "surah": 15}, {"quran": "We will relieve you from those who mocked.", "verse": 95, "surah": 15}, {"quran": "Those who place with God another god. They will come to know.", "verse": 96, "surah": 15}, {"quran": "And We know that your chest is strained by what they say.", "verse": 97, "surah": 15}, {"quran": "So glorify the praise of your Lord, and be of those who prostrate.", "verse": 98, "surah": 15}, {"quran": "And serve your Lord until certainty comes to you.", "verse": 99, "surah": 15}]]